
#		**********************************************************************************************************
#		Chapter 14. Interceptors and events
#		**********************************************************************************************************

title14 = \u7B2C\u5341\u56DB\u7AE0. \u62E6\u622A\u5668\u4E0E\u4E8B\u4EF6
p14-1 = \u5E94\u7528\u7A0B\u5E8F\u80FD\u591F\u56DE\u5E94Hibernate\u5185\u90E8\u7684\u4E8B\u4EF6\u662F\u5341\u5206\u6709\u7528\u7684\u3002\u8FD9\u6837\u5C31\u53EF\u4EE5\u5B9E\u73B0\u67D0\u4E9B\u901A\u7528\u7684\u529F\u80FD\uFF0C\u5E76\u53EF\u4EE5\u5BF9Hibernate\u8FDB\u884C\u529F\u80FD\u6027\u7684\u6269\u5C55\u3002

#		**********************************************************************************************************
#		14.1. Interceptors
#		**********************************************************************************************************

title14-1 = 14.1. \u62E6\u622A\u5668
p14-1-1 = <code>Interceptor</code>\u63A5\u53E3\u63D0\u4F9B\u4E86\u4ECEsession\u56DE\u8C03\u5E94\u7528\u7A0B\u5E8F\u7684\u673A\u5236\uFF0C\u5141\u8BB8\u5E94\u7528\u7A0B\u5E8F\u5728\u6301\u4E45\u5316\u5BF9\u8C61\u4FDD\u5B58\uFF0C\u66F4\u65B0\uFF0C\u5220\u9664\u6216\u8005\u52A0\u8F7D\u7684\u65F6\u5019\uFF0C\u68C0\u67E5\u5E76\uFF08\u6216\uFF09\u4FEE\u6539\u5B83\u4EEC\u7684\u5C5E\u6027\u3002\u4E00\u79CD\u53EF\u80FD\u7684\u4F7F\u7528\u573A\u666F\u662F\u7528\u6765\u8FFD\u8E2A\u6388\u6743\u4FE1\u606F\u3002\u6BD4\u5982\uFF0C\u4E0B\u9762\u7684\u8FD9\u4E2A\u62E6\u622A\u5668\uFF0C\u4F1A\u5728\u4E00\u4E2A\u5B9E\u73B0\u4E86 Auditable\u63A5\u53E3\u7684\u5BF9\u8C61\u88AB\u521B\u5EFA\u65F6\u81EA\u52A8\u5730\u8BBE\u7F6EcreateTimestamp\u5C5E\u6027\uFF0C\u5E76\u5728\u5B9E\u73B0\u4E86 Auditable\u63A5\u53E3\u7684\u5BF9\u8C61\u88AB\u66F4\u65B0\u65F6\uFF0C\u540C\u6B65\u66F4\u65B0<code>lastUpdateTimestamp</code>\u5C5E\u6027\u3002
p14-1-2 = \u4F60\u65E2\u53EF\u4EE5\u76F4\u63A5\u5B9E\u73B0\u62E6\u622A\u5668\uFF0C\u4E5F\u53EF\u4EE5\u7EE7\u627F<code>EmptyInterceptor</code>\u3002
p14-1-3 = \u6709\u4E24\u79CD\u7C7B\u578B\u7684\u62E6\u622A\u5668\uFF1A<code>Session-scoped</code> \u548C <code>SessionFactory-scoped</code>\u3002
p14-1-4 = <code>Session-scoped</code>\u5728session\u6253\u5F00\u65F6\u88AB\u6307\u5B9A\u3002
p14-1-5 = <code>SessionFactory-scoped</code>\u62E6\u622A\u5668\u8981\u901A\u8FC7<code>Configuration</code>\u6CE8\u518C\uFF0C\u800C\u8FD9\u5FC5\u987B\u5728\u521B\u5EFA<code>SessionFactory</code>\u4E4B\u524D\u3002\u5728\u8FD9\u79CD\u60C5\u51B5\u4E0B\uFF0C\u7ED9\u51FA\u7684\u62E6\u622A\u5668\u4F1A\u88AB\u8FD9\u4E2ASessionFactory\u6240\u6253\u5F00\u7684\u6240\u6709session\u4F7F\u7528\uFF1B\u9664\u975Esession\u6253\u5F00\u65F6\u660E\u786E\u6307\u660E\u4E86\u4F7F\u7528\u7684\u62E6\u622A\u5668\u3002SessionFactory\u8303\u56F4\u5185\u7684\u62E6\u622A\u5668\uFF0C\u5FC5\u987B\u662F\u7EBF\u7A0B\u5B89\u5168\u7684\uFF0C\u56E0\u4E3A\u591A\u4E2Asession\u53EF\u80FD\u5E76\u53D1\u4F7F\u7528\u8FD9\u4E2A\u62E6\u622A\u5668\uFF0C\u8981\u56E0\u6B64\u5C0F\u5FC3\u4E0D\u8981\u4FDD\u5B58\u4E0Esession\u76F8\u5173\u7684\u72B6\u6001\u3002

#		**********************************************************************************************************
#		14.2. Event system
#		**********************************************************************************************************

title14-2 = 14.2. \u4E8B\u4EF6\u7CFB\u7EDF
p14-2-1 = \u5982\u679C\u9700\u8981\u6301\u4E45\u5C42\u76F8\u5E94\u7279\u5B9A\u7684\u4E8B\u4EF6\uFF0C\u4F60\u53EF\u4EE5\u4F7F\u7528Hibernate\u4E8B\u4EF6\u6846\u67B6\u3002\u65F6\u95F4\u7CFB\u7EDF\u53EF\u4EE5\u7528\u4F5C\u62E6\u622A\u5668\uFF0C\u4E5F\u53EF\u4EE5\u66FF\u4EE3\u5B83\u3002
p14-2-2 = \u6108\u591ASession\u63A5\u53E3\u7684\u65B9\u6CD5\u90FD\u6709\u5BF9\u5E94\u7684\u4E8B\u4EF6\u3002\u6240\u6709\u7684\u4E8B\u4EF6\u7C7B\u578B\u90FD\u88AB\u5B9A\u4E49\u5728\u4E86\u679A\u4E3E<code>org.hibernate.event.spi.EventType</code>\u4E2D\u3002\u5F53\u8BF7\u6C42\u6765\u81EA\u5176\u4E2D\u4E00\u4E2A\u65B9\u6CD5\u65F6\uFF0CHibernate session\u4F1A\u751F\u6210\u4E00\u4E2A\u5BF9\u5E94\u7684\u4E8B\u4EF6\u5E76\u5C06\u5B83\u4F20\u7ED9\u914D\u7F6E\u597D\u7684\u4E8B\u4EF6\u76D1\u542C\u5668\u4E2D\u3002\u7CFB\u7EDF\u9884\u8BBE\u7684\u76D1\u542C\u5668\u5B9E\u73B0\u7684\u5904\u7406\u8FC7\u7A0B\u5C31\u662F\u88AB\u76D1\u542C\u7684\u65B9\u6CD5\u8981\u505A\u7684\uFF08\u88AB\u76D1\u542C\u7684\u65B9\u6CD5\u6240\u505A\u7684\u5176\u5B9E\u4EC5\u4EC5\u662F\u6FC0\u6D3B\u76D1\u542C\u5668\uFF0C\u201C\u5B9E\u9645\u201D\u7684\u5DE5\u4F5C\u662F\u7531\u76D1\u542C\u5668\u5B8C\u6210\u7684\uFF09\u3002\u4E0D\u8FC7\uFF0C\u4F60\u53EF\u4EE5\u81EA\u7531\u5730\u9009\u62E9\u5B9E\u73B0 \u4E00\u4E2A\u81EA\u5DF1\u5B9A\u5236\u7684\u76D1\u542C\u5668\uFF08\u6BD4\u5982\uFF0C\u5B9E\u73B0\u5E76\u6CE8\u518C\u7528\u6765\u5904\u7406\u5904\u7406LoadEvent\u7684LoadEventListener\u63A5\u53E3\uFF09\uFF0C\u6765\u8D1F\u8D23\u5904\u7406\u6240\u6709\u7684\u8C03\u7528Session\u7684<code>load()</code>\u65B9\u6CD5\u7684\u8BF7\u6C42\u3002
nc14-2-1 = \u67E5\u770BHibernate\u5F00\u53D1\u8005\u6307\u5BFC\u6765\u83B7\u53D6\u66F4\u591A\u4FE1\u606F\u3002
p14-2-3 = \u76D1\u542C\u5668\u5E94\u8BE5\u88AB\u8BA4\u4E3A\u662F\u65E0\u72B6\u6001\u7684\uFF1B\u5B83\u4EEC\u5728\u8BF7\u6C42\u4E4B\u95F4\u5171\u4EAB\uFF0C\u5E76\u4E14\u4E0D\u5E94\u8BE5\u6709\u4EFB\u4F55\u72B6\u6001\u4F5C\u4E3A\u6210\u5458\u53D8\u91CF\u3002
p14-2-4 = \u7528\u6237\u81EA\u5B9A\u4E49\u7684\u76D1\u542C\u5668\u5E94\u8BE5\u5B9E\u73B0\u5904\u7406\u4E8B\u4EF6\u7684\u9002\u5F53\u63A5\u53E3\uFF0C\u6216\u8005\u7EE7\u627F\u4E00\u4E2A\u57FA\u7C7B\uFF08\u751A\u81F3\u662F\u4ECEHibernate\u81EA\u5E26\u7684\u9ED8\u8BA4\u4E8B\u4EF6\u76D1\u542C\u5668\u7C7B\u7EE7\u627F\uFF0C\u4E3A\u4E86\u65B9\u4FBF\u4F60\u8FD9\u6837\u505A\uFF0C\u8FD9\u4E9B\u7C7B\u90FD\u88AB\u58F0\u660E\u6210non-final\u7684\u4E86\uFF09\u3002\u8FD9\u662F\u4E00\u4E2A\u81EA\u5B9A\u4E49\u52A0\u8F7D\u4E8B\u4EF6\u76D1\u542C\u5668\u7684\u4F8B\u5B50\uFF1A

#		**********************************************************************************************************
#		14.3. Hibernate declarative security
#		**********************************************************************************************************

title14-3 = 14.3. Hibernate \u5B89\u5168\u58F0\u660E
p14-3-1 = \u901A\u5E38\uFF0CHibernate\u5E94\u7528\u7A0B\u5E8F\u58F0\u660E\u5B89\u5168\u673A\u5236\u7531\u4F1A\u8BDD\u5916\u89C2\u5C42\u7BA1\u7406\u3002\u73B0\u5728\uFF0CHibernate3\u5141\u8BB8\u67D0\u4E9B\u7279\u5B9A\u7684\u884C\u4E3A\u7531JACC\u8FDB\u884C\u8BB8\u53EF\u7BA1\u7406\uFF0C\u7531JAAS\u8FDB\u884C\u6388\u6743\u7BA1\u7406\u3002 \u672C\u529F\u80FD\u662F\u4E00\u4E2A\u5EFA\u7ACB\u5728\u4E8B\u4EF6\u6846\u67B6\u4E4B\u4E0A\u7684\u53EF\u9009\u7684\u529F\u80FD\u3002
p14-3-2 =\u9996\u5148\uFF0C\u4F60\u5FC5\u987B\u8981\u914D\u7F6E\u9002\u5F53\u7684\u4E8B\u4EF6\u76D1\u542C\u5668\uFF08event listener\uFF09\uFF0C\u6765\u6FC0\u6D3B\u4F7F\u7528JAAS\u7BA1\u7406\u6388\u6743\u7684\u529F\u80FD\u3002\u67E5\u770B<strong>Hibernate Developer Guide</strong>\u83B7\u53D6\u66F4\u591A\u7EC6\u8282\u3002\u4E0B\u9762\u662F\u4E00\u4E2A\u6709\u5173\u4E8E\u7528<code>org.hibernate.integrator.spi.Integrator</code>\u5B9E\u73B0\u8FD9\u4E2A\u529F\u80FD\u7684\u4F8B\u5B50\u3002
p14-3-3 =\u4F60\u540C\u6837\u9700\u8981\u51B3\u5B9A\u5982\u4F55\u914D\u7F6E\u4F60\u7684JACC provider\u3002\u4E00\u4E2A\u9009\u62E9\u662F\u544A\u8BC9Hibernate\u4EC0\u4E48\u6743\u9650\u7ED1\u5B9A\u5230\u4EC0\u4E48\u89D2\u8272\u4E0A\uFF0C\u8FD9\u53EF\u4EE5\u5728<code>hibernate.cfg.xml</code>\u6587\u4EF6\u4E2D\u5B9E\u73B0\u3002



























