
#		**********************************************************************************************************
#		Chapter 19. Filtering data
#		**********************************************************************************************************

title19 = \u7B2C\u5341\u4E5D\u7AE0. \u8FC7\u6EE4\u6570\u636E
p19-1 = Hibernate \u63D0\u4F9B\u4E86\u4E00\u79CD\u521B\u65B0\u7684\u65B9\u5F0F\u4F7F\u7528\u201C\u53EF\u89C1\u6027\u89C4\u5219\u201D\u6765\u5904\u7406\u6570\u636E\u3002\u4E00\u4E2AHibernate\u8FC7\u6EE4\u5668\u662F\u5168\u5C40\u7684\u3001\u547D\u540D\u7684\u3001\u53EF\u4EE5\u5E26\u53C2\u6570\u7684\u8FC7\u6EE4\u5668\uFF0C\u5BF9\u4E8E\u67D0\u4E2A\u7279\u5B9A\u7684Hibernate Session\u53EF\u4EE5\u9009\u62E9\u542F\u7528\u6216\u8005\u7981\u7528\u67D0\u4E2A\u8FC7\u6EE4\u5668\u3002

#		**********************************************************************************************************
#		19.1. Hibernate filters
#		**********************************************************************************************************

title19-1 = 19.1. Hibernate\u8FC7\u6EE4\u5668
p19-1-1 = Hibernate \u4E2D\u53EF\u4EE5\u5BF9\u67D0\u4E2A\u7C7B\u6216\u8005\u96C6\u5408\u4F7F\u7528\u9884\u5148\u5B9A\u4E49\u7684\u8FC7\u6EE4\u5668\u6761\u4EF6\u7684\u529F\u80FD\u3002\u8FC7\u6EE4\u6761\u4EF6\u76F8\u5F53\u4E8E\u5B9A\u4E49\u4E00\u4E2A\u975E\u5E38\u7C7B\u4F3C\u4E8E\u7C7B\u548C\u5404\u79CD\u96C6\u5408\u4E0A\u7684Where\u5C5E\u6027\u7684\u7EA6\u675F\u5B50\u53E5\u3002\u7136\u800C\u8FD9\u4E9B\u8FC7\u6EE4\u6761\u4EF6\u662F\u53EF\u53C2\u6570\u5316\u7684\u3002\u5E94\u7528\u7A0B\u5E8F\u53EF\u4EE5\u5728\u8FD0\u884C\u65F6\u51B3\u5B9A\u662F\u5426\u542F\u7528\u7ED9\u5B9A\u7684\u8FC7\u6EE4\u5668\uFF0C\u4EE5\u53CA\u4F7F\u7528\u4EC0\u4E48\u6837\u7684\u53C2\u6570\u503C\u3002\u8FC7\u6EE4\u5668\u7684\u7528\u6CD5\u7C7B\u4F3C\u4E8E\u6570\u636E\u5E93\u7684\u89C6\u56FE\uFF0C\u53EA\u4E0D\u8FC7\u4ED6\u4EEC\u662F\u5728\u5E94\u7528\u7A0B\u5E8F\u4E2D\u88AB\u53C2\u6570\u5316\u3002
p19-1-2 = \u4F7F\u7528 <code>@org.hibernate.annotations.FilterDef</code> \u6216\u8005 <code>@org.hibernate.annotations.FilterDefs</code>\u6765\u5B9A\u4E49\u8FC7\u6EE4\u5668\u6CE8\u89E3\u3002 \u4E00\u4E2A\u8FC7\u6EE4\u5668\u9700\u8981\u5B9A\u4E49 <code>name()</code> \u548C\u4E00\u4E2A <code>parameters()</code>\u6570\u7EC4\u3002\u8FD9\u4E9B\u53C2\u6570\u53EF\u4EE5\u8BA9\u4F60\u5728\u8FD0\u884C\u65F6\u8C03\u6574\u8FC7\u6EE4\u5668\u7684\u884C\u4E3A\u3002\u6BCF\u4E2A\u53C2\u6570\u901A\u8FC7<code>@ParamDef</code>\u5B9A\u4E49\uFF0C\u5305\u62EC\u540D\u5B57\u548C\u7C7B\u578B\u3002\u4F60\u4E5F\u53EF\u4EE5\u4E3A\u4E00\u4E2A<code>@FilterDef</code>\u8BBE\u7F6E<code>defaultCondition()</code>\u53C2\u6570\uFF0C\u5F53\u5728\u6BCF\u4E2A<code>@Filter</code>\u4E2D\u6CA1\u6709\u5B9A\u4E49\u4EFB\u4F55\u6761\u4EF6\u65F6\uFF0C\u5219\u4F7F\u7528\u8BE5\u9ED8\u8BA4\u6761\u4EF6\u3002<code>@FilterDef(s)</code> \u53EF\u4EE5\u5B9A\u4E49\u5728\u7C7B\u7EA7\u6216\u8005\u5305\u7EA7\u3002
p19-1-3 = \u73B0\u5728\u6211\u4EEC\u9700\u8981\u5B9A\u4E49\u7528\u4E8E\u5B9E\u4F53\u6216\u8005\u96C6\u5408\u52A0\u8F7D\u7684SQL\u8FC7\u6EE4\u6761\u4EF6\u3002<code>@Filter</code> \u4ED6\u4EEC\u53EF\u4EE5\u88AB\u653E\u7F6E\u5728\u5B9E\u4F53\u6216\u8005\u96C6\u5408\u4E0A\u4F7F\u7528\u3002<code>@FilterName</code> \u548C <code>@Filter</code>\u4E4B\u95F4\u901A\u8FC7\u6620\u5C04\u540D\u94FE\u63A5\u3002
p19-1-4 = \u5F53\u96C6\u5408\u4F7F\u7528\u5173\u8054\u8868\u6765\u8868\u793A\u65F6\uFF0C\u4E5F\u8BB8\u4F60\u5E0C\u671B\u628A\u8FC7\u6EE4\u6761\u4EF6\u5E94\u7528\u5728\u5173\u8054\u8868\u672C\u8EAB \u6216\u8005 \u5E94\u7528\u5728\u76EE\u6807\u5B9E\u4F53\u8868\u4E0A\u3002\u5728\u76EE\u6807\u5B9E\u4F53\u60F3\u4F7F\u7528\u7EA6\u675F\u5219\u53EA\u9700\u8981\u5E38\u89C4\u7684<code>@Filter</code> \u6CE8\u89E3\u3002\u7136\u800C\uFF0C\u5982\u679C\u4F60\u60F3\u6307\u5B9A\u5173\u8054\u8868\uFF0C\u5219\u4F7F\u7528<code>@FilterJoinTable</code> \u6CE8\u89E3\u3002
p19-1-5 = \u9ED8\u8BA4\u60C5\u51B5\u4E0B\uFF0CHibernate\u4F1A\u5C1D\u8BD5\u786E\u5B9A\u5728<code>@Filter</code> SQl\u6761\u4EF6\u8BED\u53E5\u4E2D\u7684\u6240\u6709\u9700\u8981\u6CE8\u5165\u7684\u522B\u540D\u3002\u5728<code>@Filter</code>\u4E2D\u8BBE\u7F6EdeduceAliasInjectionPoints\u4E3Afalse\u6765\u63A7\u5236\u522B\u540D\u7684\u6CE8\u5C04\u3002\u6CE8\u5C04\u70B9\u4F7F\u7528<code>@SqlFragmentAlias</code>\u6CE8\u89E3\u6807\u6CE8\uFF0C\u6216\u8005\u5728SQL\u6761\u4EF6\u8BED\u53E5\u4E2D\u4F7F\u7528'{'alias'}'\u6765\u6807\u6CE8\u3002
p19-1-6 = \u4E3A\u4E86\u53EF\u4EE5\u660E\u786E\u7684\u58F0\u660E\u63A7\u5236\uFF0C\u5F53Hibernate\u8BA4\u4E3A\u4E00\u4E2AANSI SQL \u4FDD\u7559\u5173\u952E\u5B57\u662F\u4E00\u4E2A\u5217\u800C\u4E0D\u662F\u4E00\u4E2A\u6B63\u786E\u7684\u522B\u540D\u65F6deduceAliasInjectionPoints\u63D0\u4F9B\u4E86\u4E00\u79CD\u65B9\u5F0F\u3002
p19-1-7 = \u4F7F\u7528\u6620\u5C04\u6587\u4EF6\u6765\u5B9A\u4E49\u8FC7\u6EE4\u5668\u7684\u65B9\u5F0F\u975E\u5E38\u7684\u7C7B\u4F3C\u3002\u9996\u5148\u9700\u8981\u5B9A\u4E49\u8FC7\u6EE4\u5668\uFF0C\u7136\u540E\u624D\u53EF\u4EE5\u628A\u8FC7\u6EE4\u5668\u5173\u8054\u5230\u76F8\u5173\u7684\u5143\u7D20\u76F8\u3002\u5728 <code>&lt;hibernate-mapping/&gt;</code>\u5143\u7D20\u4E2D\u4F7F\u7528<code>&lt;filter-def/&gt;</code>\u5143\u7D20\u6765\u5B9A\u4E49\u8FC7\u6EE4\u5668:
p19-1-8 = \u8FD9\u4E2A\u8FC7\u6EE4\u5668\u53EF\u4EE5\u9644\u52A0\u5230\u4E00\u4E2A\u7C7B\u6216\u8005\u96C6\u5408 (\u6216\u8005, \u5728\u8FD9\u4E24\u4E2A\u4E0A\u9762\u90FD\u6DFB\u52A0\u6216\u8005\u540C\u65F6\u7ED1\u5B9A\u591A\u4E2A):
p19-1-9 = \u5728Session\u4E2D\u7684\u65B9\u6CD5\u662F: <code>enableFilter</code>(String filterName), <code>getEnabledFilter</code>(String filterName), \u548C <code>disableFilter</code>(String filterName). \u9ED8\u8BA4\u60C5\u51B5\u4E0B,\u5BF9\u4E8E\u4E00\u4E2A\u7ED9\u5B9ASession\uFF0C\u8FC7\u6EE4\u5668\u662F\u5173\u95ED\u7684\u3002\u8FC7\u6EE4\u5668\u5FC5\u987B\u901A\u8FC7\u8C03\u7528 <code>Session.enableFilter()</code>\u65B9\u6CD5\u6765\u5F00\u542F\u8FC7\u6EE4\u5668\uFF0C\u8FD9\u4E2A\u65B9\u6CD5\u8FD4\u56DE\u4E00\u4E2A\u8FC7\u6EE4\u5668\u7684\u5B9E\u4F8B\u3002\u5982\u679C\u4F60\u4F7F\u7528\u4E0A\u9762\u5B9A\u4E49\u7684\u7B80\u5355\u8FC7\u6EE4\u5668\uFF0C\u4F7F\u7528\u65B9\u5F0F\u5982\u4E0B\uFF1A
p19-1-10 = org.hibernate.Filter\u63A5\u53E3\u4E2D\u7684\u65B9\u6CD5\u652F\u6301\u5728Hibernate\u4E2D\u5E38\u51FA\u73B0\u7684\u65B9\u6CD5\u94FE\u3002
p19-1-11 = \u4E0B\u9762\u662F\u5B8C\u6574\u7684\u793A\u4F8B\uFF0C\u4F7F\u7528\u4E34\u65F6\u6570\u636E\u548C\u8BB0\u5F55\u6570\u636E\u6709\u6548\u671F\u7684\u6A21\u5F0F\uFF1A
p19-1-12 = \u4E3A\u4E86\u786E\u4FDD\u63D0\u4F9B\u7684\u662F\u53CA\u65F6\u6709\u6548\u7684\u6570\u636E\uFF0C\u5728\u68C0\u7D22employee\u6570\u636E\u4E4B\u524D\u5728Session\u4E0A\u5F00\u542F\u8FC7\u6EE4\u5668\uFF1A
p19-1-13 = \u5C3D\u7BA1\u5728\u4E0A\u9762\u7684HQL\u4E2D\u6211\u4EEC\u4EC5\u4EC5\u663E\u793A\u7684\u4F7F\u7528\u4E86\u4E00\u4E2A\u85AA\u6C34\u6761\u4EF6\uFF0C\u4F46\u56E0\u4E3A\u542F\u7528\u4E86\u8FC7\u6EE4\u5668\uFF0C\u67E5\u8BE2\u5C06\u4EC5\u8FD4\u56DE\u90A3\u4E9B\u76EE\u524D\u96C7\u4F63\u5173\u7CFB\u5904\u4E8E\u6709\u6548\u671F\u7684\uFF0C\u5E76\u4E14\u85AA\u6C34\u9AD8\u4E8E\u4E00\u767E\u4E07\u7684\u96C7\u5458\u7684\u6570\u636E\u3002
p19-1-14 = \u5982\u679C\u4F60\u60F3\u5728\u4F7F\u7528\u5916\u8FDE\u63A5\u7684\u540C\u65F6\u4F7F\u7528\u8FC7\u6EE4\u5668\uFF0C\u6216\u8005\u901A\u8FC7HQL\u6216\u8005load fetching,\u8981\u6CE8\u610F\u6761\u4EF6\u8868\u8FBE\u5F0F\u7684\u65B9\u5411\u3002\u6700\u5B89\u5168\u7684\u65B9\u5F0F\u662F\u4F7F\u7528\u5DE6\u5916\u8FDE\u63A5\u3002\u5E76\u4E14\u901A\u5E38\u6765\u8BF4\uFF0C\u5148\u5199\u53C2\u6570\uFF0C\u7136\u540E\u662F\u64CD\u4F5C\u7B26\uFF0C\u6700\u540E\u5199\u6570\u636E\u5E93\u5B57\u6BB5\u7684\u540D\u5B57\u3002
p19-1-15 = \u5B9AFilter\u5B9A\u4E49\u4E4B\u540E\uFF0C\u4ED6\u53EF\u80FD\u88AB\u9644\u52A0\u5230\u591A\u4E2A\u5B9E\u4F53\u6216\u8005\u96C6\u5408\uFF0C\u6BCF\u4E2A\u90FD\u6709\u81EA\u5DF1\u7684\u6761\u4EF6\u3002\u5047\u82E5\u8FD9\u4E9B\u6761\u4EF6\u90FD\u662F\u4E00\u6837\u7684\uFF0C\u6BCF\u6B21\u90FD\u8981\u5B9A\u4E49\u90A3\u5C31\u663E\u5F97\u5F88\u7E41\u7410\u3002  <code>&lt;filter-def/&gt;</code> \u88AB\u7528\u6765\u5B9A\u4E49\u4E00\u4E2A\u9ED8\u8BA4\u6761\u4EF6\uFF0C\u4ED6\u53EF\u80FD\u4F5C\u4E3A\u5C5E\u6027\u6216\u8005CDATA\u51FA\u73B0\uFF1A
p19-1-16 = \u5F53\u8FD9\u4E2Afilter\u88AB\u9644\u52A0\u5230\u4EFB\u4F55\u76EE\u7684\u5730\uFF0C\u4F46\u662F\u6709\u6CA1\u6709\u6307\u660E\u660E\u786E\u7684\u6761\u4EF6\u7684\u65F6\u5019\uFF0C\u8FD9\u4E2A\u6761\u4EF6\u5C31\u4F1A\u88AB\u4F7F\u7528\u3002\u6362\u53E5\u8BDD\u8BF4\uFF0C\u4F60\u53EF\u4EE5\u901A\u8FC7\u7ED9filter\u9644\u52A0\u7279\u522B\u7684\u6761\u4EF6\u6765\u91CD\u8F7D\u9ED8\u8BA4\u6761\u4EF6\u3002























