
#		**********************************************************************************************************
#		Chapter 26. Best Practices
#		**********************************************************************************************************

title26 = \u7B2C\u4E8C\u5341\u516D\u7AE0. \u6700\u4F73\u5B9E\u8DF5
dt26-1-1 = \u8BBE\u8BA1\u7EC6\u7C92\u5EA6\u7684\u6301\u4E45\u5316\u7C7B\u5E76\u4E14\u4F7F\u7528 <code>&lt;component&gt;</code>\u6765\u5B9E\u73B0\u6620\u5C04:
dd26-1-1 = \u4F7F\u7528 <code>Address</code> \u7C7B\u6765\u5C01\u88C5 <code>street</code>, <code>suburb</code>, <code>state</code>, <code>postcode</code>\u3002\u8FD9\u5C06\u6709\u5229\u4E8E\u5B9E\u73B0\u4EE3\u7801\u91CD\u6784\u548C\u7B80\u5316\u4EE3\u7801\u91CD\u6784\u7684\u5DE5\u4F5C\u3002
dt26-1-2 = \u5BF9\u6301\u4E45\u7C7B\u58F0\u660E\u6807\u793A\u7B26\u5C5E\u6027\uFF1A
dd26-1-2 = Hibernate\u4E2D\u6807\u793A\u7B26\u5C5E\u6027\u662F\u53EF\u9009\u7684\u3002\u4E0D\u8FC7\u6709\u5F88\u591A\u539F\u56E0\u8BF4\u660E\u4F60\u5E94\u8BE5\u4F7F\u7528\u6807\u793A\u7B26\u5C5E\u6027\u3002\u6211\u4EEC\u5EFA\u8BAE\u6807\u8BC6\u7B26\u5E94\u8BE5\u662F\u201C\u4EBA\u9020\u201D\u7684\uFF0C\u81EA\u52A8\u751F\u6210\uFF0C\u4E0D\u6D89\u53CA\u4E1A\u52A1\u542B\u4E49\u7684\u3002
dt26-1-3 = \u4F7F\u7528\u81EA\u7136\u952E(natural keys)\u6807\u8BC6\uFF1A
dd26-1-3 = \u5BF9\u6240\u6709\u7684\u5B9E\u4F53\u90FD\u6807\u8BC6\u51FA\u81EA\u7136\u952E, \u4F7F\u7528 <code>&lt;natural-id&gt;</code>\u8FDB\u884C\u6620\u5C04\u3002\u5B9E\u73B0 <code>equals()</code> \u548C <code>hashCode()</code> \u5728\u5176\u4E2D\u7528\u7EC4\u6210\u81EA\u7136\u952E\u7684\u5C5E\u6027\u8FDB\u884C\u6BD4\u8F83\u3002
dt26-1-4 = \u4E3A\u6BCF\u4E2A\u6301\u4E45\u7C7B\u5199\u4E00\u4E2A\u6620\u5C04\u6587\u4EF6:
dd26-1-4 = \u4E0D\u8981\u628A\u6240\u6709\u7684\u6301\u4E45\u7C7B\u6620\u5C04\u90FD\u5199\u5230\u4E00\u4E2A\u5927\u6587\u4EF6\u4E2D\u3002 \u628A <code>com.eg.Foo</code> \u6620\u5C04\u5230 <code>com/eg/Foo.hbm.xml</code>\u4E2D\u3002\u5728\u56E2\u961F\u5F00\u53D1\u73AF\u5883\u4E2D\uFF0C\u8FD9\u4E00\u70B9\u663E\u5F97\u7279\u522B\u6709\u610F\u4E49\u3002
dt26-1-5 = \u628A\u6620\u5C04\u6587\u4EF6\u4F5C\u4E3A\u8D44\u6E90\u52A0\u8F7D:
dd26-1-5 = \u628A\u6620\u5C04\u6587\u4EF6\u548C\u4ED6\u4EEC\u7684\u6620\u5C04\u7C7B\u653E\u5728\u4E00\u8D77\u8FDB\u884C\u90E8\u7F72\u3002
dt26-1-6 = \u8651\u628A\u67E5\u8BE2\u5B57\u7B26\u4E32\u653E\u5728\u7A0B\u5E8F\u5916\u9762:
dd26-1-6 = \u5982\u679C\u4F60\u7684\u67E5\u8BE2\u4E2D\u8C03\u7528\u4E86\u975EANSI\u6807\u51C6\u7684SQL\u51FD\u6570\uFF0C\u90A3\u4E48\u8FD9\u6761\u5B9E\u8DF5\u7ECF\u9A8C\u5BF9\u4F60\u9002\u7528\u3002\u628A\u67E5\u8BE2\u5B57\u7B26\u4E32\u653E\u5728\u6620\u5C04\u6587\u4EF6\u4E2D\u53EF\u4EE5\u8BA9\u7A0B\u5E8F\u5177\u6709\u66F4\u597D\u7684\u53EF\u79FB\u690D\u6027\u3002
dt26-1-7 = \u4F7F\u7528\u7ED1\u5B9A\u53D8\u91CF\u3002
dd26-1-7 = \u5C31\u50CF\u5728JDBC\u7F16\u7A0B\u4E2D\u4E00\u6837, \u5E94\u8BE5\u603B\u662F\u7528\u5360\u4F4D\u7B26"?"\u6765\u66FF\u6362\u975E\u5E38\u91CF\u503C. \u4E0D\u8981\u5728\u67E5\u8BE2\u4E2D\u7528\u5B57\u7B26\u4E32\u503C\u6765\u6784\u9020\u975E\u5E38\u91CF\u503C\uFF0C\u66F4\u597D\u7684\u529E\u6CD5\u662F\u5728\u67E5\u8BE2\u4E2D\u4F7F\u7528\u547D\u540D\u53C2\u6570\u3002
dt26-1-8 = \u4E0D\u8981\u81EA\u5DF1\u6765\u7BA1\u7406JDBC connections:
dd26-1-8 = Hibernate\u5141\u8BB8\u5E94\u7528\u7A0B\u5E8F\u81EA\u5DF1\u6765\u7BA1\u7406JDBC connections, \u4F46\u662F\u5E94\u8BE5\u4F5C\u4E3A\u6700\u540E\u6CA1\u6709\u529E\u6CD5\u7684\u529E\u6CD5\u3002\u5982\u679C\u4F60\u4E0D\u80FD\u4F7F\u7528Hibernate\u5185\u5EFA\u7684connections providers\uFF0C\u90A3\u4E48\u8003\u8651\u5B9E\u73B0\u81EA\u5DF1\u6765\u5B9E\u73B0 <code>org.hibernate.connection.ConnectionProvider</code>\u3002
dt26-1-9 = \u8003\u8651\u4F7F\u7528\u7528\u6237\u81EA\u5B9A\u4E49\u7C7B\u578B:
dd26-1-9 = \u5047\u8BBE\u4F60\u6709\u4E00\u4E2AJava\u7C7B\u578B\uFF0C\u6765\u81EA\u67D0\u4E9B\u7C7B\u5E93\uFF0C\u9700\u8981\u88AB\u6301\u4E45\u5316\uFF0C\u4F46\u662F\u8BE5\u7C7B\u6CA1\u6709\u63D0\u4F9B\u6620\u5C04\u64CD\u4F5C\u9700\u8981\u7684\u5B58\u53D6\u65B9\u6CD5\u3002\u90A3\u4E48\u4F60\u5E94\u8BE5\u8003\u8651\u5B9E\u73B0 <code>org.hibernate.UserType</code>\u63A5\u53E3\u3002\u8FD9\u79CD\u529E\u6CD5\u4F7F\u7A0B\u5E8F\u4EE3\u7801\u5199\u8D77\u6765\u66F4\u52A0\u81EA\u5982\uFF0C\u4E0D\u518D\u9700\u8981\u8003\u8651\u7C7B\u4E0EHibernate type\u4E4B\u95F4\u7684\u76F8\u4E92\u8F6C\u6362\u3002
dt26-1-10 = \u5728\u6027\u80FD\u74F6\u9888\u7684\u5730\u65B9\u4F7F\u7528\u786C\u7F16\u7801\u7684JDBC:
dd26-1-10 = \u5728\u7CFB\u7EDF\u4E2D\u5BF9\u6027\u80FD\u8981\u6C42\u5F88\u4E25\u683C\u7684\u4E00\u4E9B\u90E8\u5206\uFF0C\u67D0\u4E9B\u64CD\u4F5C\u4E5F\u8BB8\u76F4\u63A5\u4F7F\u7528JDBC\u4F1A\u66F4\u597D\u3002 \u4F46\u662F\u8BF7\u5148\u786E\u8BA4\u8FD9\u7684\u786E\u662F\u4E00\u4E2A\u74F6\u9888\uFF0C\u5E76\u4E14\u4E0D\u8981\u60F3\u5F53\u7136\u8BA4\u4E3AJDBC\u4E00\u5B9A\u4F1A\u66F4\u5FEB\u3002\u5982\u679C\u786E\u5B9E\u9700\u8981\u76F4\u63A5\u4F7F\u7528JDBC\uFF0C\u90A3\u4E48\u6700\u597D\u6253\u5F00\u4E00\u4E2A Hibernate Session \u7136\u540E\u4ECE <code>Session</code>\u83B7\u5F97connection\uFF0C\u628A\u4F60\u7684JDBC\u64CD\u4F5C\u5305\u88C5\u6210 <code>org.hibernate.jdbc.Work</code>\u5BF9\u8C61\u5E76\u4E14\u4F7F\u7528\u8FD9\u4E2AJDBC\u94FE\u63A5\u3002\u8FD9\u6837\u4F60\u5C31\u53EF\u4EE5\u7EE7\u7EED\u4F7F\u7528\u76F8\u540C\u7684\u4E8B\u52A1\u7B56\u7565\u548C\u5E95\u5C42\u7684\u94FE\u63A5\u63D0\u4F9B\u8005\u3002
dt26-1-11 = \u7406\u89E3Session\u6E05\u6D17\uFF08 flushing\uFF09:
dd26-1-11 = \u6709\u65F6\u5019Session\u4F1A\u4E0D\u65F6\u7684\u5411\u6570\u636E\u5E93\u540C\u6B65\u6301\u4E45\u5316\u72B6\u6001\uFF0C\u5982\u679C\u8FD9\u79CD\u64CD\u4F5C\u8FDB\u884C\u7684\u8FC7\u4E8E\u9891\u7E41\uFF0C\u6027\u80FD\u4F1A\u53D7\u5230\u4E00\u5B9A\u7684\u5F71\u54CD\u3002\u6709\u65F6\u5019\u4F60\u53EF\u4EE5\u901A\u8FC7\u7981\u6B62\u81EA\u52A8flushing\uFF0C\u5C3D\u91CF\u6700\u5C0F\u5316\u975E\u5FC5\u8981\u7684flushing\u64CD\u4F5C\uFF0C\u6216\u8005\u66F4\u8FDB\u4E00\u6B65\uFF0C\u5728\u4E00\u4E2A\u7279\u5B9A\u7684transaction\u4E2D\u6539\u53D8\u67E5\u8BE2\u548C\u5176\u5B83\u64CD\u4F5C\u7684\u987A\u5E8F\u3002
dt26-1-12 = \u5728\u4E09\u5C42\u7ED3\u6784\u4E2D\uFF0C\u8003\u8651\u4F7F\u7528\u6258\u7BA1\u5BF9\u8C61:
dd26-1-12 = \u5F53\u4F7F\u7528\u4E00\u4E2Aservlet / session bean \u7C7B\u578B\u7684\u67B6\u6784\u7684\u65F6\u5019, \u4F60\u53EF\u4EE5\u628A\u5DF2\u52A0\u8F7D\u7684\u6301\u4E45\u5BF9\u8C61\u5728session bean\u5C42\u548Cservlet / JSP \u5C42\u4E4B\u95F4\u6765\u56DE\u4F20\u9012\u3002 \u4F7F\u7528\u65B0\u7684session\u6765\u4E3A\u6BCF\u4E2A\u8BF7\u6C42\u670D\u52A1\uFF0C\u4F7F\u7528<code>Session.merge()</code> \u6216\u8005 <code>Session.saveOrUpdate()</code> \u6765\u4E0E\u6570\u636E\u5E93\u540C\u6B65\u3002
dt26-1-13 = \u5728\u4E24\u5C42\u7ED3\u6784\u4E2D\uFF0C\u8003\u8651\u4F7F\u7528\u957F\u6301\u4E45\u4E0A\u4E0B\u6587:
dd26-1-13 = \u4E3A\u4E86\u5F97\u5230\u6700\u4F73\u7684\u53EF\u4F38\u7F29\u6027\uFF0C\u6570\u636E\u5E93\u4E8B\u52A1(Database Transaction)\u5E94\u8BE5\u5C3D\u53EF\u80FD\u7684\u77ED\u3002\u7136\u800C, \u7A0B\u5E8F\u5E38\u5E38\u9700\u8981\u5B9E\u73B0\u957F\u65F6\u95F4\u8FD0\u884C\u7684\u5E94\u7528\u7A0B\u5E8F\u4E8B\u52A1\uFF0C\u5305\u542B\u4E00\u4E2A\u4ECE\u7528\u6237\u7684\u89C2\u70B9\u6765\u770B\u7684\u539F\u5B50\u64CD\u4F5C\u3002\u8FD9\u4E2A\u5E94\u7528\u7A0B\u5E8F\u4E8B\u52A1\u53EF\u80FD\u8DE8\u8D8A\u591A\u6B21\u4ECE\u7528\u6237\u8BF7\u6C42\u5230\u5F97\u5230\u53CD\u9988\u7684\u5FAA\u73AF\u3002 \u7528\u8131\u7BA1\u5BF9\u8C61(\u4E0Esession\u8131\u79BB\u7684\u5BF9\u8C61)\u6765\u5B9E\u73B0\u5E94\u7528\u7A0B\u5E8F\u4E8B\u52A1\u662F\u5E38\u89C1\u7684\u3002\u6216\u8005\uFF0C\u5C24\u5176\u5728\u4E24\u5C42\u7ED3\u6784\u4E2D\uFF0C\u628AHibernate Session\u4ECEJDBC\u8FDE\u63A5\u4E2D\u8131\u79BB\u5F00\uFF0C\u4E0B\u6B21\u9700\u8981\u7528\u7684\u65F6\u5019\u518D\u8FDE\u63A5\u4E0A\u3002\u7EDD\u4E0D\u8981\u628A\u4E00\u4E2ASession\u7528\u5728\u591A\u4E2A\u5E94\u7528\u7A0B\u5E8F\u4E8B\u52A1(Application Transaction)\u4E2D\uFF0C\u5426\u5219\u4F60\u7684\u6570\u636E\u53EF\u80FD\u4F1A\u8FC7\u671F\u5931\u6548\u3002
dt26-1-14 = \u4E0D\u8981\u628A\u5F02\u5E38\u770B\u6210\u53EF\u6062\u590D\u7684:
dd26-1-14 =\u8FD9\u4E00\u70B9\u751A\u81F3\u6BD4\u201C\u6700\u4F73\u5B9E\u8DF5\u201D\u8FD8\u8981\u91CD\u8981\u3002 \u5F53\u5F02\u5E38\u53D1\u751F\u7684\u65F6\u5019,\u5FC5\u987B\u8981\u56DE\u6EDA Transaction \uFF0C\u5173\u95EDSession\u3002\u5982\u679C\u4F60\u4E0D\u8FD9\u6837\u505A\u7684\u8BDD\uFF0CHibernate\u65E0\u6CD5\u4FDD\u8BC1\u5185\u5B58\u72B6\u6001\u7CBE\u786E\u7684\u53CD\u5E94\u6301\u4E45\u72B6\u6001\u3002\u4F8B\u5982\uFF0C\u5C24\u5176\u4E0D\u8981\u4F7F\u7528<code>Session.load()</code>\u6765\u5224\u65AD\u4E00\u4E2A\u7ED9\u5B9A\u6807\u8BC6\u7B26\u7684\u5BF9\u8C61\u5B9E\u4F8B\u5728\u6570\u636E\u5E93\u4E2D\u662F\u5426\u5B58\u5728\uFF0C\u5E94\u8BE5\u4F7F\u7528<code>Session.get()</code>\u6216\u8005\u8FDB\u884C\u4E00\u6B21\u67E5\u8BE2\u3002
dt26-1-15 = \u5BF9\u4E8E\u5173\u8054\u4F18\u5148\u8003\u8651lazy fetching\uFF1A
dd26-1-15 = \u8C28\u614E\u7684\u4F7F\u7528\u4E3B\u52A8\u6293\u53D6\u3002\u5BF9\u4E8E\u5173\u8054\u6765\u8BF4\uFF0C\u82E5\u5176\u76EE\u6807\u662F\u65E0\u6CD5\u5728\u7B2C\u4E8C\u7EA7\u7F13\u5B58\u4E2D\u5B8C\u5168\u7F13\u5B58\u6240\u6709\u5B9E\u4F8B\u7684\u7C7B\uFF0C\u5E94\u8BE5\u4F7F\u7528\u4EE3\u7406(proxies)\u4E0E/\u6216\u5177\u6709\u5EF6\u8FDF\u52A0\u8F7D\u5C5E\u6027\u7684\u96C6\u5408\u3002\u82E5\u76EE\u6807\u662F\u53EF\u4EE5\u88AB\u7F13\u5B58\u7684\uFF0C\u5C24\u5176\u662F\u7F13\u5B58\u7684\u547D\u4E2D\u7387\u975E\u5E38\u9AD8\u7684\u60C5\u51B5\u4E0B\uFF0C\u5E94\u8BE5\u4F7F\u7528 <code>lazy="false"</code>\uFF0C\u660E\u786E\u7684\u7981\u6B62\u6389eager fetching\u3002  \u5982\u679C\u90A3\u4E9B\u7279\u6B8A\u7684\u786E\u5B9E\u9002\u5408\u4F7F\u7528join fetch \u7684\u573A\u5408\uFF0C\u8BF7\u5728\u67E5\u8BE2\u4E2D\u4F7F\u7528left join fetch\u3002
dt26-1-16 = \u4F7F\u7528open session in view\u6A21\u5F0F\uFF0C\u6216\u8005\u6267\u884C\u4E25\u683C\u7684\u88C5\u914D\u671F\u7B56\u7565\u6765\u907F\u514D\u518D\u6B21\u6293\u53D6\u6570\u636E\u5E26\u6765\u7684\u95EE\u9898\uFF1A
dd26-1-16 = Hibernate\u8BA9\u5F00\u53D1\u8005\u4EEC\u6446\u8131\u4E86\u7E41\u7410\u7684Data Transfer Objects (DTO)\u3002\u5728\u4F20\u7EDF\u7684EJB\u7ED3\u6784\u4E2D\uFF0CDTO\u6709\u53CC\u91CD\u4F5C\u7528: \u9996\u5148\uFF0C\u4ED6\u4EEC\u89E3\u51B3\u4E86entity bean\u65E0\u6CD5\u5E8F\u5217\u5316\u7684\u95EE\u9898; \u5176\u6B21\uFF0C\u4ED6\u4EEC\u9690\u542B\u5730\u5B9A\u4E49\u4E86\u4E00\u4E2A\u88C5\u914D\u671F\uFF0C\u5728\u6B64\u671F\u95F4\uFF0C\u6240\u6709\u5728view\u5C42\u9700\u8981\u7528\u5230\u7684\u6570\u636E\uFF0C\u90FD\u88AB\u6293\u53D6\u3001\u96C6\u4E2D\u5230\u4E86DTO\u4E2D\uFF0C\u7136\u540E\u63A7\u5236\u624D\u88AB\u88C5\u5230\u8868\u793A\u5C42\u3002Hibernate\u7EC8\u7ED3\u4E86\u7B2C\u4E00\u4E2A\u4F5C\u7528\u3002\u7136\u800C\uFF0C\u9664\u975E\u4F60\u505A\u597D\u4E86\u5728\u6574\u4E2A\u6E32\u67D3\u8FC7\u7A0B\u4E2D\u90FD\u7EF4\u62A4\u4E00\u4E2A\u6253\u5F00\u7684\u6301\u4E45\u5316\u4E0A\u4E0B\u6587(session)\u7684\u51C6\u5907\uFF0C\u4F60\u4ECD\u7136\u9700\u8981\u4E00\u4E2A\u88C5\u914D\u671F\u3002 \u60F3\u8C61\u4E00\u4E0B\uFF0C\u4F60\u7684\u4E1A\u52A1\u65B9\u6CD5\u4E0E\u4F60\u7684\u8868\u793A\u5C42\u6709\u4E25\u683C\u7684\u5951\u7EA6\uFF0C\u6570\u636E\u603B\u662F\u88AB\u653E\u7F6E\u5230\u6258\u7BA1\u5BF9\u8C61\u4E2D\u3002\u8FD9\u5E76\u975E\u662FHibernate\u7684\u9650\u5236\uFF01\u8FD9\u662F\u5B9E\u73B0\u5B89\u5168\u7684\u4E8B\u52A1\u5316\u6570\u636E\u8BBF\u95EE\u7684\u57FA\u672C\u9700\u6C42\u3002
dt26-1-17 = \u8003\u8651\u628AHibernate\u4EE3\u7801\u4ECE\u4E1A\u52A1\u903B\u8F91\u4EE3\u7801\u4E2D\u62BD\u8C61\u51FA\u6765:
dd26-1-17 = \u628AHibernate\u7684\u6570\u636E\u5B58\u53D6\u4EE3\u7801\u9690\u85CF\u5230\u63A5\u53E3\u7684\u540E\u9762\u3002\u7EC4\u5408\u4F7F\u7528DAO\u548CThread Local Session\u6A21\u5F0F\u3002\u901A\u8FC7Hibernate\u7684UserType\uFF0C\u4F60\u751A\u81F3\u53EF\u4EE5\u7528\u786C\u7F16\u7801\u7684JDBC\u6765\u6301\u4E45\u5316\u90A3\u4E9B\u672C\u8BE5\u88ABHibernate\u6301\u4E45\u5316\u7684\u7C7B\u3002\u8BE5\u5EFA\u8BAE\u66F4\u9002\u7528\u4E8E\u89C4\u6A21\u8DB3\u591F\u5927\u5E94\u7528\u8F6F\u4EF6\u4E2D\uFF0C\u5BF9\u4E8E\u90A3\u4E9B\u53EA\u67095\u5F20\u8868\u7684\u5E94\u7528\u7A0B\u5E8F\u5E76\u4E0D\u9002\u5408\u3002
dt26-1-18 = \u4E0D\u8981\u7528\u602A\u5F02\u7684\u8FDE\u63A5\u6620\u5C04:
dd26-1-18 = \u591A\u5BF9\u591A\u8FDE\u63A5\u7528\u5F97\u597D\u7684\u4F8B\u5B50\u5B9E\u9645\u4E0A\u76F8\u5F53\u5C11\u89C1\u3002 \u5927\u591A\u6570\u65F6\u5019\u4F60\u5728\u201C\u8FDE\u63A5\u8868\u201D\u4E2D\u9700\u8981\u4FDD\u5B58\u989D\u5916\u7684\u4FE1\u606F\u3002\u3002\u8FD9\u79CD\u60C5\u51B5\u4E0B\uFF0C\u7528\u4E24\u4E2A\u6307\u5411\u4E2D\u4ECB\u7C7B\u7684\u4E00\u5BF9\u591A\u7684\u8FDE\u63A5\u6BD4\u8F83\u597D\u3002 \u5B9E\u9645\u4E0A\uFF0C\u6211\u4EEC\u8BA4\u4E3A\u7EDD\u5927\u591A\u6570\u7684\u8FDE\u63A5\u662F\u4E00\u5BF9\u591A\u548C\u591A\u5BF9\u4E00\u7684\uFF0C\u4F60\u5E94\u8BE5\u8C28\u614E\u4F7F\u7528\u5176\u5B83\u8FDE\u63A5\u98CE\u683C\uFF0C\u7528\u4E4B\u524D\u95EE\u81EA\u5DF1\u4E00\u53E5\uFF0C\u662F\u5426\u771F\u7684\u5FC5\u987B\u8FD9\u4E48\u505A\u3002
dt26-1-19 = \u504F\u7231\u53CC\u5411\u5173\u8054:
dd26-1-19 = \u5355\u5411\u5173\u8054\u66F4\u52A0\u96BE\u4E8E\u67E5\u8BE2\u3002\u5728\u5927\u578B\u5E94\u7528\u4E2D\uFF0C\u51E0\u4E4E\u6240\u6709\u7684\u5173\u8054\u5FC5\u987B\u5728\u67E5\u8BE2\u4E2D\u53EF\u4EE5\u53CC\u5411\u5BFC\u822A\u3002























