
#		**********************************************************************************************************
#		Chapter 27. Database Portability Considerations
#		**********************************************************************************************************

title27 = \u7B2C\u4E8C\u5341\u4E03\u7AE0. \u6570\u636E\u5E93\u53EF\u79FB\u690D\u6027

#		**********************************************************************************************************
#		27.1. Portability Basics
#		**********************************************************************************************************

title27-1 = 27.1. \u53EF\u79FB\u690D\u6027\u57FA\u7840
p27-1-1 = Hibernate\u7684\u4E00\u5927\u5356\u70B9\uFF08\u5305\u62EC\u6240\u6709\u7684\u5173\u7CFB/\u5BF9\u8C61\u578B\u6570\u636E\u5E93\uFF09\u5C31\u662F\u5B83\u5F3A\u5927\u7684\u53EF\u79FB\u690D\u6027\u3002\u8FD9\u610F\u5473\u7740\u4E00\u4E2AIT\u7528\u6237\u80FD\u591F\u8F7B\u677E\u7684\u66F4\u6362\u6570\u636E\u5E93\uFF0C\u6216\u8005\u53EF\u4EE5\u5F00\u53D1\u51FA\u4E00\u4E2A\u6846\u67B6\uFF0C\u6765\u4E3A\u8FD9\u4E2A\u6846\u67B6\u7684\u4F7F\u7528\u8005\u63D0\u4F9B\u591A\u6570\u636E\u5E93\u670D\u52A1\u3002\u4E0D\u7BA1\u5177\u4F53\u7684\u9700\u6C42\u662F\u4EC0\u4E48\uFF0C\u6700\u57FA\u672C\u7684\u539F\u56E0\u662F\u4F60\u5E0C\u671B\u5728\u4E0D\u6539\u52A8\u4EFB\u4F55\u4EE3\u7801\u4EE5\u53CA\u6620\u5C04\u6570\u636E\u7684\u60C5\u51B5\u4E0B\u5C31\u80FD\u591F\u8FC1\u79FB\u6570\u636E\u5E93\u3002

#		**********************************************************************************************************
#		27.2. Dialect
#		**********************************************************************************************************

title27-2 = 27.2. \u65B9\u8A00
p27-2-1 = Hibernate\u6709\u5173\u53EF\u79FB\u690D\u6027\u7684\u7B2C\u4E00\u884C\u5C31\u662F\u65B9\u8A00\uFF0C\u4E5F\u5C31\u662F<code>org.hibernate.dialect.Dialect</code>\u3002Hibernate\u4E3A\u4E86\u5B8C\u6210\u7279\u5B9A\u4EFB\u52A1\u5BF9\u4E0D\u540C\u7684\u6570\u636E\u5E93\u7684\u64CD\u4F5C\u662F\u4E0D\u540C\u7684\uFF08\u6BD4\u5982SELECT\u8BED\u53E5\uFF09\uFF0C\u65B9\u8A00\u5219\u5C01\u88C5\u4E86\u6240\u6709\u7684\u8FD9\u4E9B\u4E0D\u540C\u70B9\u3002Hibernate\u4E3A\u7EDD\u5927\u591A\u6570\u6D41\u884C\u7684\u6570\u636E\u5E93\u8FDB\u884C\u4E86\u5904\u7406\u3002\u5982\u679C\u4F60\u53D1\u73B0\u4F60\u7279\u5B9A\u7684\u6570\u636E\u5E93\u4E0D\u5728\u5176\u4E2D\uFF0C\u90A3\u4E48\u4F60\u81EA\u5DF1\u5199\u4E00\u4E2A\u4E5F\u4E0D\u662F\u7279\u6BD4\u7684\u96BE\u3002

#		**********************************************************************************************************
#		27.3. Dialect resolution
#		**********************************************************************************************************

title27-3 = 27.3. \u65B9\u8A00\u89E3\u51B3\u65B9\u6848
p27-3-1 = \u6700\u5F00\u59CB\uFF0CHibernate\u8981\u6C42\u7528\u6237\u5FC5\u987B\u660E\u786E\u6307\u5B9A\u65B9\u8A00\u3002\u5F53\u7528\u6237\u60F3\u540C\u65F6\u4F5C\u7528\u4E0E\u591A\u4E2A\u6570\u636E\u5E93\u7684\u7B80\u5386\uFF0C\u8FD9\u662F\u6709\u95EE\u9898\u7684\u3002\u4E00\u822C\u9047\u5230\u8FD9\u79CD\u60C5\u51B5\uFF0C\u5C31\u9700\u8981\u7528\u6237\u53BB\u914D\u7F6EHiberante\u65B9\u8A00\u6216\u8005\u81EA\u5B9A\u4E49\u65B9\u6CD5\u6765\u8BBE\u7F6E\u503C\u3002
p27-3-2 = \u4ECE3.2\u7248\u672C\u5F00\u59CB\uFF0CHibernate\u5F00\u59CB\u51FA\u73B0\u81EA\u52A8\u63A2\u6D4B\u65B9\u8A00\u7684\u6982\u5FF5\uFF0C\u901A\u8FC7\u4F7F\u7528\u4ECE\u6570\u636E\u5E93\u7684<code>java.sql.Connection</code>\u83B7\u5F97\u7684<code>java.sql.DatabaseMetaData</code>\u6765\u5B9E\u73B0\u8FD9\u4E00\u6982\u5FF5\u3002\u8FD9\u6837\u5C31\u53D8\u5F97\u597D\u591A\u4E86\uFF0C\u4F46\u662F\u5B58\u5728\u7684\u95EE\u9898\u5728\u4E8EHibernate\u5FC5\u987B\u63D0\u524D\u77E5\u9053\u6570\u636E\u5E93\uFF0C\u5E76\u4E14\u4E0D\u80FD\u88AB\u914D\u7F6E\u6216\u91CD\u5199\u3002
p27-3-3 = \u4ECE3.3\u7248\u672C\u5F00\u59CB\uFF0CHiberante\u6709\u4E86\u66F4\u52A0\u5F3A\u529B\u7684\u65B9\u6CD5\u6765\u81EA\u52A8\u63A2\u6D4B\u65B9\u8A00\uFF1A\u901A\u8FC7\u4E00\u4E2A\u7C7B\u4E2D\u4E00\u7CFB\u5217\u7684\u4EE3\u7406\u6765\u5B9E\u73B0\uFF0C\u8FD9\u4E2A\u7C7B\u5B9E\u73B0\u4E86\u53EA\u6709\u4E00\u4E2A\u65B9\u6CD5\u7684\u63A5\u53E3<code>org.hibernate.dialect.resolver.DialectResolver</code>\uFF1A
p27-3-4 = \u8FD9\u91CC\u6700\u57FA\u7840\u7684\u539F\u7406\u662F\uFF1A\u5982\u679C\u89E3\u6790\u5668\u77E5\u9053\u6570\u636E\u5E93\uFF0C\u90A3\u4E48\u76F4\u63A5\u8FD4\u56DE\u76F8\u5BF9\u5E94\u7684\u65B9\u8A00\uFF1B\u5982\u679C\u4E0D\u77E5\u9053\u5C31\u8FD4\u56DEnull\u5E76\u4EA4\u7ED9\u4E0B\u4E2A\u89E3\u6790\u5668\u3002The signature also identifies <code>org.hibernate.exception.JDBCConnectionException</code> as possibly being thrown. A JDBCConnectionException here is interpreted to imply a "non transient" (aka non-recoverable) connection problem and is used to indicate an immediate stop to resolution attempts. All other exceptions result in a warning and continuing on to the next resolver.
p27-3-5 = \u8FD9\u4E9B\u89E3\u6790\u5668cool\u7684\u5730\u65B9\u5728\u4E8E\u7528\u6237\u53EF\u4EE5\u81EA\u5B9A\u4E49\u81EA\u5DF1\u7684\u89E3\u6790\u5668\uFF0C\u5E76\u5728\u5176\u4ED6Hibernate\u5185\u5EFA\u89E3\u6790\u5668\u4E4B\u524D\u6267\u884C\u3002\u8FD9\u5728\u8BB8\u591A\u4E0D\u540C\u7684\u60C5\u51B5\u4E0B\u5341\u5206\u6709\u7528\uFF1A\u5B83\u53EF\u4EE5\u8F7B\u677E\u7684\u6574\u5408\u65B9\u8A00\u81EA\u52A8\u68C0\u6D4B\u548CHibernate\u672C\u8EAB\u81EA\u5E26\u7684\u89E3\u6790\u5668\uFF1B\u5B83\u53EF\u4EE5\u5728Hibernate\u77E5\u9053\u8FD9\u4E2A\u6570\u636E\u5E93\u7684\u65F6\u5019\u6307\u5B9A\u81EA\u5DF1\u7684\u65B9\u8A00\uFF1B\u7B49\u7B49\u3002\u8981\u6CE8\u518C\u4E00\u4E2A\u6216\u8005\u591A\u4E2A\u89E3\u6790\u5668\uFF0C\u53EA\u9700\u8981\u4F7F\u7528'hibernate.dialect_resolvers'\u914D\u7F6E\u5B83\u4EEC\u5C31\u53EF\u4EE5\u4E86\u3002

#		**********************************************************************************************************
#		27.4. Identifier generation
#		**********************************************************************************************************

title27-4 = 27.4. \u751F\u6210\u6807\u793A\u7B26
p27-4-1 = \u5F53\u8003\u8651\u5230\u6570\u636E\u5E93\u7684\u53EF\u79FB\u690D\u6027\u65F6\uFF0C\u53E6\u4E00\u4E2A\u5341\u5206\u91CD\u8981\u7684\u51B3\u5B9A\u662F\u9009\u62E9\u4F60\u60F3\u8981\u7684id\u751F\u6210\u7B56\u7565\u3002\u6700\u5F00\u59CBHibernate\u63D0\u4F9B\u4E86native\u751F\u6210\u5668\uFF0C\u8FD9\u4E2A\u751F\u6210\u5668\u7684\u76EE\u7684\u5728\u4E8E\u6839\u636E\u5E95\u5C42\u6570\u636E\u5E93\uFF0C\u4ECE\u5E8F\u5217\uFF0Cid\u6216\u8005\u8868\u7B56\u7565\u4E2D\u9009\u62E9\u4E00\u4E2A\u3002\u7136\u800C\uFF0C\u8FD9\u4E2A\u65B9\u5F0F\u5B58\u5728\u4E00\u4E2A\u95EE\u9898\uFF0C\u5C31\u662F\u4E00\u4E9B\u6570\u636E\u5E93\u652F\u6301id\u751F\u6210\u7B56\u7565\uFF0C\u800C\u53E6\u4E00\u4E9B\u5E76\u4E0D\u652F\u6301\u3002id\u7684\u751F\u6210\u4F9D\u8D56\u4E0ESQL\u5B9A\u4E49\u7684id\uFF08\u6216\u8005\u81EA\u589E\u957F\uFF09\u5217\u7684\u503C\uFF1B\u8FD9\u662F\u4E00\u4E2A\u63D2\u5165\u4E4B\u540E\u751F\u6210\u7B56\u7565\uFF0C\u56E0\u4E3A\u6211\u4EEC\u53EA\u6709\u5728\u63D2\u5165\u4E00\u6761\u6570\u636E\u4E4B\u540E\u624D\u80FD\u77E5\u9053\u5B83\u7684id\u503C\u3002\u7531\u4E8EHibernate\u9700\u8981\u9760\u8FD9\u4E2A\u503C\u6765\u533A\u5206\u6301\u4E45\u4E0A\u4E0B\u6587\u4E2D\u7684\u5F15\u7528\u5BF9\u8C61\uFF0C\u6240\u4EE5\u5728\u7528\u6237\u8BF7\u6C42\u5C06\u5B9E\u4F53\u7C7B\u5206\u914D\u5230session\uFF08\u6BD4\u5982\u8C03\u7528save()\u65B9\u6CD5\u65F6\uFF09\u65F6\uFF0C\u4E0D\u7BA1\u5F53\u524D\u4E8B\u52A1\u8BED\u4E49\u5982\u4F55\u90FD\u5FC5\u987B\u7ACB\u523B\u6267\u884C\u63D2\u5165\u3002
nc27-4-1 = Hibernate\u8F7B\u5FAE\u7684\u505A\u4E86\u4E9B\u6539\u53D8\uFF1A\u53EA\u6709\u5F53\u53EF\u884C\u65F6\u5EF6\u8FDF\u63D2\u5165\u3002
p27-4-2 = \u5E95\u5C42\u7684\u95EE\u9898\u5728\u4E8E\u771F\u5B9E\u7684\u5E94\u7528\u7A0B\u5E8F\u8BED\u4E49\u6216\u6839\u636E\u60C5\u51B5\u800C\u6539\u53D8\u3002
p27-4-3 = \u4ECE3.2.3\u7248\u672C\u5F00\u59CB\uFF0CHibernate\u5F15\u5165\u4E86\u591A\u79CD\u4E0D\u540C\u7684id\u751F\u6210\u7B56\u7565\u3002
nc27-4-2 = \u4E0B\u9762\u6307\u5B9A\u4E862\u4E2D\u751F\u6210\u65B9\u5F0F\u7ED1\u5B9A\uFF1A
li27-4-1-1 = org.hibernate.id.enhanced.SequenceStyleGenerator
li27-4-1-2 = org.hibernate.id.enhanced.TableGenerator
p27-4-4 =\u751F\u6210\u5668\u7684\u610F\u4E49\u5728\u4E8E\u6839\u636E\u5B9E\u9645\u7684\u8BED\u4E49\u4E3A\u4E0D\u540C\u7684\u6570\u636E\u5E93\u751F\u6210id\u3002\u6BD4\u5982\uFF0C<code>org.hibernate.id.enhanced.SequenceStyleGenerator</code>\u9002\u5408\u4E8E\u4E0D\u652F\u6301\u8868\u7684\u5E8F\u5217\u5316\u7684\u6570\u636E\u5E93\u3002

#		**********************************************************************************************************
#		27.5. Database functions
#		**********************************************************************************************************

title27-5 = 27.5. \u6570\u636E\u5E93\u51FD\u6570
wc27-5-1 = \u8FD9\u662FHibernate\u9700\u8981\u63D0\u9AD8\u7684\u5730\u65B9\u3002\u5904\u4E8E\u53EF\u79FB\u690D\u6027\u8003\u8651\uFF0C\u5728\u65B9\u6CD5\u5904\u7406\u65B9\u4FBF\uFF0CHQL\u505A\u7684\u5F88\u597D\uFF1B\u4F46\u662F\u5374\u5728\u5176\u4ED6\u65B9\u9762\u505A\u7684\u5341\u5206\u6B20\u7F3A\u3002
p27-5-1 = \u7528\u6237\u53EF\u4EE5\u6709\u5F88\u591A\u65B9\u5F0F\u5F15\u7528SQL\u7684\u65B9\u6CD5SQL\u3002\u7136\u800C\uFF0C\u4E0D\u662F\u6240\u6709\u7684\u6570\u636E\u5E93\u90FD\u652F\u6301\u540C\u6837\u7684\u65B9\u6CD5\u3002Hibernate\u63D0\u4F9B\u4E86\u8BB8\u591A\u6620\u5C04\uFF0C\u6765\u5C06\u903B\u8F91\u65B9\u6CD5\u6620\u5C04\u5230\u5177\u4F53\u7684\u65B9\u6CD5\uFF0C\u6709\u53EF\u80FD\u662F\u5B8C\u5168\u4E0D\u540C\u7684\u7269\u7406\u65B9\u6CD5\u3002
ic27-5-1 = \u6280\u672F\u4E0A\u8BB2\uFF0C\u8FD9\u4E2A\u901A\u8FC7<code>org.hibernate.dialect.function.SQLFunctionRegistry</code>\u6CE8\u518C\u7684\u65B9\u6CD5\u610F\u56FE\u5728\u4E8E\u5141\u8BB8\u7528\u6237\u5728\u63D0\u4F9B\u81EA\u5B9A\u4E49\u7684\u65B9\u6CD5\u800C\u4E0D\u9700\u8981\u6307\u5B9A\u65B9\u8A00\u3002\u8FD9\u4E00\u884C\u4E3A\u8FD8\u6CA1\u6709\u5B8C\u5168\u5B8C\u6210\u3002<br/>\u8FD9\u79CD\u7C7B\u578B\u7684\u5B9E\u73B0\u4F7F\u5F97\u7528\u6237\u53EF\u4EE5\u4F7F\u7528<code>org.hibernate.cfg.Configuration</code>\u52A8\u6001\u7684\u6CE8\u518C\u65B9\u6CD5\uFF0C\u5E76\u4E14\u8FD9\u4E9B\u65B9\u6CD5\u4E5F\u4F1A\u6CE8\u518C\u5230HQl\u4E0A\u3002

#		**********************************************************************************************************
#		27.6. Type mappings
#		**********************************************************************************************************

title27-6 = 27.6. \u7C7B\u578B\u6620\u5C04
p27-6-1 = \u8FD9\u4E00\u7AE0\u8282\u5185\u5BB9\u5C06\u4F1A\u665A\u4E9B\u5B8C\u6210\u5E76\u53D1\u5E03\u3002\u3002\u3002




