
#		**********************************************************************************************************
#		Chapter 5. Basic O/R Mapping
#		**********************************************************************************************************

title5 = \u7B2C\u4E94\u7AE0. \u5BF9\u8C61/\u5173\u7CFB\u6570\u636E\u5E93\u6620\u5C04\u57FA\u7840

#		**********************************************************************************************************
#		5.1. Mapping declaration
#		**********************************************************************************************************

title5-1 = 5.1. \u6620\u5C04\u5B9A\u4E49
p5-1-1 = \u5BF9\u8C61/\u5173\u7CFB\u6620\u5C04\u53EF\u4EE5\u4F7F\u7528\u4EE5\u4E0B\u4E09\u4E2A\u65B9\u6CD5\u5B9A\u4E49:
li5-1-1 = \u4F7F\u7528java 5 \u6CE8\u89E3\uFF08\u4F7F\u7528Java Persistence 2 \u6CE8\u91CA\uFF09
li5-1-2 = \u4F7F\u7528JPA2 XML \u90E8\u7F72\u63CF\u8FF0\u7B26 (\u5728XXX\u7AE0\u63CF\u8FF0)
li5-1-3 = \u4F7F\u7528hibernate\u914D\u7F6E\u6587\u4EF6<code>hbm.xml</code>\u3002
p5-1-2 = Annotations\u88AB\u5206\u4E3A\u4E24\u7C7B, \u903B\u8F91\u6620\u5C04\u6CE8\u89E3(\u63CF\u8FF0\u5BF9\u8C61\u6A21\u578B\uFF0C\u4E24\u4E2A\u5B9E\u4F53\u95F4\u7684\u5173\u7CFB\u7B49\u3002) \u548C\u7269\u7406\u6620\u5C04\u6CE8\u89E3\uFF08\u63CF\u8FF0\u7269\u7406\u6A21\u5F0F\uFF0C\u8868\uFF0C\u5217\uFF0C\u7D22\u5F15\u7B49\uFF09\u3002 \u5728\u4E0B\u9762\u7684\u4EE3\u7801\u6CE8\u91CA\u4E2D\u6211\u4EEC\u6DF7\u5408\u4F7F\u7528\u4E24\u4E2D\u6CE8\u91CA\u65B9\u6CD5\u3002
p5-1-3 = JPA\u6CE8\u89E3\u5728 <code>javax.persistence.*</code>\u5305\u4E2D\u3002 Hibernate\u7684\u4E00\u4E9B\u7279\u6B8A\u7684\u6269\u5C55\u5728\u5305 <code>org.hibernate.annotations.*</code>\u4E2D\u3002\u4F60\u949F\u7231\u7684IDE\u53EF\u4EE5\u5E2E\u52A9\u4F60\u81EA\u52A8\u5B8C\u6210\u6CE8\u89E3\u548C\u5176\u5C5E\u6027 (\u5373\u4F7F\u6CA1\u6709\u6307\u5B9AJPA\u63D2\u4EF6\uFF0C\u56E0\u4E3AJPA\u6CE8\u89E3\u672C\u8D28\u4E0A\u5C31\u662Fjava 5 \u6CE8\u89E3 \u3002)\u3002
p5-1-4 = \u4E0B\u9762\u662F\u4E00\u4E2A\u6620\u5C04\u7684\u4F8B\u5B50
p5-1-5 = hbm.xml\u8FD9\u79CD\u89E3\u51B3\u65B9\u6CD5\u4F7F\u7528\u4E00\u4E2A\u53EF\u8BFB\u53EF\u5199\u7684xml\u6587\u4EF6\u3002 \u6620\u5C04\u8BED\u8A00\u662FJava-centric, \u8FD9\u610F\u5473\u7740\u6620\u5C04\u662F\u56F4\u7ED5\u8005\u6301\u4E45\u5316\u7C7B\u6765\u58F0\u660E\u800C\u4E0D\u662F\u6570\u636E\u8868\u3002
p5-1-6 = \u8BF7\u6CE8\u610F\uFF0C \u5C3D\u7BA1\u8BB8\u591AHibernate\u7528\u6237\u9009\u62E9\u624B\u52A8\u7F16\u8F91xml\uFF0C\u4E5F\u6709\u4E00\u4E9B\u5DE5\u5177\u6765\u751F\u6210\u6620\u5C04\u6587\u4EF6\u3002\u50CFXDoclet, Middlegen \u548C AndroMDA\u3002
p5-1-7 = \u4E0B\u9762\u662F\u6620\u5C04\u6587\u4EF6\u4F8B\u5B50:
p5-1-8 = \u6211\u4EEC\u73B0\u5728\u5F00\u59CB\u8BA8\u8BBA\u6620\u5C04\u6587\u6863\u7684\u5185\u5BB9(\u6CE8\u89E3\u548CXML)\u3002\u6211\u4EEC\u53EA\u63CF\u8FF0Hibernate\u5728\u8FD0\u884C\u65F6\u4F7F\u7528\u7684\u5143\u7D20\u548C\u5C5E\u6027\u3002\u6620\u5C04\u6587\u6863\u8FD8\u5305\u62EC\u4E00\u4E9B\u989D\u5916\u7684\u53EF\u9009\u5C5E\u6027\u548C\u5143\u7D20\uFF0C\u5B83\u4EEC\u5728\u4F7F\u7528schema\u5BFC\u51FA\u5DE5\u5177\u7684\u65F6\u5019\u4F1A\u5F71\u54CD\u5BFC\u51FA\u7684\u6570\u636E\u5E93schema\u7ED3\u679C\u3002\uFF08\u5982\uFF1Anot-null\u5C5E\u6027\uFF09\u3002

#		**********************************************************************************************************
#		5.1.1. Entity
#		**********************************************************************************************************

title5-1-1 = 5.1.1. \u5B9E\u4F53
p5-1-1-1 = \u4E00\u4E2A\u5B9E\u4F53\u662F\u4E00\u4E2A\u53EF\u4EE5\u88ABHibernate\u6301\u4E45\u5316\u7684\u666E\u901A\u7684Java\u5BF9\u8C61\uFF08\u4E5F\u79F0\u4F5CPOJO\uFF09\u3002
p5-1-1-2 = \u4F7F\u7528 @Entity\u6CE8\u89E3\u53EF\u4EE5\u4F7F\u4E00\u4E2A\u5BF9\u8C61\u53D8\u6210\u4E00\u4E2A\u5B9E\u4F53\u3002
p5-1-1-3 = \u4EC5\u6B64\u800C\u5DF2\uFF0C\u5176\u4ED6\u7684\u90FD\u662F\u53EF\u9009\u7684\u3002\u6709\u8BB8\u591A\u7684\u53EF\u9009\u9879\u6765\u8C03\u6574\u4F60\u7684\u6620\u5C04\uFF0C \u6211\u4EEC\u4E00\u4E00\u89E3\u91CA\u3002
p5-1-1-4 = <code>@Table</code> \u53EF\u4EE5\u5B9A\u4E49\u8FD9\u4E2A\u5B9E\u4F53\u6301\u4E45\u5316\u5BF9\u5E94\u7684\u6570\u636E\u8868\u3002\u5982\u679C\u6CA1\u6709\u5B9A\u4E49\uFF0C\u8868\u540D\u5C31\u662F\u8BE5\u5B9E\u4F53\u7684\u975E\u9650\u5B9A\u7C7B\u540D\uFF0C\u4F60\u4E5F\u53EF\u4EE5\u9009\u62E9\u5B9A\u4E49catalog, schema \u540C\u6837\u4E5F\u53EF\u4EE5\u5B9A\u4E49\u552F\u4E00\u7EA6\u675F\u3002
p5-1-1-5 = \u7EA6\u675F\u7684\u540D\u79F0\u662F\u53EF\u9009\u7684 (\u5982\u679C\u672A\u5B9A\u4E49\u5219\u81EA\u52A8\u751F\u6210)\u3002\u7EA6\u675F\u540D\u7531\u6309\u7167\u547D\u540D\u89C4\u5219\u5B9A\u4E49\u7684\u5217\u540D\u7EC4\u6210\u3002
tc5-1-1-1 = \u786E\u4FDD\u5728 @UniqueConstraint \u7684columnNames\u5C5E\u6027\u4E2D\u4F7F\u7528\u6570\u636E\u5E93\u7EA7\u522B\u7684\u540D\u79F0\u3002\u4F8B\u5982, \u5BF9\u4E8E\u7B80\u5355\u7C7B\u578B\uFF0C \u6570\u636E\u5E93\u7EA7\u522B\u7684\u5217\u540D\u4E5F\u8BB8\u548C\u5B9E\u4F53\u7EA7\u522B\u7684\u5217\u540D\u76F8\u540C\uFF0C\u4E8E\u5173\u7CFB\u5C5E\u6027\u6765\u8BB2\u4E0D\u662F\u8FD9\u6837\u7684\u3002
p5-1-1-6 = <code>@Entity.name</code> \u5B9A\u4E49\u4E00\u4E2A\u7B80\u5199\u540D\u79F0\u8BA9\u4F60\u53EF\u4EE5\u5728JP-QL\u548CHQL\u67E5\u8BE2\u7684\u65F6\u5019\u4F7F\u7528\u3002 \u9ED8\u8BA4\u662F\u8BE5\u7C7B\u7684\u975E\u9650\u5B9A\u540D\u3002
p5-1-1-7 = Hibernate\u8D85\u51FA\u4E86JPA\u89C4\u8303\u63D0\u4F9B\u4E86\u989D\u5916\u7684\u914D\u7F6E\u3002\u6709\u4E00\u4E9B\u6258\u7BA1\u5728<code>@org.hibernate.annotations.Entity</code>:
li5-1-1-1 = dynamicInsert / dynamicUpdate (\u9ED8\u8BA4\u662Ffalse): \u6307\u5B9AInsert/Update sql \u5E94\u8BE5\u5728\u8FD0\u884C\u65F6\u751F\u6210\u5E76\u4E14\u53EA\u5305\u542B\u90A3\u4E9B\u975E\u7A7A\u7684\u5217\u3002dynamic-insert \u548Cdynamic-update\u8BBE\u7F6E\u4E0D\u88AB\u5B50\u7C7B\u7EE7\u627F\u3002 \u5C3D\u7BA1\u8FD9\u79CD\u914D\u7F6E\u5728\u67D0\u4E9B\u60C5\u51B5\u4E0B\u53EF\u4EE5\u63D0\u9AD8\u6548\u7387\uFF0C\u4F46\u662F\u5B9E\u9645\u4E0A\u5728\u522B\u7684\u60C5\u51B5\u4E0B\u4E5F\u4F1A\u964D\u4F4E\u6027\u80FD\u3002
li5-1-1-2 = selectBeforeUpdate (\u9ED8\u8BA4false): \u6307\u5B9AHibernate\u4E0D\u5E94\u8BE5\u6267\u884CSQL update\u9664\u975E\u4ED6\u5305\u542B\u7684\u5BF9\u8C61\u771F\u7684\u6709\u66F4\u65B0\u3002 \u53EA\u6709\u5728\u4E00\u4E2A\u77AC\u6001\u7684\u5BF9\u8C61\u4E0E\u4E00\u4E2A\u65B0\u7684Session\u5173\u8054\u662F\u4F7F\u7528update(), Hibernate\u4F1A\u5148\u989D\u5916\u6267\u884C\u4E00\u4E2Aselect\u8BED\u53E5\u6765\u786E\u5B9Aupdate\u662F\u5426\u8981\u6267\u884C\u3002\u4F7F\u7528select-before-update\u901A\u5E38\u4F1A\u964D\u4F4E\u6548\u7387\u3002 \u5F53\u4F60\u60F3\u628A\u6E38\u79BB\u7684\u5B9E\u4F8B\u91CD\u65B0\u7ED1\u5B9A\u5230\u4E00\u4E2A\u4F1A\u8BDD\u4E2D\uFF0C \u4ED6\u53EF\u4EE5\u963B\u6B62\u6570\u636E\u5E93\u4E2D\u7684update \u89E6\u53D1\u5668\u4E0D\u5FC5\u8981\u7684\u6267\u884C\u3002
li5-1-1-3 = polymorphisms (\u9ED8\u8BA4IMPLICIT): \u51B3\u5B9A\u4F7F\u7528\u9690\u5F0F\u7684\u8FD8\u662F\u663E\u793A\u7684\u591A\u6001\u67E5\u8BE2\u3002 \u9690\u5F0F\u591A\u6001\u662F\u6307\u5982\u679C\u67E5\u8BE2\u65F6\u7ED9\u51FA\u7684\u662F\u4EFB\u4F55\u7236\u7C7B\u3001\u8BE5\u7C7B\u5B9E\u73B0\u7684\u63A5\u53E3\u6216\u8005\u8BE5\u7C7B\u7684\u540D\u5B57\u65F6\uFF0C\u90FD\u4F1A\u8FD4\u56DE\u8FD9\u4E2A\u7C7B\u7684\u5B9E\u4F8B\uFF0C\u5982\u679C\u67E5\u8BE2\u4E2D\u7ED9\u51FA\u7684\u662F\u5B50\u7C7B\u7684\u540D\u5B57\uFF0C\u5219\u8FD4\u56DE\u5B50\u7C7B\u7684\u5B9E\u4F8B\u3002\u663E\u793A\u591A\u6001\u610F\u601D\u662F\u53EA\u6709\u660E\u786E\u7684\u6307\u5B9A\u8BE5\u7C7B\u7684\u7C7B\u540D\u65F6\u624D\u8FD4\u56DE\u8BE5\u7C7B\u7684\u5B9E\u4F8B\u3002\u67E5\u8BE2\u8FD9\u4E2A\u540D\u5B57\u53EA\u4F1A\u8FD4\u56DE\u6620\u5C04\u7684\u5B50\u7C7B\u7684\u5B9E\u4F8B\u3002\u5728\u5927\u591A\u6570\u60C5\u51B5\u4E0B,  \u9ED8\u8BA4\u7684polymorphisms=IMPLICIT\u662F\u6070\u5F53\u7684\u3002\u663E\u793A\u7684\u591A\u6001\u5728\u5F53\u6709\u4E24\u4E2A\u4E0D\u540C\u7684\u7C7B\u6620\u5C04\u540C\u4E00\u5F20\u8868\u65F6\u5F88\u6709\u7528\uFF0C\u8FD9\u6837\u53EF\u4EE5\u5141\u8BB8\u4E00\u4E2A\u8F7B\u91CF\u7EA7\u7684\u7C7B\u53EA\u5305\u542B\u90E8\u5206\u7684\u5217\u3002
li5-1-1-4 = persister: \u6307\u5B9A\u4E00\u4E2A\u81EA\u5B9A\u4E49\u7684ClassPersister\u3002\u8FD9\u4E2A\u5C5E\u6027\u8BA9\u4F60\u81EA\u5B9A\u4E49\u7C7B\u7684\u6301\u4E45\u5316\u7B56\u7565\u3002\u4F8B\u5982\uFF0C\u4F60\u53EF\u4EE5\u6307\u5B9A\u81EA\u5DF1\u7684\u7C7B\u7EE7\u627Forg.hibernate.persister.EntityPersister\uFF0C \u4F60\u4E5F\u53EF\u4EE5\u7F16\u5199org.hibernate.persister.ClassPersister\u63A5\u53E3\u7684\u5168\u65B0\u5B9E\u73B0\uFF0C\u6BD4\u5982\u4F7F\u7528\u5B58\u50A8\u8FC7\u7A0B\u8C03\u7528\u3001\u5E8F\u5217\u5316\u5230\u4E00\u4E2A\u6587\u4EF6\u6216\u8005LDAP\u3002 \u53C2\u7167org.hibernate.test.CustomerPersister \u793A\u4F8B\uFF0C \u6301\u4E45\u5316\u5230\u4E00\u4E2AHashtable\u7684\u7B80\u5355\u4F8B\u5B50\u3002
li5-1-1-51 = optimisticLock (\u9ED8\u8BA4\u662F VERSION):\u6307\u5B9A\u4E50\u89C2\u9501\u7B56\u7565\u3002\u5982\u679C\u4F60\u542F\u7528dynamicUpdate, \u4F60\u53EF\u4EE5\u9009\u62E9\u4E50\u89C2\u9501\u7B56\u7565\uFF1A
li5-1-1-5-1 = version: \u68C0\u67E5version/timestamp\u5217
li5-1-1-5-2 = all: \u68C0\u67E5\u6240\u6709\u7684\u5217
li5-1-1-5-3 = dirty: \u68C0\u67E5\u4FEE\u6539\u7684\u5217\uFF0C\u5141\u8BB8\u4E00\u4E9B\u5E76\u53D1\u4FEE\u6539
li5-1-1-5-4 = none: \u4E0D\u9002\u7528\u4E50\u89C2\u9501
li5-1-1-52 = \u5F3A\u70C8\u63A8\u8350\u5728Hibernate\u4E2D\u4F7F\u7528version/timestamp\u6765\u8FDB\u884C\u4E50\u89C2\u9501\u5B9A\u3002 \u8FD9\u79CD\u7B56\u7565\u4F18\u5316\u4E86\u6027\u80FD\u5E76\u4E14\u80FD\u591F\u6B63\u786E\u7684\u5904\u7406\u5BF9\u6E38\u79BB\u5B9E\u4F8B\u7684\u4FEE\u6539\uFF08\u4F8B\u5982\u4F7F\u7528Session.merge()\u7684\u65F6\u5019\uFF09\u3002
tc5-1-1-2 = \u786E\u4FDD\u5F15\u5165\u7684\u662F<code>@javax.persistence.Entity</code> \u628A\u4E00\u4E2A\u7C7B\u53D8\u6210\u5B9E\u4F53\u3002\u901A\u5E38\u7684\u9519\u8BEF\u662F\u5F15\u5165<code>@org.hibernate.annotations.Entity</code>\u3002
p5-1-1-8 = \u6709\u4E00\u4E9B\u5B9E\u4F53\u662F\u4E0D\u53EF\u53D8\u7684\u3002 \u4ED6\u4EEC\u4E0D\u80FD\u591F\u88AB\u5E94\u7528\u4FEE\u6539\u3002\u8FD9\u5141\u8BB8Hibernate\u4F7F\u7528 <code>@Immutable</code>\u6CE8\u89E3\u3002\u505A\u4E00\u4E9B\u8F7B\u5FAE\u7684\u6027\u80FD\u4F18\u5316\u3002
p5-1-1-9 = \u4F60\u4E5F\u53EF\u4EE5\u4FEE\u6539Hibernate\u5BF9\u7C7B\u7684\u5EF6\u8FDF\u52A0\u8F7D\u7684\u5904\u7406\u65B9\u6CD5\u3002\u5728<code>@Proxy</code>\u4E2D\u4F7F\u7528<code>lazy=false</code> \u6765\u7981\u6B62\u61D2\u52A0\u8F7D\uFF08\u4E0D\u63A8\u8350\uFF09\u3002 \u4F60\u4E5F\u53EF\u4EE5\u6307\u5B9A\u4E00\u4E2A\u63A5\u53E3\u7528\u4E8E\u5EF6\u8FDF\u52A0\u8F7D\u4EE3\u7406\uFF08\u9ED8\u8BA4\u662F\u7C7B\u81EA\u5DF1\uFF09: \u5728 <code>@Proxy</code>\u4E2D\u4F7F\u7528<code>proxyClass</code>\u3002 Hibernate\u5C06\u4F1A\u9996\u5148\u8FD4\u56DE\u5B9E\u73B0\u4E86\u8BE5\u6307\u5B9A\u63A5\u53E3\u7684\u4EE3\u7406\uFF08\u4F7F\u7528\u901A\u8FC7hibernate.bytecode.provide\u5B9A\u4E49\u7684\u5B57\u8282\u7801\u63D0\u4F9B\u8005\uFF09\u3002\u5F53\u4EE3\u7406\u4E2D\u7684\u4E00\u4E2A\u65B9\u6CD5\u88AB\u8C03\u7528\u65F6\u6301\u4E45\u5316\u5BF9\u8C61\u5C06\u4F1A\u88AB\u52A0\u8F7D\u3002\u53C2\u7167\u4E0B\u9762\u7684\u201C\u521D\u59CB\u5316\u96C6\u5408\u548C\u4EE3\u7406\u201D\u3002
p5-1-1-10 = <code>@BatchSize</code> \u6307\u5B9A\u901A\u8FC7\u6807\u793A\u7B26\u4E00\u6B21\u6027\u6293\u53D6\u7C7B\u5B9E\u4F8B\u7684\u6570\u91CF\uFF08\u9ED8\u8BA4\u662F1\uFF09.
p5-1-1-11 = \u5728\u83B7\u53D6\u5BF9\u8C61\u7684\u65F6\u5019\u4F7F\u7528 @Where \u53EF\u4EE5\u6307\u5B9A\u4F7F\u7528\u4EFB\u610F\u7684SQL Where \u6761\u4EF6\u3002
p5-1-1-12 = \u540C\u6837\u7684\uFF0C <code>@Check</code> @Check\u53EF\u4EE5\u8BA9\u4F60\u5B9A\u4E49\u4E00\u4E2ASQL\u8868\u8FBE\u5F0F\u7528\u4E8E\u7ED9\u81EA\u52A8\u6A21\u5F0F\u751F\u6210\u6DFB\u52A0\u591A\u884C\u68C0\u67E5\u7EA6\u675F\u3002
p5-1-1-13 = \u5BF9\u4E8EHibernate\u6620\u5C04\u6765\u8BB2\u89C6\u56FE\u548C\u57FA\u672C\u8868\u4E4B\u95F4\u662F\u6CA1\u6709\u533A\u522B\u7684\u3002 \u8FD9\u5728\u6570\u636E\u5E93\u7EA7\u522B\u4E0A\u662F\u900F\u660E\u7684\uFF0C\u5C3D\u7BA1\u4E00\u4E9B\u6570\u636E\u5E93\u7BA1\u7406\u8F6F\u4EF6\u4E0D\u652F\u6301\u89C6\u56FE\uFF0C\u5C24\u5176\u662F\u5728\u66F4\u65B0\u7684\u65F6\u5019\u3002 \u6709\u4E9B\u65F6\u5019\u4F60\u60F3\u4F7F\u7528\u89C6\u56FE\uFF0C\u4F46\u662F\u4F60\u5728\u6570\u636E\u5E93\u4E2D\u4E0D\u80FD\u521B\u5EFA\u5B83\uFF08\u4F8B\u5982\uFF0C\u5728\u9057\u7559\u6A21\u5F0F\uFF09\u3002\u8FD9\u79CD\u60C5\u51B5\u4E0B\uFF0C\u4F60\u53EF\u4EE5\u4F7F\u7528 <code>@org.hibernate.annotations.Subselect</code> \u6620\u5C04\u4E00\u4E2A\u4E0D\u53D8\u7684\u5E76\u4E14\u53EA\u8BFB\u7684\u5B9E\u4F53\u5230\u4E00\u4E2ASQL\u5B50\u67E5\u8BE2\u8868\u8FBE\u5F0F:
p5-1-1-14 = \u58F0\u660E\u8868\u6765\u540C\u6B65\u8FD9\u4E2A\u5B9E\u4F53\uFF0C\u786E\u4FDD\u81EA\u52A8\u5237\u65B0\u53EF\u4EE5\u6B63\u786E\u6267\u884C\uFF0C\u5E76\u4E14\u4F9D\u8D56\u4E8E\u6D3E\u751F\u5B9E\u4F53\u7684\u67E5\u8BE2\u4E0D\u4F1A\u8FD4\u56DE\u8FC7\u671F\u6570\u636E\u3002<code>&lt;subselect&gt;</code>\u53EF\u4EE5\u4F5C\u4E3A\u4E00\u4E2A\u5C5E\u6027\u6216\u8005\u662F\u5D4C\u5957\u7684\u6620\u5C04\u5143\u7D20\u3002
p5-1-1-15 = \u4E0B\u9762\u6211\u4EEC\u4F7F\u7528<code>hbm.xml</code>\u6765\u5B9E\u73B0\u76F8\u540C\u7684\u64CD\u4F5C\u3002 \u4F60\u53EF\u4EE5\u7528class\u5143\u7D20\u58F0\u660E\u4E00\u4E2A\u6301\u4E45\u5316\u7C7B\u3002\u4F8B\u5982\uFF1A
td5-1-1-1 = <code>name</code> (\u53EF\u9009): \u6301\u4E45\u5316\u7C7B\uFF08\u6216\u8005\u63A5\u53E3\uFF09\u7684Java\u5168\u9650\u5B9A\u540D\u3002\u5982\u679C\u8FD9\u4E2A\u5C5E\u6027\u4E0D\u5B58\u5728\uFF0CHibernate\u5C06\u5047\u5B9A\u8FD9\u662F\u4E00\u4E2A\u975EPOJO\u7684\u5B9E\u4F53\u6620\u5C04\u3002
td5-1-1-2 = <code>table</code> (\u53EF\u9009 - \u9ED8\u8BA4\u662F\u7C7B\u7684\u975E\u5168\u9650\u5B9A\u540D): \u5BF9\u5E94\u7684\u6570\u636E\u5E93\u8868\u540D\u3002
td5-1-1-3 = <code>discriminator-value</code> (\u53EF\u9009 - \u9ED8\u8BA4\u662F\u7C7B\u540D): \u7528\u4E8E\u5728\u591A\u6001\u65F6\u533A\u5206\u6BCF\u4E2A\u72EC\u7ACB\u7684\u5B50\u7C7B\u3002\u53EF\u63A5\u53D7\u7684\u503C\u5305\u62ECnull\u6216\u8005not null\u3002
td5-1-1-4 = <code>mutable</code> (\u53EF\u9009 - \u9ED8\u8BA4\u662Ftrue): \u6307\u660E\u8FD9\u4E2A\u7C7B\u7684\u5B9E\u4F8B\u662F\u5426\u53EF\u4FEE\u6539\u3002
td5-1-1-5 = <code>schema</code> (\u53EF\u9009): \u8986\u76D6\u5728\u6839<hibernate-mapping>\u5143\u7D20\u4E2D\u6307\u5B9A\u7684schema\u540D\u5B57\u3002
td5-1-1-6 = <code>catalog</code> (\u53EF\u9009): \u8986\u76D6\u5728\u6839<hibernate-mapping>\u5143\u7D20\u4E2D\u6307\u5B9A\u7684catalog\u540D\u5B57\u3002
td5-1-1-7 = <code>proxy</code> (\u53EF\u9009): \u6307\u5B9A\u4E00\u4E2A\u63A5\u53E3\uFF0C\u5728\u5EF6\u8FDF\u88C5\u8F7D\u65F6\u4F5C\u4E3A\u4EE3\u7406\u4F7F\u7528\u3002\u53EF\u4EE5\u6307\u5B9A\u7C7B\u672C\u8EAB\u3002
td5-1-1-8 = <code>dynamic-update</code> (\u53EF\u9009 - \u9ED8\u8BA4\u4E3A false): \u6307\u5B9A\u7528\u4E8EUPDATE \u7684SQL\u5C06\u4F1A\u5728\u8FD0\u884C\u65F6\u52A8\u6001\u751F\u6210\uFF0C\u5E76\u4E14\u53EA\u66F4\u65B0\u90A3\u4E9B\u6539\u53D8\u8FC7\u7684\u5B57\u6BB5\u3002
td5-1-1-9 = <code>dynamic-insert</code> (\u53EF\u9009 - \u9ED8\u8BA4\u4E3A false): \u6307\u5B9A\u7528\u4E8EINSERT\u7684 SQL \u5C06\u4F1A\u5728\u8FD0\u884C\u65F6\u52A8\u6001\u751F\u6210\uFF0C\u5E76\u4E14\u53EA\u5305\u542B\u90A3\u4E9B\u975E\u7A7A\u503C\u5B57\u6BB5\u3002
td5-1-1-10 = <code>select-before-update</code> (\u53EF\u9009 - \u9ED8\u8BA4\u4E3A false): \u6307\u660E\u53EA\u6709\u5728\u786E\u5B9A\u5BF9\u8C61\u88AB\u4FEE\u6539\u7684\u65F6\u5019Hibernate\u624D\u4F1A\u6267\u884Cupdate\u8BED\u53E5\u3002\u53EA\u6709\u5F53\u4E00\u4E2A\u77AC\u6001\u7684\u5BF9\u8C61\u88AB\u5173\u8054\u5230\u4E00\u4E2A\u65B0\u7684Session\u4F7F\u7528update()\u65F6\uFF0CHibernate\u4F1A\u5728\u9996\u5148\u6267\u884C\u4E00\u4E2A\u989D\u5916\u7684select\u8BED\u53E5\u6765\u786E\u5B9Aupdate\u662F\u5426\u9700\u8981\u6267\u884C\u3002
td5-1-1-11 = <code>polymorphisms</code> (\u53EF\u9009 - \u9ED8\u8BA4\u4E3A implicit): \u754C\u5B9A\u662F\u9690\u5F0F\u8FD8\u662F\u663E\u5F0F\u7684\u4F7F\u7528\u591A\u6001\u67E5\u8BE2\u3002
td5-1-1-12 = <code>where</code> (\u53EF\u9009): \u6307\u5B9A\u4E00\u4E2A\u9644\u52A0\u7684SQLWHERE \u6761\u4EF6\uFF0C \u5728\u6293\u53D6\u8FD9\u4E2A\u7C7B\u7684\u5BF9\u8C61\u65F6\u4F1A\u4E00\u76F4\u589E\u52A0\u8FD9\u4E2A\u6761\u4EF6\u3002
td5-1-1-13 = <code>persister</code> (\u53EF\u9009): \u6307\u5B9A\u4E00\u4E2A\u5B9A\u5236\u7684ClassPersister\u3002
td5-1-1-14 = <code>batch-size</code> (\u53EF\u9009 - \u9ED8\u8BA4\u662F1): \u6307\u5B9A\u4E00\u4E2A\u7528\u4E8E \u6839\u636E\u6807\u8BC6\u7B26\uFF08identifier\uFF09\u6293\u53D6\u5B9E\u4F8B\u65F6\u4F7F\u7528\u7684"batch size"\uFF08\u6279\u6B21\u6293\u53D6\u6570\u91CF\uFF09\u3002
td5-1-1-15 = <code>optimistic-lock</code> (\u53EF\u9009 - \u9ED8\u8BA4\u662F version): \u51B3\u5B9A\u4E50\u89C2\u9501\u5B9A\u7684\u7B56\u7565\u3002
td5-1-1-16 = <code>lazy</code> (\u53EF\u9009): lazy=\u201Cfalse\u201D\u6765\u7981\u7528\u5EF6\u8FDF\u52A0\u8F7D\u3002
td5-1-1-17 = <code>entity-name</code> (\u53EF\u9009 - \u9ED8\u8BA4\u662F\u7C7B\u540D): Hibernate\u5141\u8BB8\u4E00\u4E2A\u7C7B\u88AB\u6620\u5C04\u591A\u6B21\uFF0C\u524D\u63D0\u662F\u4E0D\u540C\u7684\u8868\u3002\u5E76\u4E14\u5141\u8BB8\u4F7F\u7528Maps\u6216XML\u4EE3\u66FFJava\u5C42\u6B21\u7684\u5B9E\u4F53\u6620\u5C04 \uFF08\u4E5F\u5C31\u662F\u5B9E\u73B0\u52A8\u6001\u9886\u57DF\u6A21\u578B\uFF0C\u4E0D\u7528\u5199\u6301\u4E45\u5316\u7C7B\uFF0D\u8BD1\u6CE8\uFF09\u3002 \u5728\u8FD9\u79CD\u60C5\u51B5\u4E0B\uFF0C\u4F60\u5E94\u8BE5\u63D0\u4F9B\u4E00\u4E2A\u4EFB\u610F\u7684\u786E\u5207\u7684\u540D\u5B57\u3002\u53C2\u8003<a href="#c4-4">Section 4.4 \u52A8\u6001\u6A21\u578B</a> \u548C <a href="#c5-1-1">5.1.1 \u5B9E\u4F53</a> \u3002
td5-1-1-18 = <code>check</code> (\u53EF\u9009): \u8FD9\u662F\u4E00\u4E2ASQL\u8868\u8FBE\u5F0F\uFF0C \u7528\u4E8E\u4E3A\u81EA\u52A8\u751F\u6210\u7684schema\u6DFB\u52A0\u591A\u884C\uFF08multi-row\uFF09\u7EA6\u675F\u68C0\u67E5\u3002
td5-1-1-19 = <code>rowid</code> (\u53EF\u9009):Hibernate\u53EF\u4EE5\u4F7F\u7528\u6570\u636E\u5E93\u652F\u6301\u7684\u6240\u8C13\u7684ROWIDs\uFF0C\u4F8B\u5982\uFF1A Oracle\u6570\u636E\u5E93\uFF0C\u5982\u679C\u4F60\u8BBE\u7F6E\u8FD9\u4E2A\u53EF\u9009\u7684rowid\uFF0CHibernate\u53EF\u4EE5\u4F7F\u7528\u989D\u5916\u7684\u5B57\u6BB5rowid\u5B9E\u73B0\u5FEB\u901F\u66F4\u65B0\u3002ROWID\u662F\u8FD9\u4E2A\u529F\u80FD\u5B9E\u73B0\u7684\u91CD\u70B9\uFF0C \u5B83\u4EE3\u8868\u4E86\u4E00\u4E2A\u5B58\u50A8\u5143\u7EC4\uFF08tuple\uFF09\u7684\u7269\u7406\u4F4D\u7F6E\u3002
td5-1-1-20 = <code>subselect</code> (\u53EF\u9009): \u5B83\u5C06\u4E00\u4E2A\u4E0D\u53EF\u53D8\uFF08immutable\uFF09\u5E76\u4E14\u53EA\u8BFB\u7684\u5B9E\u4F53\u6620\u5C04\u5230\u4E00\u4E2A\u6570\u636E\u5E93\u7684\u5B50\u67E5\u8BE2\u4E2D\u3002\u5F53\u4F60\u60F3\u7528\u89C6\u56FE\u4EE3\u66FF\u4E00\u5F20\u57FA\u672C\u8868\u7684\u65F6\u5019\uFF0C\u8FD9\u662F\u6709\u7528\u7684\uFF0C\u4F46\u6700\u597D\u4E0D\u8981\u8FD9\u6837\u505A\u3002\u66F4\u591A\u7684\u4ECB\u7ECD\u8BF7\u770B\u4E0B\u9762\u5185\u5BB9\u3002
td5-1-1-21 = <code>abstract</code> (\u53EF\u9009): \u7528\u4E8E\u5728&lt;union-subclass&gt; \u7684\u7EE7\u627F\u7ED3\u6784\u4E2D\u6807\u8BC6\u62BD\u8C61\u8D85\u7C7B\u3002
p5-1-1-16 = \u82E5\u6307\u660E\u7684\u6301\u4E45\u5316\u7C7B\u5B9E\u9645\u4E0A\u662F\u4E00\u4E2A\u63A5\u53E3\uFF0C\u8FD9\u4E5F\u662F\u5B8C\u5168\u53EF\u4EE5\u63A5\u53D7\u7684\u3002 \u4E4B\u540E\u4F60\u53EF\u4EE5\u7528\u5143\u7D20&lt;subclass&gt;\u6765\u6307\u5B9A\u8BE5\u63A5\u53E3\u7684\u5B9E\u9645\u5B9E\u73B0\u7C7B\u3002\u4F60\u53EF\u4EE5\u6301\u4E45\u5316\u4EFB\u4F55static\uFF08\u9759\u6001\u7684\uFF09\u5185\u90E8\u7C7B\u3002\u4F60\u5E94\u8BE5\u4F7F\u7528\u6807\u51C6\u7684\u7C7B\u540D\u683C\u5F0F\u6765\u6307\u5B9A\u7C7B\u540D\uFF0C\u6BD4\u5982\uFF1AFoo$Bar\u3002
p5-1-1-17 = \u4E0B\u9762\u662F\u5982\u4F55\u901A\u8FC7XML\u6765\u521B\u5EFA\u865A\u62DF\u89C6\u56FE(subselect)\uFF1A
p5-1-1-18 = &lt;subselect&gt; \u53EF\u4EE5\u4F5C\u4E3A\u5143\u7D20\u6216\u8005\u5C5E\u6027\u4F7F\u7528\u3002

#		**********************************************************************************************************
#		5.1.2. Identifiers
#		**********************************************************************************************************

title5-1-2 = 5.1.2. \u6807\u793A\u7B26
p5-1-2-1 = \u88AB\u6620\u5C04\u7684\u7C7B\u5FC5\u987B\u5B9A\u4E49\u5BF9\u5E94\u6570\u636E\u5E93\u8868\u4E3B\u952E\u5B57\u6BB5\u3002\u5927\u591A\u6570\u7C7B\u90FD\u5305\u542B\u4E86\u4E00\u4E2AJavaBean\u98CE\u683C\u7684\u5C5E\u6027\u4F5C\u4E3A\u5B9E\u4F8B\u7684\u552F\u4E00\u6807\u793A\u3002
p5-1-2-2 = \u7528<code>@Id</code>\u6765\u6807\u8BB0\u552F\u4E00\u6807\u793A\u7B26\u3002
p5-1-2-3 = \u5728 <code>hbm.xml</code>\u91CC\u4F7F\u7528&lt;id&gt; \u5143\u7D20\u6765\u5B9A\u4E49\u5C5E\u6027\u548C\u4E3B\u952E\u5217\u7684\u6620\u5C04\u3002
td5-1-2-1-1 = <code>name</code> (\u53EF\u9009): \u6807\u8BC6\u5C5E\u6027\u7684\u540D\u5B57\u3002
td5-1-2-1-2 = <code>type</code> (\u53EF\u9009): \u6807\u8BC6Hibernate\u7C7B\u578B\u7684\u540D\u5B57\u3002
td5-1-2-1-3 = <code>column</code> (\u53EF\u9009 - \u9ED8\u8BA4\u4E3A\u5C5E\u6027\u540D): \u4E3B\u952E\u5B57\u6BB5\u7684\u540D\u5B57\u3002
td5-1-2-1-4 = <code>unsaved-value</code> (\u53EF\u9009 - \u9ED8\u8BA4\u4E3A\u4E00\u4E2A\u5207\u5408\u5B9E\u9645\uFF08sensible\uFF09\u7684\u503C): \u4E00\u4E2A\u7279\u5B9A\u7684\u6807\u8BC6\u5C5E\u6027\u503C\uFF0C\u7528\u6765\u6807\u5FD7\u8BE5\u5B9E\u4F8B\u662F\u521A\u521A\u521B\u5EFA\u7684\uFF0C\u5C1A\u672A\u4FDD\u5B58\u3002\u7528\u6765\u548C\u5728\u4E4B\u524D\u7684Session\u4E2D\u4FDD\u5B58\u8FC7\u7684\u6216\u8005\u52A0\u8F7D\u8FC7\u7684\u5904\u4E8E\u6E38\u79BB\u72B6\u6001\u7684\u5B9E\u4F8B\u533A\u5206\u5F00\u6765\u3002
td5-1-2-1-5 = <code>access</code> (\u53EF\u9009-\u9ED8\u8BA4\u662Fproperty)\uFF1AHibernate\u6765\u8BBF\u95EE\u5C5E\u6027\u503C\u7684\u7B56\u7565\u3002
p5-1-2-4 = \u5982\u679C <code>name</code>\u5C5E\u6027\u4E0D\u5B58\u5728\uFF0C\u4F1A\u8BA4\u4E3A\u8FD9\u4E2A\u7C7B\u6CA1\u6709\u6807\u8BC6\u5C5E\u6027\u3002
p5-1-2-5 = <code>unsaved-value</code> \u5C5E\u6027\u5728Hibernate\u4E2D\u51E0\u4E4E\u4E0D\u5728\u9700\u8981\uFF0C\u5E76\u4E14\u5728annotations\u4E2D\u6CA1\u6709\u8FD9\u4E2A\u5143\u7D20\u3002
p5-1-2-6 = \u4F60\u4E5F\u53EF\u4EE5\u58F0\u660E\u4E00\u4E2A\u590D\u5408\u7684\u6807\u793A\u7B26\u3002 \u53EF\u4EE5\u8BBF\u95EE\u65E7\u5F0F\u7684\u591A\u4E3B\u952E\u6570\u636E\u3002\u6211\u4EEC\u5F3A\u70C8\u4E0D\u5EFA\u8BAE\u4F7F\u7528\u8FD9\u79CD\u65B9\u5F0F\u3002

#		**********************************************************************************************************
#		5.1.2.1. Composite identifier
#		**********************************************************************************************************

title5-1-2-1 = 5.1.2.1. \u590D\u5408\u4E3B\u952E
p5-1-2-1-1 = \u53EF\u4EE5\u4F7F\u7528\u4EE5\u4E0B\u8BED\u6CD5\u7C7B\u5B9A\u4E49\u590D\u5408\u4E3B\u952E\uFF1A
li5-1-2-1-1 = \u4F7F\u7528\u7EC4\u5408\u7C7B\u578B\u6765\u8868\u793A\u6807\u793A\u7B26\u5E76\u4E14\u5728\u5B9E\u4F53\u4E2D\u6620\u5C04\u4E3A\u4E00\u4E2A\u5C5E\u6027\uFF1A\u7136\u540E\u5C31\u53EF\u4EE5\u4F7F\u7528 @EmbeddedId\u6765\u6807\u6CE8\u8FD9\u4E2A\u5C5E\u6027\uFF0C\u7EC4\u4EF6\u7C7B\u578B\u5FC5\u987B\u662F\u53EF\u5E8F\u5217\u5316\u7684\u3002
li5-1-2-1-2 = \u4F7F\u7528<code>@Id</code>\u6807\u6CE8\u591A\u4E2A\u5C5E\u6027: \u6807\u793A\u7B26\u7C7B\u578B\u672C\u8EAB\u5FC5\u987B\u662F<code>\u5E8F\u5217\u5316</code>\u7684\u3002\u4E0D\u5E78\u7684\u662F\u8FD9\u79CD\u65B9\u6CD5\u4E0D\u662F\u4E00\u79CD\u6807\u51C6\uFF0C\u5E76\u4E14\u53EA\u6709Hibernate\u652F\u6301\u3002
li5-1-2-1-3 = \u7528 @Id\u6620\u5C04\u591A\u4E2A\u5C5E\u6027\u5E76\u4E14\u58F0\u660E\u4E00\u4E2A\u5916\u90E8\u7684\u7C7B\u4F5C\u4E3A\u6807\u793A\u7B26\u7C7B\u578B\u3002\u8FD9\u4E2A\u7C7B\u5FC5\u987B\u662F\u53EF\u5E8F\u5217\u5316\u7684\u5E76\u4E14\u9700\u8981\u4F7F\u7528 @IdClass \u6765\u6807\u6CE8\u4E3A\u5B9E\u4F53\u3002 \u8FD9\u4E2A\u6807\u793A\u7C7B\u578B\u5FC5\u987B\u5305\u542B\u5C5E\u6027\u548C\u5B9E\u4F53\u7684\u6807\u793A\u7B26\u76F8\u540C\u7684\u5C5E\u6027\uFF1A\u6BCF\u4E2A\u5C5E\u6027\u540D\u79F0\u5FC5\u987B\u76F8\u540C\uFF0C\u540C\u6837\u7684\u5982\u679C\u5C5E\u6027\u7684\u7C7B\u578B\u662F\u57FA\u672C\u7C7B\u578B\u90A3\u4E48\u4E5F\u5FC5\u987B\u76F8\u540C\uFF0C\u5982\u679C\u5B9E\u4F53\u5C5E\u6027\u662F\u4E00\u4E2A\u5173\u8054\uFF08 <code>@OneToOne</code> \u6216\u8005 <code>@ManyToOne</code>\uFF09\u90A3\u4E48\u4ED6\u7684\u7C7B\u578B\u5FC5\u987B\u662F\u8FD9\u4E2A\u5173\u8054\u5B9E\u4F53\u7684\u4E3B\u952E\u7684\u7C7B\u578B\u3002
p5-1-2-1-2 = \u6B63\u5982\u4F60\u6240\u770B\u5230\u7684\uFF0C\u6700\u540E\u4E00\u4E2A\u6848\u4F8B\u5F88\u4E0D\u660E\u663E\u3002 \u662F\u4E3A\u4E86\u5411\u540E\u517C\u5BB9,\u5B83\u7EE7\u627F\u4E86EJB2\u3002\u6211\u4EEC\u4E0D\u63A8\u8350\u4F7F\u7528\uFF08\u4E3A\u4E86\u7B80\u5355\u8D77\u89C1\uFF09\u3002
p5-1-2-1-3 = \u6211\u4EEC\u7528\u4F8B\u5B50\u6765\u6F14\u793A\u4E0A\u9762\u4E09\u79CD\u60C5\u51B5\uFF1A

#		**********************************************************************************************************
#		5.1.2.1.1. id as a property using a component type
#		**********************************************************************************************************

title5-1-2-1-1 = 5.1.2.1.1. \u4F7F\u7528\u7EC4\u4EF6\u7C7B\u578B\u4F5C\u4E3AId\u5C5E\u6027
p5-1-2-1-1-1 = \u4E0B\u9762\u662F\u4E00\u4E2A <code>@EmbeddedId</code>\u7684\u7B80\u5355\u4F8B\u5B50\u3002
p5-1-2-1-1-2 = \u53EF\u4EE5\u6CE8\u610F\u5230 <code>UserId</code> \u7C7B\u662F <code>\u5E8F\u5217\u5316</code>\u7684\u3002 \u4F7F\u7528<code>@AttributeOverride</code>\u6765\u8986\u76D6\u5217\u6620\u5C04\u3002
p5-1-2-1-1-3 = \u5D4C\u5957\u4E3B\u952E\u672C\u8EAB\u53EF\u4EE5\u5305\u542B\u5173\u8054\u5B9E\u4F53\u7684\u4E3B\u952E\u3002
p5-1-2-1-1-4 = \u5D4C\u5957Id\u7684\u5BF9\u8C61\uFF0C\u5173\u8054\u4F1A\u88AB\u8868\u793A\u4E3A\u5173\u8054\u5B9E\u4F53\u7684\u8868\u793A\u7B26\u3002 \u4F46\u662F\u4F60\u53EF\u4EE5\u4F7F\u7528 @MapsId\u6CE8\u89E3\u5728\u4E00\u4E2A\u5B9E\u4F53\u4E2D\u8FDE\u63A5\u5230\u7279\u5B9A\u7684\u5173\u8054\u3002 @MapsId\u7684\u503C\u5BF9\u5E94\u5BF9\u8C61\u7684\u5D4C\u5957id\u7684\u5C5E\u6027\u540D\uFF0C\u5305\u62EC\u5173\u8054\u7684\u5B9E\u4F53\u7684\u6807\u8BC6\u3002\u5728\u6570\u636E\u5E93\u4E2D\uFF0C\u610F\u5473\u7740<code>Customer.user</code> \u548C<code>CustomerId.userId</code> \u5C5E\u6027\u5171\u4EAB\u76F8\u540C\u7684\u5217 (\u5728\u8FD9\u4E2A\u4F8B\u5B50\u4E2D\u662F<code>user_fk</code>).
tc5-1-2-1-1-1 = \u7EC4\u5408\u7C7B\u578B\u4F5C\u4E3A\u552F\u4E00\u6807\u793A\u7B26\u5FC5\u987B\u5B9E\u73B0<code>equals()</code> \u548C <code>hashCode()</code>\u65B9\u6CD5\u3002
p5-1-2-1-1-5 = \u5B9E\u9645\u4E0A\uFF0C\u4EE3\u7801\u53EA\u8BBE\u7F6E\u4E86<code>Customer.user</code>\u5C5E\u6027\uFF0CHibernate\u4F1A\u628Auser id\u7684\u503Ccopy\u5230<code>CustomerId.userId</code>\u5C5E\u6027\u3002
wc5-1-2-1-1-1 = id\u7684\u503C\u53EA\u6709\u5728flush\u7684\u65F6\u5019\u624D\u4F1A\u88ABcopy, \u4E0D\u8981\u4F9D\u8D56\u5B83\u3002
p5-1-2-1-1-6 = \u7136\u800C\u5728JPA\u4E2D\u4E0D\u652F\u6301\uFF0C Hibernate\u5141\u8BB8\u4F60\u5728\u5D4C\u5957\u7EC4\u4EF6Id\u4E2D\u76F4\u63A5\u8BBE\u7F6E\u5173\u8054 (\u4EE3\u66FF @MapsId).
p5-1-2-1-1-7 = \u7528<code>hbm.xml</code> \u6765\u5B9E\u73B0\u4E0A\u9762\u7684\u529F\u80FD\uFF1A
p5-1-2-1-1-8 = \u9996\u5148\u4E00\u4E2A\u7B80\u5355\u7684\u4F8B\u5B50\uFF1A
p5-1-2-1-1-9 = \u4E0B\u9762\u7684\u4F8B\u5B50\u6F14\u793A\u600E\u6837\u6620\u5C04\u4E00\u4E2A\u5173\u8054\uFF1A
p5-1-2-1-1-10 = \u5728\u4E0A\u9762\u7684\u793A\u4F8B\u4E2D\u6CE8\u610F\u4EE5\u4E0B\u51E0\u70B9:
li5-1-2-1-1-1-1 = \u5C5E\u6027\u5217\u7684\u987A\u5E8F\u5F88\u91CD\u8981\u3002\u5728\u5173\u8054\u548C\u88AB\u5173\u8054\u7684\u5B9E\u4F53\u91CC\u7684\u4E3B\u952E\u91CC\u7684\u987A\u5E8F\u5FC5\u987B\u8981\u76F8\u540C\u3002
li5-1-2-1-1-1-2 = \u591A\u5BF9\u4E00\u4F7F\u7528\u76F8\u540C\u7684\u5217\u4F5C\u4E3A\u4E3B\u952E \u56E0\u6B64\u5FC5\u987B\u6807\u8BB0\u4E3A\u53EA\u8BFB\u7684\uFF08<code>inserttable </code>\u548C <code>updateable</code> \u8BBE\u7F6E\u4E3Afalse\uFF09\u3002
li5-1-2-1-1-1-3 = \u548C @MapsId \u4E0D\u540C\uFF0C\u88AB\u5173\u8054\u5B9E\u4F53\u7684Id\u503C\u4E0D\u4F1A\u88AB\u590D\u5236\uFF0C \u66F4\u591A\u4FE1\u606F\u67E5\u770B\u5916\u952E\u751F\u6210\u3002
p5-1-2-1-1-11 = \u6700\u540E\u4E00\u4E2A\u793A\u4F8B\u6F14\u793A\u600E\u6837\u5728\u5D4C\u5957Id\u4E2D\u76F4\u63A5\u6620\u5C04\u5173\u8054\u3002
p5-1-2-1-1-12 = \u63A8\u8350\u4F7F\u7528\u8FD9\u79CD\u65B9\u6CD5\u6765\u6620\u5C04\u7EC4\u5408\u4E3B\u952E\u3002\u4E0B\u9762\u7684\u9009\u9879\u9664\u975E\u7279\u6B8A\u7684\u7EA6\u5B9A\u5426\u5219\u4E0D\u5E94\u8BE5\u8003\u8651\u5728\u5185\u3002

#		**********************************************************************************************************
#		5.1.2.1.2. Multiple id properties without identifier type
#		**********************************************************************************************************

title5-1-2-1-2 = 5.1.2.1.2. \u4E0D\u5E26\u6807\u793A\u7B26\u7C7B\u578B\u7684\u591AId\u5C5E\u6027
p5-1-2-1-2-1 = \u53E6\u5916\u4E00\u4E2A\u66F4\u81EA\u7136\u7684\u65B9\u6CD5\u662F\u5728\u5B9E\u4F53\u4E2D\u4E3A\u591A\u4E2A\u5C5E\u6027\u8BBE\u7F6E @Id\u3002\u8FD9\u79CD\u65B9\u6CD5\u53EA\u5728Hibernate\u4E2D\u652F\u6301(JPA\u4E0D\u652F\u6301) \u4F46\u662F\u4E0D\u9700\u8981\u989D\u5916\u7684\u5D4C\u5957\u7EC4\u4EF6\u3002
p5-1-2-1-2-2 = \u5728\u8FD9\u4E2A\u4F8B\u5B50\u4E2DCustomer \u4F7F\u7528\u81EA\u8EAB\u7684\u6807\u793A\u7B26\u8868\u793A: \u4ED6\u5FC5\u987B\u662F\u53EF\u5E8F\u5217\u5316\u7684\u5E76\u4E14\u5FC5\u987B\u590D\u5199<code>equals()</code> \u548C<code>hashCode()</code>)\u65B9\u6CD5\u3002
p5-1-2-1-2-3 = \u5728 <code>hbm.xml</code>\u4E2D\u5B9E\u73B0\u76F8\u540C\u7684\u6620\u5C04:

#		**********************************************************************************************************
#		5.1.2.1.3. Multiple id properties with with a dedicated identifier type
#		**********************************************************************************************************

title5-1-2-1-3 = 5.1.2.1.3. \u591A\u4E2Aid\u5C5E\u6027\u5177\u6709\u4E13\u7528\u6807\u793A\u7B26\u7C7B\u578B
p5-1-2-1-3-1 = \u5728\u5B9E\u4F53\u4E0A\u7684 @IdClass \u6307\u5411\u8FD9\u4E2A\u7C7B\u7684\u6807\u793A\u7B26\u7684\u7C7B\u3002\u5B9E\u4F53\u4E2D\u6807\u6CE8\u4E3A @Id\u7684\u5C5E\u6027\u5FC5\u987B\u5728 @IdClass\u4E2D\u6709\u5BF9\u5E94\u7684\u5C5E\u6027\u3002 \u641C\u7D22\u53CC\u5C5E\u6027\u7684\u7684\u8FD4\u56DE\u7C7B\u578B\u5FC5\u987B\u4E3A\u76F8\u540C\u7684\u57FA\u672C\u5C5E\u6027\uFF0C\u6216\u8005\u5FC5\u987B\u5BF9\u5E94\u4E8E\u5173\u8054\u7684\u5173\u8054\u5B9E\u4F53\u7684\u6807\u793A\u7B26\u7C7B\u578B\u3002
wc5-1-2-1-3-1 = \u8FD9\u4E2A\u65B9\u6CD5\u7EE7\u627F\u81EAEJB2\uFF0C\u4E0D\u63A8\u8350\u4F7F\u7528\uFF0C\u4F46\u662FHibernate\u652F\u6301\uFF0C\u7528\u4E0D\u7528\u7531\u4F60\u51B3\u5B9A\u3002
p5-1-2-1-3-2 = Customer \u548C CustomerId \u6709\u76F8\u540C\u7684\u5C5E\u6027customerNumber \uFF0Cuser \u4E5F\u662F\u3002<code>user.CustomerId</code> \u5FC5\u987B\u662F\u5E8F\u5217\u5316\u7684\u5E76\u4E14\u9700\u8981\u590D\u5199<code>equals()</code>\u548C<code>hashCode()</code>\u65B9\u6CD5\u3002
p5-1-2-1-3-3 = \u5C3D\u7BA1\u4E0D\u662FJPA\u6807\u51C6\uFF0C Hibernate\u5141\u8BB8\u4F60\u5728<code>@IdClass</code>\u4E2D\u58F0\u660E\u5173\u8054\u3002
p5-1-2-1-3-4 = \u5BF9\u8FD9\u4E2A\u529F\u80FD\u7684\u5174\u8DA3\u6709\u9650\uFF0C\u5C3D\u7BA1\u4F60\u53EF\u80FD\u4F1A\u9009\u62E9\u4F7F\u7528<code>@IdClass</code> \u6765\u517C\u5BB9JPA\u6807\u51C6\uFF0C\u6216\u8005\u6709\u8BA9\u4EBA\u65E0\u6CD5\u7406\u89E3\u7684\u60F3\u6CD5\u3002
p5-1-2-1-3-5 = \u5728<code>hbm.xml</code> \u4E2D\u5B9E\u73B0\u76F8\u540C\u7684\u529F\u80FD:

#		**********************************************************************************************************
#		5.1.2.2. Identifier generator
#		**********************************************************************************************************

title5-1-2-2 = 5.1.2.2. \u6807\u8BC6\u7B26\u751F\u6210\u5668
p5-1-2-2-1 = Hibernate\u53EF\u4EE5\u81EA\u52A8\u7684\u5E2E\u4F60\u751F\u6210\u5E76\u4E14\u586B\u5145\u6807\u8BC6\u7B26\u7684\u503C\u3002 \u63A8\u8350\u5728\u201Dbusiness\u201C \u6216\u8005"nature"id\u4E2D\u4F7F\u7528\u8FD9\u79CD\u65B9\u6CD5\uFF08\u5C24\u5176\u662F\u590D\u5408\u4E3B\u952E\u4E2D\uFF09\u3002
p5-1-2-2-2 = Hibernate\u63D0\u4F9B\u4E86\u5F88\u591A\u4E3B\u952E\u751F\u6210\u7B56\u7565\uFF0C \u6211\u4EEC\u6765\u770B\u4E00\u4E0B\u7B26\u5408JPA\u89C4\u8303\u7684\u6700\u957F\u7528\u7684\u51E0\u79CD\u65B9\u5F0F\u3002
li5-1-2-2-1-1 = IDENTITY: \u5BF9DB2,MySQL, MS SQL Server, Sybase\u548CHypersonicSQL\u7684\u5185\u7F6E\u6807\u8BC6\u5B57\u6BB5\u63D0\u4F9B\u652F\u6301\u3002\u8FD4\u56DE\u7684\u6807\u8BC6\u7B26\u662F<code>long</code>, <code>short</code> \u6216\u8005 <code>int</code>.
li5-1-2-2-1-2 = SEQUENCE (\u5728Hibernate\u4E2D\u79F0\u4F5Cseqhilo): \u4F7F\u7528\u9AD8/\u4F4E\u7B97\u6CD5\u4E3A\u4E00\u4E2A\u7279\u5B9A\u7684\u6570\u636E\u5E93\u5E8F\u5217\u6765\u751F\u6210\u6807\u793A\u7B26\uFF0C\u8FD4\u56DE\u7684\u6807\u8BC6\u7B26\u7C7B\u578B\u4E3A <code>long</code>, <code>short</code> \u6216\u8005 <code>int</code>\u3002
li5-1-2-2-1-3 = TABLE (\u5728Hibernate\u4E2D\u79F0\u4E3A <code>AMultipleHiLoPerTableGenerator</code> ) : \u4F7F\u7528\u9AD8/\u4F4E\u7B97\u6CD5\u6765\u6709\u6548\u7684\u751F\u6210\u6807\u793A\u7B26\uFF0C \u7C7B\u578B\u4E3Along, short, \u6216\u8005int\u3002 \u7ED9\u5B9A\u4E00\u4E2A\u8868\u548C\u5B57\u6BB5\uFF08\u9ED8\u8BA4\u5206\u522B\u662F hibernate_unique_key \u548Cnext_hi\uFF09\u4F5C\u4E3A\u9AD8\u4F4D\u503C\u7684\u6765\u6E90\u3002 \u9AD8/\u4F4E\u4F4D\u7B97\u6CD5\u751F\u6210\u7684\u6807\u8BC6\u7B26\u53EA\u5728\u4E00\u4E2A\u7279\u5B9A\u7684\u6570\u636E\u5E93\u4E2D\u662F\u552F\u4E00\u7684\u3002
li5-1-2-2-1-4 = AUTO: \u4F9D\u636E\u5E95\u5C42\u6570\u636E\u5E93\u7684\u529F\u80FD\u9009\u62E9 <code>IDENTITY</code>, <code>SEQUENCE</code> \u6216 <code>TABLE</code> \u3002
ic5-1-2-2-1 = \u63A8\u8350\u6240\u6709\u7684\u65B0\u9879\u76EE\u4F7F\u7528\u589E\u5F3A\u7684\u4E3B\u952E\u751F\u6210\u7B56\u7565\u3002 \u4ED6\u4EEC\u5728\u5B9E\u4F53\u6CE8\u89E3\u4E2D\u9ED8\u8BA4\u662F\u5173\u95ED\u7684\uFF0C\u4F46\u662F\u53EF\u4EE5\u4F7F\u7528hibernate.id.new_generator_mapping=true\u6765\u6FC0\u6D3B\u3002\u8FD9\u4E9B\u65B0\u7684\u751F\u6210\u5668\u66F4\u52A0\u7684\u6709\u6548\u5E76\u4E14\u66F4\u52A0\u7684\u590D\u5408JPA2\u7684\u89C4\u8303\u3002<br/>\u5BF9\u4E8E\u5DF2\u6709\u7684Hibernate\u5E94\u7528\u4ED6\u4EEC\u4E0D\u4F1A\u5411\u4E0B\u517C\u5BB9(\u5982\u679C\u4F7F\u7528sequence\u6216\u8005table\u751F\u6210\u7B56\u7565\u7684\u8BDD)\u3002\u53C2\u8003 <a href="#c5-1-2-2">5.1.2.2. \u6807\u8BC6\u7B26\u751F\u6210\u5668</a> \u6765\u83B7\u53D6\u66F4\u591A\u4FE1\u606F\u3002
p5-1-2-2-3 = \u4F7F\u7528 @GeneratedValue \u628A\u4E00\u4E2Aid\u5C5E\u6027\u6807\u8BC6\u4E3A\u81EA\u52A8\u751F\u6210\u3002\u4F60\u53EF\u4EE5\u901A\u8FC7\u8BBE\u7F6E<code>strategy</code>\u6765\u6307\u5B9A\u751F\u6210\u7B56\u7565\uFF0C\u9ED8\u8BA4\u662Fauto\u3002
p5-1-2-2-4 = SEQUENCE \u548C TABLE\u9700\u8981\u8FDB\u884C\u989D\u5916\u7684\u914D\u7F6E\uFF0C \u4F7F\u7528<code>@SequenceGenerator</code>\u548C<code>@TableGenerator</code>:
li5-1-2-2-2-1 = <code>name</code>:\u751F\u6210\u5668\u7684\u540D\u79F0
li5-1-2-2-2-2 = <code>table / sequenceName</code>: \u8868\u6216\u8005\u5E8F\u5217\u7684\u540D\u79F0 (\u9ED8\u8BA4\u5206\u522B\u4E3Ahibernate_sequences \u548Chibernate_sequence)
li5-1-2-2-2-3 = <code>catalog / schema</code>:
li5-1-2-2-2-4 = <code>initialValue</code>: Id\u7684\u521D\u59CB\u503C\u3002
li5-1-2-2-2-5 = <code>allocationSize</code>: \u751F\u6210Id\u65F6\u7684\u589E\u91CF
p5-1-2-2-5 = \u53E6\u5916\uFF0C TABLE\u7B56\u7565\u8FD8\u5141\u8BB8\u4EE5\u4E0B\u914D\u7F6E\uFF1A
li5-1-2-2-3-1 = <code>pkColumnName</code>: \u5305\u542B\u5B9E\u4F53\u6807\u8BC6\u7B26\u7684\u5217\u540D
li5-1-2-2-3-2 = <code>valueColumnName</code>: \u5305\u542B\u6807\u8BC6\u7B26\u503C\u7684\u5217\u540D
li5-1-2-2-3-3 = <code>pkColumnValue</code>: \u5B9E\u4F53\u6807\u8BC6\u7B26
li5-1-2-2-3-4 = <code>uniqueConstraints</code>: \u5305\u62ECId\u5728\u5185\u7684\u4EFB\u4F55\u8868\u7684\u53EF\u80FD\u7684\u5217\u7EA6\u675F
p5-1-2-2-6 = \u94FE\u63A5\u4E00\u4E2ATABLE\u6216\u8005sequence\u751F\u6210\u5668\u5230\u4E00\u4E2A\u5B9E\u9645\u7684\u751F\u6210\u5C5E\u6027\uFF0C  \u5B9A\u4E49\u7684name\u548C\u751F\u6210\u5668\u7684<code>generator</code> \u5C5E\u6027\u7684\u503C\u8981\u76F8\u540C\uFF0C \u5982\u4E0B\uFF1A
p5-1-2-2-7 = \u751F\u6210\u5668\u7684\u5B9A\u4E49\u8303\u56F4\u53EF\u4EE5\u662F\u6574\u4E2A\u5E94\u7528\u6216\u8005\u662F\u7C7B\u3002\u7C7B\u8303\u56F4\u7684\u751F\u6210\u5668\u5BF9\u5916\u662F\u4E0D\u53EF\u89C1\u7684\u5E76\u4E14\u53EF\u4EE5\u590D\u5199\u5E94\u7528\u8303\u56F4\u7684\u751F\u6210\u5668\u3002\u5E94\u7528\u8303\u56F4\u7684\u751F\u6210\u5668\u5B9A\u4E49\u5728JPA\u7684xml\u90E8\u7F72\u63CF\u8FF0\u7B26\u4E2D\u3002(\u53C2\u8003 <a href="#c5-1-2-2">5.1.2.2. \u6807\u8BC6\u7B26\u751F\u6210\u5668</a>):
p5-1-2-2-8 = \u5982\u679C\u4F7F\u7528JPA\u7684XML\u63CF\u8FF0\u7B26 (\u50CF <code>META-INF/orm.xml</code>) \u6765\u5B9A\u4E49\u751F\u6210\u5668\uFF0C <code>EMP_GEN</code> \u548C <code>SEQ_GEN</code> \u90FD\u662F\u5E94\u7528\u7EA7\u522B\u7684\u751F\u6210\u5668\u3002
nc5-1-2-2-1 = JPA\u4E0D\u652F\u6301\u5305\u7EA7\u522B\u7684\u5B9A\u4E49\u3002\u7136\u800C\u4F60\u53EF\u4EE5\u4F7F\u7528 @GenericGenerator \u6765\u5B9A\u4E49package\u7EA7\u522B\u7684\u751F\u6210\u5668\u3002(\u53C2\u8003 <a href="#c5-1-2-2">5.1.2.2. \u6807\u8BC6\u7B26\u751F\u6210\u5668</a>).
p5-1-2-2-9 = \u4EE5\u4E0A\u662FJPA\u7684\u6807\u51C6\u751F\u6210\u5668\u3002 Hibernate\u8D85\u8D8A\u4E86JPA\u6807\u51C6\u63D0\u4F9B\u4E86\u4E00\u4E9B\u989D\u5916\u7684\u751F\u6210\u5668\u6216\u8005\u989D\u5916\u7684\u9009\u9879\u3002\u4F60\u4E5F\u53EF\u4EE5\u901A\u8FC7\u5B9E\u73B0<code>org.hibernate.id.IdentifierGenerator</code>\u6765\u81EA\u5B9A\u4E49\u4E3B\u952E\u751F\u6210\u5668\u3002
p5-1-2-2-10 = \u8981\u60F3\u81EA\u5B9A\u4E49\u751F\u6210\u5668\uFF0C\u4F7F\u7528 <code>@GenericGenerator</code> \u6CE8\u89E3 (\u6216\u8005\u662F\u4ED6\u7684\u590D\u6570\u5F62\u5F0F <code>@GenericGenerators</code>) \u6765\u63CF\u8FF0\u7C7B\u7684\u4E3B\u952E\u751F\u6210\u7B56\u7565\u6216\u8005\u7F29\u7565\u540D\u548C\u4E00\u4E9B\u952E\u503C\u5BF9\u3002 \u5F53\u4F7F\u7528<code>@GenericGenerator</code> \u5E76\u4E14\u901A\u8FC7<code>@GeneratedValue.generator</code>\u5206\u914D\u65F6\uFF0C @GeneratedValue.strategy\u4F1A\u88AB\u5FFD\u7565\uFF1A\u7559\u7A7A.
p5-1-2-2-11 = \u4EE5hbm.xml\u7684\u65B9\u5F0F\uFF0C \u5728<code>&lt;id&gt;</code>\u6807\u7B7E\u4E2D\u4F7F\u7528\u53EF\u9009\u7684<code>&lt;generator&gt;</code>\u5B50\u5143\u7D20\uFF0C\u5982\u679C\u9700\u8981\u4E00\u4E9B\u53C2\u6570\u6765\u914D\u7F6E\u6216\u521D\u59CB\u5316\u751F\u6210\u5668\u5B9E\u4F8B\uFF0C\u4F7F\u7528<code>&lt;param&gt;</code> \u5143\u7D20\u6765\u4F20\u9012\u3002

#		**********************************************************************************************************
#		5.1.2.2.1. Various additional generators
#		**********************************************************************************************************

title5-1-2-2-1 = 5.1.2.2.1. \u4E00\u4E9B\u53EF\u9009\u7684\u751F\u6210\u7B56\u7565\u3002
p5-1-2-2-1-1 = \u6240\u6709\u7684\u751F\u6210\u5668\u90FD\u5B9E\u73B0\u4E86<code>org.hibernate.id.IdentifierGenerator</code>\u63A5\u53E3\u3002\u8FD9\u662F\u4E00\u4E2A\u5F88\u7B80\u5355\u7684\u63A5\u53E3\u3002\u4E00\u4E9B\u5E94\u7528\u53EF\u4EE5\u6709\u9009\u62E9\u7684\u63D0\u4F9B\u81EA\u5DF1\u7684\u5E8F\u5217\u5316\u5B9E\u73B0\uFF0C\u7136\u800C\uFF0CHibernate\u63D0\u4F9B\u4E86\u4E00\u4E9B\u5185\u7F6E\u7684\u5B9E\u73B0\u3002\u5982\u4E0B\uFF1A
dd5-1-2-2-1-1-1 = \u7528\u4E8E\u4E3Along, short\u6216\u8005int\u7C7B\u578B\u751F\u6210 \u552F\u4E00\u6807\u8BC6\u3002\u53EA\u6709\u5728\u6CA1\u6709\u5176\u4ED6\u8FDB\u7A0B\u5F80\u540C\u4E00\u5F20\u8868\u4E2D\u63D2\u5165\u6570\u636E\u65F6\u624D\u80FD\u4F7F\u7528\u3002 \u5728\u96C6\u7FA4\u4E0B\u4E0D\u8981\u4F7F\u7528\u3002
dd5-1-2-2-1-1-2 = \u652F\u6301\u7684\u6570\u636E\u5E93\u6709DB2\uFF0CMySQL\uFF0CMS SQL Server\uFF0CSybase\u548CHypersonicSQL\u3002\u8FD4\u56DE\u7684\u6807\u8BC6\u7B26\u7C7B\u578B\u4E3A <code>long</code>, <code>short</code> \u6216\u8005 <code>int</code>\u3002
dd5-1-2-2-1-1-3 = \u5728DB2,PostgreSQL, Oracle, SAP DB, McKoi\u4E2D\u4F7F\u7528\u5E8F\u5217\uFF08sequence)\uFF0C \u800C\u5728Interbase\u4E2D\u4F7F\u7528\u751F\u6210\u5668(generator)\u3002\u8FD4\u56DE\u7684\u6807\u8BC6\u7B26\u7C7B\u578B\u4E3A<code>long</code>, <code>short</code> \u6216 <code>int</code>\u3002
dd5-1-2-2-1-1-4 =  \u4F7F\u7528\u4E00\u4E2A\u9AD8/\u4F4E\u4F4D\u7B97\u6CD5\u9AD8\u6548\u7684\u751F\u6210long, short \u6216\u8005 int\u7C7B\u578B\u7684\u6807\u8BC6\u7B26\u3002 \u7ED9\u5B9A\u4E00\u4E2A\u8868\u548C\u5B57\u6BB5\uFF08\u9ED8\u8BA4\u5206\u522B\u662F hibernate_unique_key\u548Cnext_hi\uFF09\u4F5C\u4E3A\u9AD8\u4F4D\u503C\u7684\u6765\u6E90\u3002\u9AD8/\u4F4E\u4F4D\u7B97\u6CD5\u751F\u6210\u7684\u6807\u8BC6\u7B26\u53EA\u5728\u4E00\u4E2A\u7279\u5B9A\u7684\u6570\u636E\u5E93\u4E2D\u662F\u552F\u4E00\u7684\u3002 
dd5-1-2-2-1-1-5 = \u4F7F\u7528\u9AD8/\u4F4E\u7B97\u6CD5\u4E3A\u4E00\u4E2A\u5DF2\u547D\u540D\u7684\u6570\u636E\u5E93\u5E8F\u5217\u6765\u9AD8\u6548\u7684\u751F\u6210long\uFF0Cshort \u6216\u8005 int\u7C7B\u578B\u7684\u6807\u8BC6\u7B26\u3002
dd5-1-2-2-1-1-6 = \u7528\u4E00\u4E2A128-bit\u7684UUID\u7B97\u6CD5\u751F\u6210\u5B57\u7B26\u4E32\u7C7B\u578B\u7684\u6807\u8BC6\u7B26\uFF0CUUID\u88AB\u7F16\u7801\u4E3A\u4E00\u4E2A32\u4F4D16\u8FDB\u5236\u6570\u5B57\u7684\u5B57\u7B26\u4E32\u3002\u7528\u6237\u4E5F\u53EF\u4EE5\u901A\u8FC7\u914D\u7F6E\u5206\u9694\u7B26\u628A16\u8FDB\u5236\u6570\u5206\u5272\u4E3A8,8,4,8,4\u7684\u683C\u5F0F (\u914D\u7F6E\u53C2\u6570\u201Dseparator\u201C)\uFF0C\u9700\u8981\u6CE8\u610F\u7684\u662F\u8FD9\u548CIETF RFC 4122\u8868\u793A\u76848-4-4-4-12\u4E0D\u540C\u3002 \u5982\u679C\u4F60\u9700\u8981\u662FRFC 4122\u517C\u5BB9UUIDs, \u8003\u8651\u4F7F\u7528uuid2\u3002
dd5-1-2-2-1-1-7 = \u751F\u6210\u4E00\u4E2AIETF RFC 4122\u517C\u5BB9128\u4F4D\u7684UUID\u3002 \u57FA\u4E8E\u63D2\u4EF6\u5F0F\u7684\u201C\u751F\u6210\u7B56\u7565\u201D\u6765\u751F\u6210\u786E\u5207\u7684\u201Cversion\u201D(RFC\u672F\u8BED). \u53EF\u4EE5\u751F\u6210\u7684\u503C\u6709java.util.UUID, java.lang.String\u6216\u8005\u957F\u5EA6\u4E3A16\u7684byte\u6570\u7EC4\uFF08byte[16]\uFF09\u3002 \u751F\u6210\u7B56\u7565\u7531\u63A5\u53E3org.hibernate.id.UUIDGenerattionStrategy\u5B9A\u4E49\u3002\u751F\u6210\u5668\u5B9A\u4E49\u4E862\u4E2A\u914D\u7F6E\u53C2\u6570\u6765\u51B3\u5B9A\u4F7F\u7528\u54EA\u4E00\u4E2A\u751F\u6210\u7B56\u7565\uFF1A
dd5-1-2-2-1-1-7-1 = \u5217\u4E3E \u4F7F\u7528\u7684UUIDGenerationStrategy\u7C7B\u3002
dd5-1-2-2-1-1-7-2 = \u5217\u4E3E\u4F7F\u7528\u7684UUIDGenerationStrategy\u5B9E\u4F8B\u3002
p5-1-2-2-1-2 = \u4EE5\u4E0B\u7684\u7B56\u7565\u5177\u6709\u521B\u9020\u6027\uFF1A
li5-1-2-2-1-1-1 = <code>org.hibernate.id.uuid.StandardRandomStrategy</code> (\u9ED8\u8BA4\u7684) - \u901A\u8FC7<code>java.util.UUID</code>\u7684randomUUID\u65B9\u6CD5\u751F\u6210\u7B2C\u4E09\u4E2A\u7248\u672C\u7684UUID\uFF08\u53C8\u53EB\u505A\u201D\u968F\u673A\u201C\uFF09\u3002 
li5-1-2-2-1-1-2 = <code>org.hibernate.id.uuid.CustomVersionOneStrategy</code> - \u751F\u6210\u7B2C\u4E00\u4EE3\u7684UUID\u503C\u3002 \u5F53Mac\u5730\u5740\u4E0D\u53EF\u7528\u65F6\u4F7F\u7528IP\u5730\u5740\u3002\u5982\u679C\u4F60\u9700\u8981\u4F7F\u7528Mac\u5730\u5740\uFF0C\u8003\u8651\u4F7F\u7528\u4E00\u4E2A\u5DF2\u5B58\u5728\u7684\u7B2C\u4E09\u65B9\u7684UUID\u751F\u6210\u5668\u53EF\u4EE5\u53D1\u73B0Mac\u5730\u5740\u5E76\u4E14\u901A\u8FC7<code>org.hibernate.id.UUIDGenerationStrategy</code>\u6574\u5408\u3002\u5230\u76EE\u524D\u4E3A\u6B62\u5DF2\u7ECF\u77E5\u9053\u7684\u5E93\u6709 <a href="http://johannburkard.de/software/uuid/">http://johannburkard.de/software/uuid/</a> \u548C <a href="http://commons.apache.org/sandbox/id/uuid.html">http://commons.apache.org/sandbox/id/uuid.html</a>
dd5-1-2-2-1-1-8 = \u5728MS SQL Server\u548CMySQL\u4E2D\u4F7F\u7528\u6570\u636E\u5E93\u751F\u6210\u7684GUID\u5B57\u7B26\u4E32\u3002
dd5-1-2-2-1-1-9 = \u6839\u636E\u5E95\u5C42\u7684\u6570\u636E\u5E93\u7684\u529F\u80FD\u9009\u62E9\u4F7F\u7528identity, sequence\u6216\u8005hilo\u3002
dd5-1-2-2-1-1-10 = \u8BA9\u5E94\u7528\u7A0B\u5E8F\u5728\u8C03\u7528save()\u65B9\u6CD5\u8C03\u7528\u4E4B\u524D\u4E3A\u5BF9\u8C61\u5206\u914D\u4E00\u4E2AId\u3002\u5982\u679C\u6CA1\u6709\u6307\u5B9A<generator>\u5143\u7D20\u9ED8\u8BA4\u4F7F\u7528\u6B64\u7B56\u7565\u3002
dd5-1-2-2-1-1-11 = \u901A\u8FC7\u4E00\u4E9B\u552F\u4E00\u952E\u6765\u67E5\u627E\u4E00\u4E9B\u5217\uFF0C\u6765\u68C0\u7D22\u6709\u6570\u636E\u5E93\u89E6\u53D1\u5668\u751F\u6210\u7684\u4E3B\u952E\u548C\u4E3B\u952E\u7684\u503C\u3002
dd5-1-2-2-1-1-12 = \u4F7F\u7528\u53E6\u4E00\u4E2A\u5173\u8054\u5BF9\u8C61\u7684\u6807\u8BC6\u7B26\u3002 \u901A\u5E38\u548C<one-to-one>\u4E3B\u952E\u5173\u8054\u7ED3\u5408\u4F7F\u7528\u3002
dd5-1-2-2-1-1-13 = \u4E00\u79CD\u7279\u522B\u7684\u5E8F\u5217\u751F\u6210\u7B56\u7565,\u4F7F\u7528\u6570\u636E\u5E93\u5E8F\u5217\u6765\u751F\u6210\u5B9E\u9645\u503C, \u4F46\u5C06\u5B83\u548CJDBC3\u7684getGeneratedKeys\u7ED3\u5408\u5728\u4E00\u8D77, \u4F7F\u5F97\u5728\u63D2\u5165\u8BED\u53E5\u6267\u884C\u7684\u65F6\u5019\u5C31\u8FD4\u56DE\u751F\u6210\u7684\u503C\u3002\u76EE\u524D\u4E3A\u6B62\u53EA\u6709\u9762\u5411JDK 1.4\u7684Oracle 10g\u9A71\u52A8\u652F\u6301\u8FD9\u4E00\u7B56\u7565\u3002\u56E0\u4E3AOracle\u9A71\u52A8\u7A0B\u5E8F\u7684\u4E00\u4E2Abug\uFF0C\u8FD9\u4E9B\u63D2\u5165\u8BED\u53E5\u7684\u6CE8\u91CA\u88AB\u5173\u95ED\u4E86\u3002

#		**********************************************************************************************************
#		5.1.2.2.2. Hi/lo algorithm
#		**********************************************************************************************************

title5-1-2-2-2 = 5.1.2.2.2. Hi/lo \u7B97\u6CD5
p5-1-2-2-2-1 = hilo\u548Cseqhilo\u63D0\u4F9B\u4E86hi/lo\u7B97\u6CD5\u7684\u4E24\u79CD\u5B9E\u73B0\u3002\u7B2C\u4E00\u79CD\u5B9E\u73B0\u9700\u8981\u4E00\u4E2A\u7279\u6B8A\u7684\u6570\u636E\u8868\u6765\u4FDD\u5B58\u4E0B\u4E00\u4E2A"hi"\u7684\u503C\u3002\u7B2C\u4E8C\u79CD\u5B9E\u73B0\u4F7F\u7528\u4E00\u4E2AOracle\u98CE\u683C\u7684\u5E8F\u5217\uFF08\u5728\u88AB\u652F\u6301\u7684\u60C5\u51B5\u4E0B\uFF09\u3002
p5-1-2-2-2-2 = \u4E0D\u5E78\u7684\u662F\uFF0C\u4F60\u5728\u4E3AHibernate\u81EA\u884C\u63D0\u4F9BConnection\u65F6\u65E0\u6CD5\u4F7F\u7528hilo\u3002\u5F53Hibernate\u4F7F\u7528JTA\u83B7\u53D6\u5E94\u7528\u670D\u52A1\u5668\u7684\u6570\u636E\u6E90\u8FDE\u63A5\u65F6,\u4F60\u5FC5\u987B\u6B63\u786E\u5730\u914D\u7F6E<code>hibernate.transaction.manager_lookup_class</code>\u3002

#		**********************************************************************************************************
#		5.1.2.2.3. UUID algorithm
#		**********************************************************************************************************

title5-1-2-2-3 = 5.1.2.2.3. UUID \u7B97\u6CD5
p5-1-2-2-3-1 = UUID\u5305\u62EC: IP\u5730\u5740\uFF0CJVM\u7684\u542F\u52A8\u65F6\u95F4\uFF08\u7CBE\u786E\u52301/4\u79D2\uFF09\uFF0C\u7CFB\u7EDF\u65F6\u95F4\u548C\u4E00\u4E2A\u8BA1\u6570\u5668\u503C\uFF08\u5728JVM\u4E2D\u552F\u4E00\uFF09\u3002 \u5728Java\u4EE3\u7801\u4E2D\u4E0D\u53EF\u80FD\u83B7\u5F97MAC\u5730\u5740\u6216\u8005\u5185\u5B58\u5730\u5740\uFF0C\u6240\u4EE5\u8FD9\u5DF2\u7ECF\u662F\u6211\u4EEC\u5728\u4E0D\u4F7F\u7528JNI\u7684\u524D\u63D0\u4E0B\u7684\u80FD\u505A\u7684\u6700\u597D\u5B9E\u73B0\u4E86\u3002

#		**********************************************************************************************************
#		5.1.2.2.4. Identity columns and sequences
#		**********************************************************************************************************

title5-1-2-2-4 = 5.1.2.2.4. \u6807\u8BC6\u5B57\u6BB5\u548C\u5E8F\u5217
p5-1-2-2-4-1 = \u90A3\u4E9B\u652F\u6301\u6807\u8BC6\u7B26\u5B57\u6BB5\u7684\u6570\u636E\u5E93 (DB2, MySQL, Sybase, MS SQL), \u4F60\u53EF\u4EE5\u4F7F\u7528identity\u751F\u6210\u4E3B\u952E\u3002 \u4E8E\u5185\u90E8\u652F\u6301\u5E8F\u5217\u7684\u6570\u636E\u5E93(DB2, Oracle, PostgreSQL, Interbase, McKoi, SAP DB) \u4F60\u53EF\u4EE5\u4F7F\u7528sequence\u98CE\u683C\u7684\u5173\u952E\u5B57\u751F\u6210\u3002\u8FD9\u4E24\u79CD\u65B9\u5F0F\u5BF9\u4E8E\u63D2\u5165\u4E00\u4E2A\u65B0\u7684\u5BF9\u8C61\u90FD\u9700\u8981\u4E24\u6B21SQL\u67E5\u8BE2\u3002\u4F8B\u5982:
p5-1-2-2-4-2 = \u5BF9\u4E8E\u8DE8\u5E73\u53F0\u5F00\u53D1\uFF0Cnative\u5C06\u4F1A\u6839\u636E\u5E95\u5C42\u6570\u636E\u5E93\u7684\u529F\u80FD\u52A8\u6001\u7684\u9009\u62E9\u4F7F\u7528identity, sequence\u6216hilo\u7B56\u7565\u3002

#		**********************************************************************************************************
#		5.1.2.2.5. Assigned identifiers
#		**********************************************************************************************************

title5-1-2-2-5 = 5.1.2.2.5. \u7A0B\u5E8F\u5206\u914D\u7684\u6807\u8BC6\u7B26
p5-1-2-2-5-1 = \u5982\u679C\u4F60\u9700\u8981\u5E94\u7528\u7A0B\u5E8F\u5206\u914D\u4E00\u4E2A\u6807\u793A\u7B26\uFF08\u800C\u975EHibernate\u6765\u751F\u6210\uFF09\uFF0C\u4F60\u53EF\u4EE5\u4F7F\u7528assigned \u751F\u6210\u5668\u3002\u8FD9\u79CD\u7279\u6B8A\u7684\u751F\u6210\u5668\u4F1A\u4F7F\u7528\u5DF2\u7ECF\u5206\u914D\u7ED9\u5BF9\u8C61\u7684\u6807\u8BC6\u7B26\u5C5E\u6027\u7684\u6807\u8BC6\u7B26\u503C\u3002\u8FD9\u4E2A\u751F\u6210\u5668\u4F7F\u7528\u4E00\u4E2A\u81EA\u7136\u952E\uFF08natural key\uFF0C\u6709\u5546\u4E1A\u610F\u4E49\u7684\u5217\uFF0D\u8BD1\u6CE8\uFF09\u4F5C\u4E3A\u4E3B\u952E\uFF0C\u800C\u4E0D\u662F\u4F7F\u7528\u4E00\u4E2A\u4EE3\u7406\u952E\uFF08 surrogate key\uFF0C\u6CA1\u6709\u5546\u4E1A\u610F\u4E49\u7684\u5217\uFF0D\u8BD1\u6CE8\uFF09\u3002\u5982\u679C\u6CA1\u6709\u6307\u5B9A<code>@GeneratedValue</code> \u6216\u8005 &lt;generator&gt; \u5143\u7D20\u65F6\u8FD9\u662F\u9ED8\u8BA4\u4F7F\u7528\u7684\u751F\u6210\u5668\u3002
p5-1-2-2-5-2 = T\u5F53\u9009\u62E9assigned\u751F\u6210\u5668\u65F6\uFF0C\u9664\u975E\u6709\u4E00\u4E2Aversion\u6216timestamp\u5C5E\u6027\uFF0C\u6216\u8005\u4F60\u5B9A\u4E49\u4E86<code>Interceptor.isUnsaved()</code>\uFF0C\u5426\u5219\u9700\u8981\u8BA9Hiberante\u4F7F\u7528 unsaved-value="undefined"\uFF0C\u5F3A\u5236Hibernatet\u67E5\u8BE2\u6570\u636E\u5E93\u6765\u786E\u5B9A\u4E00\u4E2A\u5B9E\u4F8B\u662F\u77AC\u65F6\u7684\uFF08transient\uFF09 \u8FD8\u662F\u8131\u7BA1\u7684\uFF08detached\uFF09\u3002

#		**********************************************************************************************************
#		5.1.2.2.6. Primary keys assigned by triggers
#		**********************************************************************************************************

title5-1-2-2-6 = 5.1.2.2.6. \u89E6\u53D1\u5668\u5B9E\u73B0\u7684\u4E3B\u952E\u751F\u6210\u5668
p5-1-2-2-6-1 = \u4EC5\u4EC5\u7528\u4E8E\u9057\u7559\u7684schema\u4E2D (Hibernate\u4E0D\u80FD\u4F7F\u7528\u89E6\u53D1\u5668\u751F\u6210DDL)\u3002
p5-1-2-2-6-2 = \u5728\u4E0A\u9762\u7684\u4F8B\u5B50\u4E2D\uFF0C\u7C7B\u5B9A\u4E49\u4E86\u4E00\u4E2A\u547D\u540D\u4E3AsocialSecurityNumber\u7684\u552F\u4E00\u503C\u5C5E\u6027\uFF0C\u5B83\u662F\u4E00\u4E2A\u81EA\u7136\u952E\uFF08natural key\uFF09\uFF0C\u547D\u540D\u4E3Aperson_id\u7684\u4EE3\u7406\u952E\uFF08surrogate key\uFF09 \u7684\u503C\u7531\u89E6\u53D1\u5668\u751F\u6210\u3002

#		**********************************************************************************************************
#		5.1.2.2.7. Identity copy (foreign generator)
#		**********************************************************************************************************

title5-1-2-2-7 = 5.1.2.2.7. \u8EAB\u4EFD\u590D\u5236(\u5916\u952E\u751F\u6210\u5668)
p5-1-2-2-7-1 = \u6700\u540E\uFF0C \u4F60\u53EF\u4EE5\u4F7F\u7528Hibernate\u4ECE\u53E6\u4E00\u4E2A\u5173\u8054\u7684\u5B9E\u4F53\u4E2D\u62F7\u8D1D\u6807\u8BC6\u7B26\u3002 \u5728Hibernate\u672F\u8BED\u4E2D\uFF0C\u88AB\u79F0\u4E3A\u5916\u952E\u751F\u6210\u5668\uFF0C \u4F46\u662FJPA \u6620\u5C04 \u8BFB\u8D77\u6765\u66F4\u52A0\u7684\u597D\u5E76\u4E14\u9F13\u52B1\u4F7F\u7528\u8FD9\u4E2A\u540D\u79F0\u3002
p5-1-2-2-7-2 = \u6216\u8005
p5-1-2-2-7-3 = \u5728 <code>hbm.xml</code>\u4E2D:

#		**********************************************************************************************************
#		5.1.2.3. Enhanced identifier generators
#		**********************************************************************************************************

title5-1-2-3 = 5.1.2.3. \u589E\u5F3A\u7684\u6807\u8BC6\u7B26\u751F\u6210\u5668
p5-1-2-3-1 = \u4ECE\u53D1\u5E03\u76843.2.3\u5F00\u59CB\uFF0C\u6709\u4E24\u79CD\u751F\u6210\u5668\u4EE3\u8868\u4E86\u5BF9\u4E3B\u952E\u751F\u6210\u5668\u7684\u4E24\u4E2A\u65B9\u9762\u7684\u91CD\u65B0\u601D\u8003\u3002 \u7B2C\u4E00\u4E2A\u65B9\u9762\u662F\u6570\u636E\u5E93\u7684\u53EF\u79FB\u690D\u6027\uFF1B \u7B2C\u4E8C\u662F\u4F18\u5316\uFF0C\u4F18\u5316\u610F\u5473\u7740\u4F60\u4E0D\u9700\u8981\u6BCF\u6B21\u751F\u6210\u65B0\u7684\u4E3B\u952E\u90FD\u9700\u8981\u67E5\u8BE2\u6570\u636E\u5E93\u3002\u8FD9\u4E24\u4E2A\u751F\u6210\u5668\u7684\u76EE\u7684\u662F\u53D6\u4EE3\u4E0A\u9762\u63CF\u8FF0\u7684\u4ECE3.3.X\u7248\u672C\u5F00\u59CB\u7684\u4E00\u4E9B\u751F\u6210\u5668\u3002
p5-1-2-3-2 = \u7B2C\u4E00\u4E2A\u751F\u6210\u5668\u662F <code>org.hibernate.id.enhanced.SequenceStyleGenerator</code>\u7528\u4E8E\u66FF\u4EE3sequence\u751F\u6210\u5668\uFF0C\u5E76\u4E14\u6BD4native\u6709\u66F4\u597D\u7684\u53EF\u79FB\u690D\u6027\u3002 \u56E0\u4E3Anative\u751F\u6210\u5668\u5728identity\u548Csequence\u4E4B\u95F4\u505A\u9009\u62E9\uFF0C\u8FD9\u4E24\u4E2A\u6709\u5F88\u5927\u7684\u8BED\u4E49\u5DEE\u522B\uFF0C\u5728\u8003\u8651\u5E94\u7528\u7684\u53EF\u79FB\u690D\u6027\u65B9\u9762\u4F1A\u5BFC\u81F4\u4E00\u4E9B\u5FAE\u5999\u7684\u95EE\u9898\u3002\u7136\u800C<code>org.hibernate.id.enhanced.SequenceStyleGenerator</code>\u4EE5\u4E0D\u540C\u7684\u65B9\u5F0F\u5B9E\u73B0\u53EF\u79FB\u690D\u6027\u3002\u4ED6\u9009\u62E9\u4E00\u4E2A\u8868\u6216\u8005\u4E00\u4E2A\u5E8F\u5217\u6765\u5728\u6570\u636E\u5E93\u91CC\u9762\u5B58\u50A8\u5B83\u7684\u9012\u589E\u503C\uFF0C\u8FD9\u53D6\u51B3\u4E8E\u6240\u4F7F\u7528\u7684\u65B9\u8A00\u7684\u529F\u80FD\u3002\u5B83\u548Cnative\u4E4B\u95F4\u7684\u533A\u522B\u662F\u57FA\u4E8E\u8868\u7684\u5B58\u50A8\u6216\u8005\u57FA\u4E8E\u5E8F\u5217\u7684\u5B58\u50A8\u90FD\u6709\u76F8\u540C\u7684\u8BED\u4E49\u3002\u5B9E\u9645\u4E0A\uFF0C\u5E8F\u5217\u6B63\u662FHibernate\u6A21\u4EFF\u7684\u57FA\u4E8E\u8868\u7684\u751F\u6210\u5668\u3002\u8FD9\u79CD\u751F\u6210\u5668\u6709\u4E00\u4E9B\u914D\u7F6E\u53C2\u6570\uFF1A
li5-1-2-3-1-1 = <code>sequence_name</code> (\u53EF\u9009\u7684\uFF0C \u9ED8\u8BA4\u662Fhibernate_sequence): \u88AB\u4F7F\u7528\u7684\u5E8F\u5217\u6216\u8005\u8868\u7684\u540D\u79F0\u3002
li5-1-2-3-1-2 = <code>initial_value</code> (\u53EF\u9009\u7684, \u9ED8\u8BA4\u662F 1): \u4ECE\u5E8F\u5217\u6216\u8005\u8868\u4E2D\u68C0\u7D22\u7684\u521D\u59CB\u503C\u3002\u5728\u5E8F\u5217\u4E2D\uFF0C\u5B83\u7C7B\u4F3C\u4E8E\u201CSTARTS WITH\u201D\u6761\u6B3E\u3002
li5-1-2-3-1-3 = <code>increment_size</code> (\u53EF\u9009\u7684 - \u9ED8\u8BA4\u662F  1): \u5B50\u5E8F\u5217\u8C03\u7528\u5E8F\u5217\u6216\u8005\u8868\u65F6\u7684\u5DEE\u503C\uFF08\u9012\u589E\u91CF\uFF09\u3002\u5728\u5E8F\u5217\u6761\u4EF6\u4E0B\u7C7B\u4F3C\u4E8E\u201CINCREMENT BY\u201D\u6761\u6B3E\u3002
li5-1-2-3-1-4 = <code>force_table_use</code> (\u53EF\u9009\u7684 - \u9ED8\u8BA4\u662F  false): \u51B3\u5B9A\u662F\u5426\u6211\u4EEC\u5E94\u8BE5\u5F3A\u5236\u4F7F\u7528\u8868\u4F5C\u4E3A\u540E\u53F0\u7ED3\u6784\u5C3D\u7BA1\u65B9\u8A00\u6709\u53EF\u80FD\u652F\u6301\u5E8F\u5217\u3002
li5-1-2-3-1-5 = <code>value_column</code> (\u53EF\u9009\u7684 - \u9ED8\u8BA4\u662F next_val): \u53EA\u5BF9\u8868\u7ED3\u6784\u53EF\u7528\uFF0C\u5728\u8868\u4E2D\u7528\u4E8E\u4FDD\u5B58\u503C\u7684\u5217\u540D\u3002
li5-1-2-3-1-6 = <code>prefer_sequence_per_entity</code> (\u53EF\u9009\u7684 - \u9ED8\u8BA4\u662F false): \u51B3\u5B9A\u6211\u4EEC\u662F\u5426\u5E94\u8BE5\u6839\u636E\u4ED6\u7684\u540D\u5B57\u6765\u4E3A\u73B0\u5728\u5171\u4EAB\u751F\u6210\u5668\u7684\u5B9E\u4F53\u521B\u5EFA\u65B0\u7684\u5E8F\u5217\u3002
li5-1-2-3-1-7 = <code>sequence_per_entity_suffix</code> (\u53EF\u9009\u7684 - \u9ED8\u8BA4\u662F  _SEQ): \u4E13\u7528\u5E8F\u5217\u7684\u540E\u7F00\u540D\u3002
li5-1-2-3-1-8 =  optimizer (\u53EF\u9009\u7684 - \u9ED8\u8BA4\u662F none): See Section 5.1.2.3.1, \u201C\u4F18\u5316\u6807\u8BC6\u7B26\u751F\u6210\u5668\u201D
p5-1-2-3-3 = \u7B2C\u4E8C\u79CD\u65B0\u7684\u751F\u6210\u5668\u662F <code>org.hibernate.id.enhanced.TableGenerator</code>, \u7528\u4E8E\u4EE3\u66FFTABLE\u751F\u6210\u5668\uFF0C\u5C3D\u7BA1\u5B83\u7684\u529F\u80FD\u66F4\u7C7B\u4F3C\u4E8E<code>org.hibernate.id.MultipleHiLoPerTableGenerator</code>, \u53E6\u5916\uFF0C \u5229\u7528\u63D2\u4EF6\u5316\u4F18\u5316\u7684\u6982\u5FF5\u5BF9 <code>org.hibernate.id.MultipleHiLoPerTableGenerator</code> \u4E8C\u6B21\u5B9E\u73B0\u3002\u672C\u8D28\u4E0A\u8FD9\u4E2A\u751F\u6210\u5668\u5B9A\u4E49\u4E86\u4E00\u4E2A\u8868\u901A\u8FC7\u4F7F\u7528\u660E\u663E\u7684\u6709\u952E\u503C\u7684\u884C\u6765\u5B58\u50A8\u4E0D\u540C\u7684\u589E\u91CF\u503C\u3002\u914D\u7F6E\u53C2\u6570\u5982\u4E0B\uFF1A
li5-1-2-3-2-1 = <code>table_name</code> (\u53EF\u9009\u7684 - \u9ED8\u8BA4\u662F hibernate_sequences): \u4F7F\u7528\u7684\u8868\u540D\u3002
li5-1-2-3-2-2 = <code>value_column_name</code> (\u53EF\u9009\u7684 - \u9ED8\u8BA4\u662F next_val): \u8868\u4E2D\u7528\u4E8E\u4FDD\u5B58\u503C\u7684\u5217\u7684\u540D\u79F0\u3002
li5-1-2-3-2-3 = <code>segment_column_name</code> (\u53EF\u9009\u7684 - \u9ED8\u8BA4\u662F  sequence_name): \u8868\u4E2D\u7528\u4E8E\u4FDD\u5B58\u201C\u5206\u9694\u952E\u201D\u7684\u5217\u7684\u540D\u5B57\u3002\u8FD9\u4E2A\u503C\u7528\u4E8E\u786E\u5B9A\u4F7F\u7528\u54EA\u4E00\u4E2A\u589E\u91CF\u503C\u3002
li5-1-2-3-2-4 = <code>segment_value</code> (\u53EF\u9009\u7684 - \u9ED8\u8BA4\u662F  default): \u6211\u4EEC\u60F3\u4ECE\u4E2D\u4E3A\u751F\u6210\u5668\u83B7\u53D6\u589E\u91CF\u503C\u7684\u6BB5\u7684\u503C\u3002
li5-1-2-3-2-5 = <code>segment_value_length</code> (\u53EF\u9009\u7684 - \u9ED8\u8BA4\u662F  255): \u7528\u4E8E\u6A21\u5F0F\u751F\u6210\uFF0C\u521B\u5EFA\u8FD9\u4E2A\u6BB5\u952E\u5217\u5217\u7684\u5927\u5C0F\u3002
li5-1-2-3-2-6 = <code>initial_value</code> (\u53EF\u9009\u7684 - \u9ED8\u8BA4\u662F  1): \u4ECE\u8868\u4E2D\u68C0\u7D22\u5230\u7684\u521D\u59CB\u503C\u3002
li5-1-2-3-2-7= <code>increment_size</code> (\u53EF\u9009\u7684 - \u9ED8\u8BA4\u662F  1): \u540E\u7EED\u8C03\u7528\u7684\u5DEE\u503C\uFF08\u589E\u91CF\uFF09\u3002
li5-1-2-3-2-8 = <code>optimizer</code> (\u53EF\u9009\u7684 - \u9ED8\u8BA4\u662F  5.1.2.3. \u589E\u5F3A\u7684\u6807\u8BC6\u7B26\u751F\u6210\u5668): See <a href="#c5-1-2-3-1">Section 5.1.2.3.1, \u201C\u4F18\u5316\u6807\u8BC6\u7B26\u751F\u6210\u5668\u201D</a>.

#		**********************************************************************************************************
#		5.1.2.3.1. Identifier generator optimization
#		**********************************************************************************************************

title5-1-2-3-1 = 5.1.2.3.1. \u4F18\u5316\u6807\u8BC6\u7B26\u751F\u6210\u5668
p5-1-2-3-1-1 = \u90A3\u4E9B\u5728\u6570\u636E\u5E93\u4E2D\u5B58\u50A8\u503C\u7684\u6807\u793A\u7B26\u751F\u6210\u5668\uFF0C\u6BCF\u6B21\u751F\u6210\u4E00\u4E2A\u65B0\u7684\u6807\u793A\u7B26\u90FD\u53BB\u8BBF\u95EE\u6570\u636E\u5E93\u662F\u5F88\u4F4E\u6548\u7684\uFF0C\u53CD\u800C\u4F60\u53EF\u4EE5\u5728\u5185\u5B58\u4E2D\u4FDD\u5B58\u4E00\u4E9B\u5E76\u4E14\u53EA\u5728\u5185\u5B58\u4E2D\u7684\u503C\u88AB\u7528\u5B8C\u65F6\u5728\u53D6\u8BBF\u95EE\u6570\u636E\u5E93\u3002\u8FD9\u662F\u53EF\u63D2\u62D4\u7684\u4F18\u5316\u5668\u7684\u4F5C\u7528\u3002\u76EE\u524D\u53EA\u6709\u8FD9\u4E24\u4E2A\u589E\u5F3A\u7684\u751F\u6210\u5668\u652F\u6301\u8FD9\u4E2A\u64CD\u4F5C\u3002(<a href="#c5-1-2-3">Section 5.1.2.3, \u201C\u589E\u5F3A\u7684\u6807\u8BC6\u7B26\u751F\u6210\u5668\u201D</a>
li5-1-2-3-1-1-1 = <code>none</code> (\u901A\u5E38\u5982\u679C\u6CA1\u6709\u6307\u5B9A\u4F18\u5316\u5668\u8FD9\u662F\u9ED8\u8BA4\u7684): \u4E0D\u4F1A\u6267\u884C\u4EFB\u4F55\u7684\u4F18\u5316\uFF0C\u6BCF\u6B21\u6BCF\u4E2A\u8BF7\u6C42\u90FD\u8981\u8BBF\u95EE\u6570\u636E\u5E93\u3002 
li5-1-2-3-1-1-2 = <code>hilo</code>: \u4F7F\u7528hi/lo\u7B97\u6CD5\u5728\u6570\u636E\u5E93\u4E2D\u68C0\u7D22\u503C\u3002\u5728\u6570\u636E\u5E93\u4E2D\u7531\u8FD9\u4E2A\u4F18\u5316\u5668\u4EA7\u751F\u7684\u503C\u662F\u8FDE\u7EED\u7684\u3002\u5728\u6570\u636E\u5E93\u4E2D\u8FD9\u4E2A\u8FD9\u4E2A\u4F18\u5316\u5668\u68C0\u7D22\u5230\u7684\u503C\u8868\u660E\u4E86\u201C\u7EC4\u53F7\u201D\u3002increment_size \u4E58\u4EE5\u5185\u5B58\u4E2D\u7684\u8FD9\u4E2A\u503C\u4F5C\u4E3A\u201Chi\u503C\u201D\u3002
li5-1-2-3-1-1-3 = <code>pooled</code>: \u548Chilo\u4E00\u6837\uFF0C\u8FD9\u4E2A\u4F18\u5316\u5668\u4E5F\u662F\u4F01\u56FE\u51CF\u5C11\u8BBF\u95EE\u6570\u636E\u5E93\u7684\u6B21\u6570\u3002 \u7136\u800C\u6211\u4EEC\u53EA\u4E3A\u201C\u4E0B\u4E00\u7EC4\u201D\u5B58\u50A8\u5176\u521D\u59CB\u503C\uFF0C\u800C\u4E0D\u662F\u4F7F\u7528\u5185\u5B58\u5206\u7EC4\u7B97\u6CD5\u5206\u914D\u4E00\u7EC4\u8FDE\u7EED\u7684\u6570\u503C\u7EC4\u3002\u8FD9\u91CC\u7684increment_size \u53D6\u81EA\u6570\u636E\u5E93\u3002
 
#		**********************************************************************************************************
#		5.1.2.4. Partial identifier generation
#		**********************************************************************************************************

title5-1-2-4 =  5.1.2.4. \u5C40\u90E8\u6807\u8BC6\u7B26\u751F\u6210\u5668
p5-1-2-4-1 = Hibernate\u652F\u6301\u4E3A\u4E00\u4E9B\u6807\u8BC6\u5C5E\u6027\u81EA\u52A8\u751F\u6210\u503C\uFF0C\u53EA\u9700\u8981\u5728\u4E00\u4E2A\u6216\u8005\u591A\u4E2Aid\u5C5E\u6027\u4E0A\u4F7F\u7528 @GenerateValue\u6CE8\u89E3\u3002
wc5-1-2-4-1 = Hibernate\u56E2\u961F\u4E00\u76F4\u8BA4\u4E3A\u8FD9\u79CD\u60F3\u6CD5\u6709\u672C\u8D28\u7684\u9519\u8BEF\u3002\u5728\u4F7F\u7528\u6B64\u7279\u6027\u4E4B\u524D\uFF0C \u8BF7\u5C3D\u52AA\u529B\u7684\u4FEE\u6539\u6570\u636E\u6A21\u578B\u3002
p5-1-2-4-2 = \u4E5F\u53EF\u4EE5\u5728\u4E00\u4E2A <code>@EmbeddedId</code> \u7684\u7C7B\u4E2D\u751F\u6210\u5C5E\u6027\u3002
 
#		**********************************************************************************************************
#		5.1.3. Optimistic locking properties (optional)
#		**********************************************************************************************************

title5-1-3 = 5.1.3. \u4E50\u89C2\u9501\u5C5E\u6027\uFF08\u53EF\u9009\uFF09
p5-1-3-1 = \u5F53\u4F7F\u7528\u957F\u4E8B\u52A1\u6216\u8005\u8DE8\u6570\u636E\u5E93\u4E8B\u52A1\u7684\u4F1A\u8BDD\uFF0C\u5B58\u50A8\u7248\u672C\u6570\u636E\u662F\u5F88\u6709\u7528\u7684\uFF0C \u4ED6\u53EF\u4EE5\u4FDD\u8BC1\u5982\u679C\u6709\u4E24\u4E2A\u4F1A\u8BDD\u540C\u65F6\u66F4\u65B0\u4E00\u4E2A\u5B9E\u4F53\u7684\u65F6\u5019\uFF0C\u6700\u540E\u63D0\u4EA4\u7684\u4FEE\u6539\u5C06\u4F1A\u88AB\u544A\u77E5\u800C\u4E0D\u662F\u76F4\u63A5\u8986\u76D6\u5176\u4ED6\u4F1A\u8BDD\u5DF2\u7ECF\u5B8C\u6210\u7684\u5DE5\u4F5C\u3002\u4ED6\u4FDD\u8BC1\u4E86\u4E00\u4E9B\u72EC\u7ACB\u6027\u4E5F\u540C\u6837\u6709\u597D\u7684\u4F38\u7F29\u6027\u5E76\u4E14\u5728\u9700\u8981\u9891\u7E41\u8BFB\u5199\u7684\u60C5\u51B5\u4E0B\u6709\u5F88\u597D\u7684\u6027\u80FD\u3002
p5-1-3-2 = \u53EF\u4EE5\u4F7F\u7528\u4E24\u79CD\u65B9\u5F0F\uFF1A\u4E00\u4E2A\u4E13\u95E8\u7684\u7248\u672C\u53F7\u6216\u8005\u65F6\u95F4\u6233\u3002
p5-1-3-3 = \u8FD9\u4E2A\u7248\u672C\u53F7\u6216\u8005\u65F6\u95F4\u6233\u5C5E\u6027\u4E0D\u80FD\u662FNUll\u6216\u8005\u6E38\u79BB\u7684\u5B9E\u4F8B\u3002Hibernate\u5C06\u4F1A\u628A\u6240\u6709\u53D1\u73B0\u7684\u4EFB\u4F55\u6CA1\u6709\u7248\u672C\u53F7\u6216\u8005\u65F6\u95F4\u6233\u7684\u5B9E\u4F8B\u4F5C\u4E3A\u77AC\u6001\uFF0C\u4E0D\u7BA1\u6709\u6CA1\u6709\u6307\u5B9A\u5176\u4ED6\u7684unsaved-value\u7B56\u7565\u3002\u5728Hibernate\u4E2D\u58F0\u660E\u4E0D\u53EF\u4E3A\u7A7A\u7684\u7248\u672C\u53F7\u6216\u8005\u65F6\u95F4\u6233\u5C5E\u6027\u662F\u907F\u514D\u91CD\u590D\u4F20\u9012\u7684\u4E00\u79CD\u7B80\u5355\u65B9\u5F0F\u3002\u5BF9\u4E8E\u4F7F\u7528assigned\u7684\u6807\u793A\u7B26\u6216\u8005\u7EC4\u5408\u952E\u7684\u4EBA\u6765\u8BF4\u7279\u522B\u6709\u7528\u3002
 
#		**********************************************************************************************************
#		5.1.3.1. Version number
#		**********************************************************************************************************

title5-1-3-1 = 5.1.3.1. \u7248\u672C\u53F7
p5-1-3-1-1 = \u4F7F\u7528 <code>@Version</code> \u6765\u7ED9\u4E00\u4E2A\u5B9E\u4F53\u52A0\u4E0A\u4E50\u89C2\u9501\u3002:
p5-1-3-1-2 = \u7248\u672C\u5C5E\u6027\u5C06\u4F1A\u88AB\u6620\u5C04\u5230OPTLOCK\u5217\uFF0C \u5B9E\u4F53\u7BA1\u7406\u5668\u5C06\u4F7F\u7528\u5B83\u68C0\u6D4B\u66F4\u65B0\u51B2\u7A81(\u9632\u6B62\u66F4\u65B0\u4E22\u5931\uFF0C \u4F60\u4E5F\u53EF\u80FD\u8D5E\u6210last-commit-wins\u7B56\u7565).
p5-1-3-1-3 = \u7248\u672C\u5217\u53EF\u80FD\u662F\u4E00\u4E2A\u6570\u5B57\u3002  Hibernate\u652F\u6301\u5B9A\u4E49\u548C\u5B9E\u73B0\u4E86 <code>UserVersionType</code>\u7684\u4EFB\u4F55\u7C7B\u578B\u3002
p5-1-3-1-4 = \u5E94\u7528\u7A0B\u5E8F\u5728\u4EFB\u4F55\u60C5\u51B5\u4E0B\u90FD\u4E0D\u53EF\u4EE5\u4FEE\u6539Hibernate\u521B\u5EFA\u7684\u7248\u672C\u53F7\u3002 \u82E5\u60F3\u4EBA\u4E3A\u7684\u589E\u52A0\u7248\u672C\u53F7\uFF0C\u53C2\u8003Hibernate\u5B9E\u4F53\u7BA1\u7406\u7684\u53C2\u8003\u6587\u6863 <code>LockModeType.OPTIMISTIC_FORCE_INCREMENT</code>\u6216\u8005 <code>LockModeType.PESSIMISTIC_FORCE_INCREMENT</code>.
p5-1-3-1-5 = \u5982\u679C\u7248\u672C\u53F7\u7531\u6570\u636E\u5E93\u751F\u6210\uFF08\u6BD4\u5982\u901A\u8FC7\u89E6\u53D1\u5668\uFF09, \u8981\u786E\u4FDD\u4F7F\u7528 <code>@org.hibernate.annotations.Generated</code>(GenerationTime.ALWAYS).
p5-1-3-1-6 = \u5728<code>hbm.xml</code>\u4E2D\u58F0\u660E\u7248\u672C\u5C5E\u6027\u5982\u4E0B\uFF1A
td5-1-3-1-1-1 = <code>column</code> (\u53EF\u9009 - -\u9ED8\u8BA4\u5C5E\u6027\u540D): \u4FDD\u5B58\u7248\u672C\u53F7\u7684\u5217\u7684\u540D\u5B57\u3002
td5-1-3-1-1-2 = <code>name</code>: \u6301\u4E45\u5316\u7C7B\u7684\u5C5E\u6027\u540D\u3002
td5-1-3-1-1-3 = <code>type</code> (\u53EF\u9009 - \u9ED8\u8BA4\u662Finteger): \u7248\u672C\u53F7\u6570\u636E\u7C7B\u578B\u3002
td5-1-3-1-1-4 = <code>access</code> (\u53EF\u9009 - \u9ED8\u8BA4\u662Fproperty): Hibernate\u5C5E\u6027\u503C\u7684\u5B58\u53D6\u7B56\u7565\u3002
td5-1-3-1-1-5 = <code>unsaved-value</code> (\u53EF\u9009 - \u9ED8\u8BA4\u662Fundefined): \u4E00\u4E2A\u5C5E\u6027\u503C\u6765\u8868\u660E\u8FD9\u4E2A\u5B9E\u4F8B\u662F\u65B0\u521B\u5EFA\u7684\uFF08\u672A\u4FDD\u5B58\u7684\uFF09, \u7528\u6765\u548C\u5728\u4E4B\u524D\u7684Session\u4E2D\u4FDD\u5B58\u6216\u83B7\u53D6\u7684\u5DF2\u5904\u4E8E\u6E38\u79BB\u72B6\u6001\u7684\u5B9E\u4F8B\u533A\u5206\u3002Undefined\u6307\u660E\u5E94\u8BE5\u4F7F\u7528\u6807\u793A\u7B26\u5C5E\u6027\u503C\u3002
td5-1-3-1-1-6 = <code>generated</code> (\u53EF\u9009 - \u9ED8\u8BA4\u662F never): \u6307\u660E\u7248\u672C\u5C5E\u6027\u7684\u503C\u7531\u6570\u636E\u5E93\u751F\u6210\u3002 \u66F4\u591A\u4FE1\u606F\u53C2\u8003 <a href="#c5-5">\u751F\u6210\u7684\u5C5E\u6027</a> \u3002
td5-1-3-1-1-7 = <code>insert</code> (\u53EF\u9009 - \u9ED8\u8BA4\u662F true): \u6307\u660E\u8FD9\u4E2A\u7248\u672C\u5217\u662F\u5426\u5E94\u8BE5\u5305\u542B\u5728insert\u8BED\u53E5\u4E2D\u3002\u5982\u679C\u6570\u636E\u5E93\u5217\u5B9A\u4E49\u4E86\u9ED8\u8BA4\u503C\u4E3A0 \u90A3\u4E48\u53EF\u4EE5\u8BBE\u7F6E\u4E3Afalse\u3002
 
#		**********************************************************************************************************
#		5.1.3.2. Timestamp
#		**********************************************************************************************************

title5-1-3-2 = 5.1.3.2. \u65F6\u95F4\u6233
p5-1-3-2-1 = \u6216\u8005\uFF0C \u4F60\u53EF\u4EE5\u4F7F\u7528\u65F6\u95F4\u6233\u3002 \u65F6\u95F4\u6233\u662F\u4E50\u89C2\u9501\u7684\u4E00\u79CD\u6BD4\u8F83\u4E0D\u5B89\u5168\u7684\u5B9E\u73B0\u65B9\u5F0F\u3002\u7136\u800C\uFF0C\u6709\u65F6\u5019\u5E94\u7528\u7A0B\u5E8F\u53EF\u80FD\u5728\u5176\u4ED6\u5730\u65B9\u4F7F\u7528\u65F6\u95F4\u6233\u3002
p5-1-3-2-2 = \u53EA\u9700\u8981\u7B80\u5355\u7684\u628ADate\u6216\u8005Calendar\u7C7B\u578B\u7684\u5C5E\u6027\u6807\u8BB0\u4E3A<code>@Version</code>.
p5-1-3-2-3 = \u5F53\u4F7F\u7528\u65F6\u95F4\u6233\u7248\u672C\u63A7\u5236\uFF0C \u4F60\u53EF\u4EE5\u901A\u8FC7\u9009\u62E9\u6027\u7684\u7ED9\u5C5E\u6027\u6DFB\u52A0 <code>@org.hibernate.annotations.Source</code>\u6CE8\u89E3\u6765\u544A\u8BC9Hibernate\u4ECEdatabase\u8FD8\u662F\u4ECEJVM\u4E2D\u68C0\u7D22\u65F6\u95F4\u6233\u7684\u503C\u3002 \u53EF\u80FD\u7684\u914D\u7F6E\u4E3A <code>org.hibernate.annotations.SourceType.VM</code> \u548C <code>org.hibernate.annotations.SourceType.DB</code>\u3002\u9ED8\u8BA4\u662F <code>SourceType.DB</code> \u5728\u6CA1\u6709<code>@Source</code>\u6CE8\u89E3\u65F6\u4E5F\u662F\u7528\u9ED8\u8BA4\u503C\u3002
p5-1-3-2-4 = \u548C\u4F7F\u7528\u7248\u672C\u53F7\u4E00\u6837\uFF0C \u65F6\u95F4\u6233\u4E5F\u53EF\u4EE5\u6709\u6570\u636E\u5E93\u800C\u4E0D\u662FHibernate\u751F\u6210\u3002\u4F7F\u7528<code>@org.hibernate.annotations.Generated(GenerationTime.ALWAYS)</code>\u6765\u5B9E\u73B0\u3002
p5-1-3-2-5 = \u5728 <code>hbm.xml</code>\u4E2D\uFF0C\u4F7F\u7528<code>&lt;timestamp&gt;</code> \u5143\u7D20:
td5-1-3-2-1-1 = <code>column</code> (\u53EF\u9009 - \u9ED8\u8BA4\u662F\u5C5E\u6027\u540D): \u4FDD\u5B58\u65F6\u95F4\u6233\u7684\u5217\u540D\u3002
td5-1-3-2-1-2 = <code>name</code>: \u6301\u4E45\u5316\u7C7B\u4E2D\u7684\u7C7B\u578B\u4E3ADate\u6216\u8005Calendar\u7684javaBean\u683C\u5F0F\u7684\u5C5E\u6027\u540D\u3002
td5-1-3-2-1-3 = <code>access</code> (\u53EF\u9009 - \u9ED8\u8BA4\u662F property): Hibernate\u83B7\u53D6\u5C5E\u6027\u503C\u7684\u7B56\u7565\u3002
td5-1-3-2-1-4 = <code>unsaved-value</code> (\u53EF\u9009 - \u9ED8\u8BA4\u662F null): \u4E00\u4E2A\u7248\u672C\u5C5E\u6027\u503C\u6765\u8868\u660E\u8FD9\u4E2A\u5B9E\u4F8B\u65F6\u65B0\u521B\u5EFA\u7684\uFF08\u672A\u4FDD\u5B58\u7684\uFF09\uFF0C\u7528\u6765\u548C\u6E38\u79BB\u72B6\u6001\u7684\u5B9E\u4F8B\u533A\u5206\u3002Undefined\u6307\u660E\u5E94\u8BE5\u4F7F\u7528\u6807\u793A\u7B26\u5C5E\u6027\u503C\u3002
td5-1-3-2-1-5 = <code>source</code> (\u53EF\u9009 -\u9ED8\u8BA4\u662F vm): Hibernate\u5E94\u8BE5\u4ECE\u54EA\u91CC\u68C0\u7D22\u65F6\u95F4\u6233? \u4ECE\u6570\u636E\u5E93\u4E2D\u6216\u8005\u5F53\u524D\u7684JVM\u4E2D? \u57FA\u4E8E\u6570\u636E\u5E93\u7684\u65F6\u95F4\u6233\u4F1A\u6709\u989D\u5916\u7684\u5F00\u9500\uFF0C\u56E0\u4E3AHibernate\u9700\u8981\u8BBF\u95EE\u6570\u636E\u5E93\u4EE5\u786E\u5B9A\u4E0B\u4E00\u4E2A\u503C\u3002\u5728\u96C6\u7FA4\u73AF\u5883\u53EF\u4EE5\u5B89\u5168\u4F7F\u7528\u3002\u4E0D\u662F\u6240\u6709\u7684\u65B9\u8A00\u90FD\u652F\u6301\u4ECE\u6570\u636E\u5E93\u68C0\u7D22\u65F6\u95F4\u6233\u3002\u5728\u4F7F\u7528\u9501\u65F6\u4E5F\u53EF\u80FD\u56E0\u4E3A\u7CBE\u5EA6\u95EE\u9898\u662F\u4E0D\u5B89\u5168\u7684\uFF08\u6BD4\u5982Oracle 8\uFF09\u3002
td5-1-3-2-1-6 = <code>generated</code> (\u53EF\u9009 - \u9ED8\u8BA4\u662F never): \u6307\u660E\u7248\u672C\u5C5E\u6027\u7684\u503C\u7531\u6570\u636E\u5E93\u751F\u6210\u3002 \u66F4\u591A\u4FE1\u606F\u53C2\u8003 5.5 \u201C\u751F\u6210\u7684\u5C5E\u6027\u201D\u3002
nc5-1-3-2-1 = <code>&lt;Timestamp&gt;</code> \u7B49\u4EF7\u4E8E &lt;version type="timestamp"&gt;\u3002 \u5E76\u4E14 &lt;timestamp source="db"&gt; \u7B49\u4EF7\u4E8E&lt;version type="dbtimestamp"&gt;
 
#		**********************************************************************************************************
#		5.1.4. Property
#		**********************************************************************************************************

title5-1-4 = 5.1.4. \u5C5E\u6027
p5-1-4-1 = \u5728\u4E00\u4E2A\u7ED9\u5B9A\u5B9E\u4F53\u4E2D\u4F60\u9700\u8981\u786E\u5B9A\u54EA\u4E9B\u5C5E\u6027\u9700\u8981\u88AB\u6301\u4E45\u5316\u3002\u8FD9\u5728\u6CE8\u89E3\u548C<code>hbm.xml</code> \u6587\u4EF6\u4E2D\u6709\u6240\u4E0D\u540C\u3002
 
#		**********************************************************************************************************
#		5.1.4.1. Property mapping with annotations
#		**********************************************************************************************************

title5-1-4-1 = 5.1.4.1. \u4F7F\u7528\u6CE8\u89E3\u6620\u5C04\u5C5E\u6027
p5-1-4-1-1 = \u5728\u6CE8\u89E3\u7684\u73AF\u5883\u4E2D, \u4E00\u4E2A\u5B9E\u4F53\u7684 \u6240\u6709\u7684\u975E\u9759\u6001\u7684\u975E\u77AC\u6001\u7684\u5C5E\u6027(\u5B57\u6BB5\u6216\u8005\u65B9\u6CD5\u53D6\u51B3\u4E8E\u5B58\u53D6\u7C7B\u578B) \u90FD\u88AB\u8BA4\u4E3A\u662F\u6301\u4E45\u5316\u7684\uFF0C \u9664\u975E\u4F60\u6807\u6CE8\u5B83\u4E3A <code>@Transient</code>\u3002\u4E0D\u7ED9\u5C5E\u6027\u6DFB\u52A0\u6CE8\u89E3\u7B49\u540C\u4E8E\u9002\u5F53\u7684<code>@Basic</code>\u6CE8\u89E3\u3002
p5-1-4-1-2 = <code>@Basic</code> \u5141\u8BB8\u4F60\u6307\u5B9A\u5C5E\u6027\u7684\u6293\u53D6\u7B56\u7565\u3002\u5982\u679C\u8BBE\u7F6E\u4E3ALAZY\uFF0C\u6307\u5B9A\u8BE5\u5C5E\u6027\u5728\u5B9E\u4F8B\u53D8\u91CF\u7B2C\u4E00\u6B21\u88AB\u8BBF\u95EE\u7684\u65F6\u5019\u61D2\u52A0\u8F7D\u3002\u8FD9\u9700\u8981\u6784\u5EFA\u65F6\u5B57\u8282\u7801\u4EEA\u5668\u3002\u5982\u679C\u7C7B\u4E0D\u80FD\u88AB\u611F\u77E5\uFF0C \u5C5E\u6027\u7B49\u7EA7\u7684\u61D2\u52A0\u8F7D\u4F1A\u88AB\u5FFD\u7565\u3002\u9ED8\u8BA4\u662FEAGER\u3002\u4F60\u4E5F\u53EF\u4EE5\u4F7F\u7528<code>@Basic.optional</code> \u6765\u6807\u8BB0\u4E00\u4E2A\u5C5E\u6027\u662F\u4E0D\u53EF\u9009\u7684\u3002\u8FD9\u5C06\u786E\u4FDD\u5E95\u5C42\u7684\u5217\u6570\u4E0D\u4E3Anull\u7684\uFF08\u5982\u679C\u53EF\u80FD\u7684\u8BDD\uFF09\u3002\u6BD4\u8F83\u597D\u7684\u65B9\u5F0F\u662F\u6307\u5B9A<code>@NotNull</code>\u4F5C\u4E3A\u5B9E\u4F53\u9A8C\u8BC1\u3002
p5-1-4-1-3 = \u8BF7\u770B\u4E0B\u9762\u7684\u4F8B\u5B50:
p5-1-4-1-4 = counter\u4E00\u4E2A\u77AC\u6001\u7684\u5B57\u6BB5\uFF0C lengthInMeter\uFF0C\u4E00\u4E2A\u65B9\u6CD5\u6807\u8BB0\u4E3A<code>@Transient</code>, \u5C06\u4F1A\u88ABHibernate\u5FFD\u7565\uFF0C<code>name</code>, <code>length</code>, \u548C <code>firstname</code> \u5C5E\u6027\u88AB\u5F71\u5C04\u4E3A\u6301\u4E45\u5316\u7684\u5E76\u4E14\u662F\u9965\u997F\u52A0\u8F7D(\u5BF9\u4E8E\u7B80\u5355\u5C5E\u6027\u6765\u8BF4\u662F\u9ED8\u8BA4\u7684)\u3002\u5F53\u5B9E\u4F53\u7684\u61D2\u52A0\u8F7D\u5C5E\u6027\u7B2C\u4E00\u6B21\u88AB\u8BBF\u95EE\u65F6\uFF0C  detailedComment\u5C5E\u6027\u4F1A\u4ECE\u6570\u636E\u5E93\u4E2D\u88AB\u6293\u53D6\u51FA\u6765\u3002\u901A\u5E38\u60C5\u51B5\u4E0B\u4E0D\u9700\u8981\u61D2\u52A0\u8F7D\u7B80\u5355\u5C5E\u6027\uFF08\u4E0D\u8981\u4E0E\u61D2\u5173\u8054\u6293\u53D6\u6DF7\u6DC6\uFF09\u3002\u63A8\u8350\u4F7F\u7528JP-QL\u6295\u5F71\u529F\u80FD\uFF08Java\u6301\u4E45\u5316\u67E5\u8BE2\u8BED\u8A00\uFF09\u6216\u8005\u6761\u4EF6\u67E5\u8BE2\u3002
p5-1-4-1-5 = JPA\u652F\u6301HIbernate\u652F\u6301\u7684\u6240\u6709\u57FA\u672C\u7C7B\u578B\u7684\u5C5E\u6027\u6620\u5C04(\u6240\u6709\u7684Java\u57FA\u672C\u7C7B\u578B\uFF0C \u4EE5\u53CA\u4ED6\u4EEC\u5404\u81EA\u7684\u5305\u88C5\u7C7B\u548C\u5E8F\u5217\u5316\u7C7B).Hibernate\u6CE8\u89E3\u521B\u9020\u6027\u7684\u628A\u679A\u4E3E\u6620\u5C04\u4E3A\u4E00\u4E2A\u5E8F\u5217\uFF08\u4FDD\u5B58\u679A\u4E3E\u5E8F\u6570\uFF09\u6216\u8005\u662F\u4E00\u4E2A\u5B57\u7B26\u5217\uFF08\u4FDD\u5B58\u679A\u4E3E\u7684\u5B57\u7B26\u4E32\u8868\u793A\uFF09\uFF1A\u9ED8\u8BA4\u7684\u6301\u4E45\u5316\u8868\u793A\u662F\u5E8F\u5217\uFF0C \u53EF\u4EE5\u901A\u8FC7 <code>@Enumerated</code>\u6CE8\u89E3\u8986\u5199\uFF0C\u5982note\u5C5E\u6027\u7684\u4F8B\u5B50\u90A3\u6837\u3002
p5-1-4-1-6 = \u5728\u7EAF\u7CB9\u7684Java API\u4E2D\uFF0C\u65F6\u95F4\u7684\u7CBE\u5EA6\u6CA1\u6709\u88AB\u5B9A\u4E49\u3002 \u5F53\u5904\u7406\u65F6\u95F4\u6570\u636E\u65F6\uFF0C\u4F60\u5E0C\u671B\u80FD\u591F\u6307\u5B9A\u5728\u6570\u636E\u5E93\u4E2D\u7684\u7CBE\u5EA6\u3002 \u65F6\u95F4\u6570\u636E\u7684\u7CBE\u5EA6\u53EF\u4EE5\u662FDATE, TIME, \u6216 TIMESTAMP (\u4F8B\u5982\uFF1A\u5B9E\u9645\u7684\u65E5\u671F\uFF0C\u53EA\u6709\u65F6\u95F4\uFF0C\u6216\u8005\u4E24\u8005\u90FD\u6709). \u4F7F\u7528<code>@Temporal</code>\u6CE8\u89E3\u6765\u8C03\u6574\u3002
p5-1-4-1-7 = <code>@Lob</code> \u8868\u660E\u5C5E\u6027\u5E94\u8BE5\u6839\u636E\u5B83\u7684\u7C7B\u578B\u88AB\u6301\u4E45\u5316\u4E3ABlob\u6216Clob: java.sql.Clob, Character[], char[] \u548C java.lang.String \u5C06\u4F1A\u88AB\u6301\u4E45\u5316\u4E3A Clob. java.sql.Blob, Byte[], byte[] \u548C Serializable \u7C7B\u578B\u5C06\u4F1A\u88AB\u6301\u4E45\u5316\u4E3ABlob.
p5-1-4-1-8 = \u5982\u679C\u5C5E\u6027\u7C7B\u578B\u5B9E\u73B0\u4E86 <code>java.io.Serializable</code> \u5E76\u4E14\u4E0D\u662F\u57FA\u672C\u7C7B\u578B\uFF0C \u5E76\u4E14\u5C5E\u6027\u9875\u6CA1\u6709\u88AB\u6807\u6CE8\u4E3A<code>@Lob</code>, \u90A3\u4E48\u5C06\u4F1A\u4F7F\u7528 serializable\u7C7B\u578B\u3002
 
#		**********************************************************************************************************
#		5.1.4.1.1. Type
#		**********************************************************************************************************

title5-1-4-1-1 = 5.1.4.1.1. \u7C7B\u578B
p5-1-4-1-1-1 = \u5982\u679C\u6709\u9700\u8981\uFF0C\u4F60\u4E5F\u53EF\u4EE5\u4F7F\u7528 @org.hibernate.annotations.Type\u6765\u624B\u52A8\u7684\u6307\u5B9A\u7C7B\u578B\u548C\u4E00\u4E9B\u53C2\u6570. @Type.type \u53EF\u4EE5\u662F:
li5-1-4-1-1-1-1 = Hibernate\u57FA\u672C\u7C7B\u578B\u7684\u540D\u5B57: integer, string, character, date, timestamp, float, binary, serializable, object, blob\u3002
li5-1-4-1-1-1-2 = Java \u57FA\u672C\u6570\u636E\u7C7B\u578B\u7684\u540D\u5B57: int, float, char, java.lang.String, java.util.Date, java.lang.Integer, java.sql.Clob\u3002
li5-1-4-1-1-1-3 = \u5E8F\u5217\u5316java\u7C7B\u7684\u540D\u5B57\u3002
li5-1-4-1-1-1-4 = \u81EA\u5B9A\u4E49\u7684\u7C7B\u7684\u540D\u5B57: com.illflow.type.MyCustomType\u3002
p5-1-4-1-1-2 = \u5982\u679C\u6CA1\u6709\u6307\u5B9A\u7C7B\u578B, Hibernate \u5C06\u4F1A\u6839\u636E\u503C\u5F97\u7684\u5C5E\u6027\u901A\u8FC7\u53CD\u5C04\u6765\u83B7\u53D6\u6B63\u786E\u7684Hibernate\u7C7B\u578B\u3002Hibernate\u5C06\u4F1A\u6309\u7167\u4E0A\u97622\uFF0C3,4\u7684\u89C4\u5219\uFF0C\u5C1D\u8BD5\u89E3\u6790\u5C5E\u6027\u7684getter\u65B9\u6CD5\u8FD4\u56DE\u7684\u7C7B\u7684\u540D\u5B57\u3002
p5-1-4-1-1-3 = <code>@org.hibernate.annotations.TypeDef</code> \u548C <code>@org.hibernate.annotations.TypeDefs</code> \u5141\u8BB8\u4F60\u58F0\u660E\u7C7B\u578B\u5B9A\u4E49\u3002\u8FD9\u4E2A\u6CE8\u89E3\u53EF\u4EE5\u653E\u5728\u7C7B\u6216\u8005package\u7B49\u7EA7\u3002\u9700\u8981\u6CE8\u610F\uFF0C\u8FD9\u4E9B\u5B9A\u4E49\u5BF9sessionFactory\u6765\u8BF4\u662F\u5168\u5C40\u7684(\u5373\u4F7F\u662F\u5B9A\u4E49\u5728\u7C7B\u4E00\u7EA7\u7684)\u3002\u5982\u679C\u8FD9\u4E2A\u7C7B\u578B\u53EA\u7528\u5728\u4E86\u4E00\u4E2A\u5B9E\u4F53\u4E4B\u4E0A\uFF0C\u4F60\u53EF\u4EE5\u628A\u5B9A\u4E49\u653E\u5728\u5B9E\u4F53\u672C\u8EAB\u4E0A\u3002\u5426\u5219\uFF0C\u6211\u4EEC\u63A8\u8350\u628A\u5B9A\u4E49\u8BBE\u7F6E\u5728\u5305\u7EA7\u522B\u3002\u5728\u4E0B\u9762\u7684\u4F8B\u5B50\u4E2D\uFF0C\u5728\u5904\u7406PhoneNumber\u7684\u5C5E\u6027\u65F6\uFF0C\u6307\u5B9A\u6301\u4E45\u5316\u7B56\u7565\u4E3A\u81EA\u5B9A\u4E49\u7684PhoneNumberType\u6620\u5C04\u7C7B\u578B\u3002 \u7136\u800C\uFF0C\u5176\u4ED6\u7C7B\u7684\u5C5E\u6027\u4E5F\u53EF\u4EE5\u901A\u8FC7\u663E\u793A\u7684\u4F7F\u7528 <code>@Type</code>\u6CE8\u89E3\u6765\u6307\u5B9A\u4ED6\u4EEC\u7684\u6301\u4E45\u5316\u7B56\u7565\u4E3APhoneNumberType\u3002
nc5-1-4-1-1-1 = \u5305\u7EA7\u522B\u7684\u6CE8\u89E3\u88AB\u653E\u7F6E\u5728\u540D\u4E3A<code>package-info.java</code> \u7684\u6587\u4EF6\u4E2D\u3002\u628A\u4F60\u7684\u6CE8\u89E3\u653E\u5728\u5305\u58F0\u660E\u4E4B\u524D\u3002
p5-1-4-1-1-4 = \u4E0B\u9762\u7684\u793A\u4F8B\u5C55\u793A\u4E86\u5982\u4F55\u5728\u81EA\u5B9A\u4E49TypeDef\u4E2D\u4F7F\u7528parameters.
p5-1-4-1-1-5 = \u5F53\u4F7F\u7528\u590D\u5408\u7684\u7528\u6237\u7C7B\u578B\u65F6, \u4F60\u5C06\u4F1A\u987B\u77E5\u9053\u600E\u6837\u5B9A\u4E49\u5217\u3002\u51FA\u4E8E\u8FD9\u4E2A\u76EE\u7684\u4ECB\u7ECD\u4E86<code>@Columns</code>\u3002
 
#		**********************************************************************************************************
#		5.1.4.1.2. Access type
#		**********************************************************************************************************

title5-1-4-1-2 = 5.1.4.1.2. \u5B58\u53D6\u7C7B\u578B
p5-1-4-1-2-1 = \u9ED8\u8BA4\u60C5\u51B5\u4E0B\uFF0C\u7C7B\u7EA7\u522B\u7684\u5B58\u53D6\u7C7B\u578B\u7531<code>@Id</code> \u6216\u8005 <code>@EmbeddedId</code>\u6CE8\u89E3\u7684\u4F4D\u7F6E\u51B3\u5B9A\u3002\u5982\u679C\u8FD9\u4E9B\u6CE8\u89E3\u6807\u6CE8\u5728\u4E00\u4E2A\u5B57\u6BB5\u4E0A\uFF0C\u5219\u53EA\u4F1A\u6301\u4E45\u5316\u5B57\u6BB5\u5E76\u4E14\u901A\u8FC7\u5B57\u6BB5\u6765\u83B7\u53D6\u72B6\u6001\u3002\u5982\u679C\u6CE8\u89E3\u6807\u6CE8\u5728getter\u65B9\u6CD5\u4E0A\uFF0C\u90A3\u4E48\u53EA\u6709getter\u65B9\u6CD5\u4F1A\u88AB\u6301\u4E45\u5316\u5E76\u4E14\u901A\u8FC7getter/setter\u65B9\u6CD5\u83B7\u53D6\u72B6\u6001\u3002\u5728\u5B9E\u9645\u4E2D\u80FD\u591F\u5F88\u597D\u7684\u4F7F\u7528\uFF0C\u5E76\u4E14\u662F\u63A8\u8350\u4F7F\u7528\u7684\u65B9\u6CD5\u3002
nc5-1-4-1-2-1 = \u7C7B\u5C42\u7EA7\u7684\u6CE8\u89E3\uFF08\u5B57\u6BB5\u6216\u8005\u5C5E\u6027\uFF09\u5FC5\u987B\u540C\u6837\u7684\u53EF\u4EE5\u5B9A\u4E49\u9ED8\u8BA4\u7684\u5B58\u53D6\u7C7B\u578B\u3002\u5EFA\u8BAE\u4F60\u5728\u6574\u4E2A\u5E94\u7528\u4E2D\u4F7F\u7528\u4E00\u4E2A\u6CE8\u89E3\u5E03\u5C40\u7B56\u7565\u3002
p5-1-4-1-2-2 = \u7136\u800C\u5728\u67D0\u4E9B\u60C5\u51B5\u4E0B\uFF0C\u4F60\u9700\u8981:
li5-1-4-1-2-1-1 = \u5F3A\u5236\u5B58\u53D6\u7C7B\u578B\u4E3A\u5B9E\u4F53\u7EA7\u522B
li5-1-4-1-2-1-2 = \u5728\u7C7B\u7EA7\u4E3A\u7279\u5B9A\u7684\u5B9E\u4F53\u8986\u5199\u5B58\u53D6\u7C7B\u578B
li5-1-4-1-2-1-3 = \u8986\u5199\u53EF\u5D4C\u5165\u7C7B\u578B\u7684\u5B58\u53D6\u7C7B\u578B
p5-1-4-1-2-3 = \u6700\u597D\u7684\u4F8B\u5B50\u662F\u4E00\u4E2A\u53EF\u5D4C\u5165\u7684\u7C7B\u88AB\u591A\u4E2A\u5B9E\u4F53\u4F7F\u7528\u4F46\u662F\u4E0D\u4F7F\u7528\u76F8\u540C\u7684\u5B58\u53D6\u7C7B\u578B\u3002\u5728\u8FD9\u79CD\u60C5\u51B5\u4E0B\uFF0C\u6700\u597D\u5728\u53EF\u5D4C\u5165\u7C7B\u4E0A\u5F3A\u5236\u5B58\u53D6\u7C7B\u578B\u3002
p5-1-4-1-2-4 = \u4E0B\u9762\u6F14\u793A\u4F7F\u7528<code>@Access</code> \u6CE8\u89E3\u6765\u5F3A\u5236\u4E00\u4E2A\u7ED9\u5B9A\u7C7B\u7684\u5B58\u53D6\u7C7B\u578B\uFF1A
p5-1-4-1-2-5 = \u5728\u6301\u6709\u5176\u4ED6\u5C5E\u6027\u6807\u51C6\u7684\u540C\u65F6\u4F60\u4E5F\u53EF\u4EE5\u4E3A\u5355\u4E2A\u5C5E\u6027\u8986\u5199\u5B58\u53D6\u7C7B\u578B\u3002
p5-1-4-1-2-6 = \u5728\u8FD9\u4E2A\u793A\u4F8B\u4E2D, \u9664\u4E86orderNumber\u5C5E\u6027\u4E4B\u5916 \u5176\u4ED6\u7684\u5B58\u53D6\u7C7B\u578B\u90FD\u662FFIELD\u3002 \u6CE8\u610F\uFF0C\u5BF9\u5E94\u7684\u5B57\u6BB5\uFF0C\u5982\u679C\u6709\u7684\u8BDD\u9700\u8981\u88AB\u6807\u8BB0\u4E3A<code>@Transient</code> \u6216\u8005\u77AC\u6001\u7684.
nc5-1-4-1-2-2 = <code>@org.hibernate.annotations.AccessType</code>\u6CE8\u89E3\u5728\u5B57\u6BB5\u548C\u5C5E\u6027\u7684\u5B58\u53D6\u4E0A\u4E0D\u5EFA\u8BAE\u4F7F\u7528\uFF0C\u4F46\u662F\u5982\u679C\u4F60\u60F3\u4F7F\u7528\u81EA\u5B9A\u4E49\u7684\u5B58\u53D6\u7C7B\u578B\u7684\u8BDD\uFF0C\u8FD8\u662F\u6709\u6709\u7528\u7684\u3002
 
#		**********************************************************************************************************
#		5.1.4.1.3. Optimistic lock
#		**********************************************************************************************************

title5-1-4-1-3 = 5.1.4.1.3. \u4E50\u89C2\u9501
p5-1-4-1-3-1 = \u5B83\u6709\u65F6\u5019\u975E\u5E38\u6709\u7528\uFF0C\u5373\u4F7F\u7ED9\u5B9A\u7684\u662F\u5C5E\u6027\u662F\u810F\u6570\u636E\u5B83\u4E5F\u53EF\u4EE5\u907F\u514D\u589E\u957F\u7248\u672C\u53F7 (\u9488\u5BF9\u7279\u5B9A\u7684\u96C6\u5408)\u3002\u4F60\u53EF\u4EE5\u5728\u5C5E\u6027\uFF08\u6216\u8005\u96C6\u5408\u4E0A\uFF09 \u4F7F\u7528<code>@OptimisticLock(excluded=true)</code>\u6CE8\u89E3\u6765\u5B9E\u73B0\u4E0A\u8FF0\u529F\u80FD\u3002
p5-1-4-1-3-2 = \u66F4\u6B63\u5F0F\u7684, \u6307\u5B9A\u66F4\u65B0\u8BE5\u5C5E\u6027\u65F6\u4E0D\u9700\u8981\u83B7\u5F97\u4E50\u89C2\u9501\u3002
 
#		**********************************************************************************************************
#		5.1.4.1.4. Declaring column attributes
#		**********************************************************************************************************

title5-1-4-1-4 = 5.1.4.1.4. \u5217\u5C5E\u6027\u8BF4\u660E
p5-1-4-1-4-1 = \u7528\u4E8E\u5C5E\u6027\u6620\u5C04\u7684\u5217\u53EF\u4EE5\u7531<code>@Column</code>\u6CE8\u89E3\u5B9A\u4E49\u3002\u7528\u5B83\u6765\u8986\u76D6\u9ED8\u8BA4\u503C\uFF08\u9488\u5BF9\u9ED8\u8BA4\u7684\u60C5\u51B5\u67E5\u770BJPA\u6587\u6863\uFF09\u3002\u4F60\u53EF\u4EE5\u5728\u4E0B\u9762\u51E0\u79CD\u7C7B\u578B\u7684\u5C5E\u6027\u4E0A\u9762\u4F7F\u7528\u8BE5\u6CE8\u89E3\uFF1A
li5-1-4-1-4-1-1 = \u5B8C\u5168\u6CA1\u6709\u6CE8\u91CA\u7684
li5-1-4-1-4-1-2 = \u7528 <code>@Basic</code>\u6807\u6CE8\u7684
li5-1-4-1-4-1-3 = \u7528 <code>@Version</code>\u6807\u6CE8\u7684
li5-1-4-1-4-1-4 = \u7528 <code>@Lob</code>\u6807\u6CE8\u7684
li5-1-4-1-4-1-5 = \u7528 <code>@Temporal</code>\u6807\u6CE8\u7684
p5-1-4-1-4-2 = name\u5C5E\u6027\u88AB\u6620\u5C04\u4E3A<code>flight_name</code> \u5217, \u5E76\u4E14\u4E0D\u53EF\u4EE5\u4E3A\u7A7A\uFF0C\u957F\u5EA6\u4E3A50\u5E76\u4E14\u4E0D\u53EF\u4FEE\u6539(\u4F7F\u8BE5\u5C5E\u6027\u4E0D\u53EF\u53D8).
p5-1-4-1-4-3 = \u8FD9\u4E2A\u6CE8\u89E3\u53EF\u4EE5\u4F7F\u7528\u5728\u5E38\u89C4\u7684\u5C5E\u6027\u4E0A\uFF0C\u4E5F\u5305\u62EC<code>@Id</code> \u548C <code>@Version</code> \u5C5E\u6027\u3002
td5-1-4-1-4-1-1 = <code>name</code> (\u53EF\u9009): \u5217\u540D(\u9ED8\u8BA4\u662F\u5C5E\u6027\u540D)
td5-1-4-1-4-1-2 = <code>unique</code> (\u53EF\u9009): \u6807\u6CE8\u8BE5\u5217\u662F\u5426\u4F7F\u7528\u552F\u4E00\u7EA6\u675F(\u9ED8\u8BA4\u662Ffalse)
td5-1-4-1-4-1-3 = <code>nullable</code> (\u53EF\u9009): \u6807\u6CE8\u8BE5\u5217\u662F\u5426\u53EF\u4E3A\u7A7A(\u9ED8\u8BA4 true).
td5-1-4-1-4-1-4 = <code>insertable</code> (\u53EF\u9009): \u662F\u5426\u88AB\u5305\u542B\u5728insert\u8BED\u53E5\u4E2D(\u9ED8\u8BA4 true)
td5-1-4-1-4-1-5 = <code>updatable</code> (\u53EF\u9009): \u662F\u5426\u88AB\u5305\u542B\u5728update\u8BED\u53E5\u4E2D(\u9ED8\u8BA4 true)
td5-1-4-1-4-1-6 = <code>columnDefinition</code> (\u53EF\u9009): \u8986\u5199\u7279\u5B9A\u5217\u7684sql ddl\u7247\u6BB5(\u975E\u4FBF\u6377\u5F0F\u7684)
td5-1-4-1-4-1-7 = <code>table</code> (\u53EF\u9009): \u6307\u5B9A\u76EE\u6807\u8868(\u9ED8\u8BA4\u662F\u4E3B\u8868)
td5-1-4-1-4-1-8 = <code>length</code> (\u53EF\u9009): \u5217\u7684\u957F\u5EA6 (\u9ED8\u8BA4 255)
td5-1-4-1-4-1-9 = <code>precision</code> (\u53EF\u9009): \u5217\u7684\u7CBE\u5EA6 (\u9ED8\u8BA4 0)
td5-1-4-1-4-1-10 = <code>scale</code> (\u53EF\u9009): \u53EF\u7528\u7684\u5C0F\u6570\u70B9\u4F4D\u6570 (\u9ED8\u8BA4 0)
 
#		**********************************************************************************************************
#		5.1.4.1.5. Formula
#		**********************************************************************************************************

title5-1-4-1-5 = 5.1.4.1.5. \u516C\u5F0F
p5-1-4-1-5-1 = \u6709\u65F6\u5019\u4F60\u5E0C\u671B\u6570\u636E\u5E93\u53EF\u4EE5\u505A\u4E00\u4E9B\u8FD0\u7B97\uFF0C\u800C\u4E0D\u662F\u5728JVM\u4E2D\u8BA1\u7B97\u3002\u4F60\u4E5F\u8BB8\u5E0C\u671B\u521B\u5EFA\u67D0\u79CD\u7C7B\u578B\u7684\u865A\u62DF\u5217\u3002\u4F60\u53EF\u4EE5\u4F7F\u7528SQL\u7247\u6BB5\uFF08\u5373\u516C\u5F0F\uFF09\u6765\u53D6\u4EE3\u628A\u5C5E\u6027\u6620\u5C04\u4E3A\u5217\u3002\u8FD9\u79CD\u7C7B\u578B\u7684\u5C5E\u6027\u662F\u53EA\u8BFB\u7684\uFF08\u5B83\u7684\u503C\u7531sql\u516C\u5F0F\u8BA1\u7B97\u5F97\u6765\uFF09\u3002
p5-1-4-1-5-2 = SQl\u7247\u6BB5\u4E5F\u53EF\u4EE5\u5F88\u590D\u6742\uFF0C\u751A\u81F3\u53EF\u4EE5\u5305\u542B\u5B50\u67E5\u8BE2\u3002
 
#		**********************************************************************************************************
#		5.1.4.1.6. Non-annotated property defaults
#		**********************************************************************************************************

title5-1-4-1-6 = 5.1.4.1.6. \u672A\u6CE8\u89E3\u5C5E\u6027\u7684\u9ED8\u8BA4\u503C
p5-1-4-1-6-1 = \u5982\u679C\u4E00\u4E2A\u5C5E\u6027\u672A\u88AB\u6CE8\u89E3\uFF0C\u5219\u9075\u4ECE\u4EE5\u4E0B\u89C4\u5219:
li5-1-4-1-6-1-1 = \u5982\u679C\u4E00\u4E2A\u5C5E\u6027\u662F\u7B80\u5355\u7C7B\u578B\uFF0C\u9ED8\u8BA4\u4F7F\u7528<code>@Basic</code>\u6620\u5C04\u3002
li5-1-4-1-6-1-2 = \u5426\u5219, \u5982\u679C\u5C5E\u6027\u7C7B\u578B\u6CE8\u89E3\u4E86\uFF0C\u5219\u9ED8\u8BA4\u4F7F\u7528 <code>@Embedded</code>\u6CE8\u89E3\u3002
li5-1-4-1-6-1-3 = \u5426\u5219, \u5982\u679C\u5C5E\u6027\u7684\u7C7B\u578B\u662F\u5E8F\u5217\u5316\u7684\uFF0C\u5219\u5728\u4FDD\u5B58\u5BF9\u8C61\u7684\u5E8F\u5217\u5316\u7248\u672C\u7684\u5217\u4E0A\u4F7F\u7528<code>@Basic</code> \u6CE8\u89E3
li5-1-4-1-6-1-4 = \u5426\u5219, \u5982\u679C\u5C5E\u6027\u7C7B\u578B\u662Fjava.sql.Clob \u6216 java.sql.Blob, \u4F1A\u6839\u636E<code>LobType</code>\u52A0\u4E0A\u9002\u5F53\u7684 @Lob\u6CE8\u89E3\u3002 
 
#		**********************************************************************************************************
#		5.1.4.2. Property mapping with hbm.xml
#		**********************************************************************************************************

title5-1-4-2 = 5.1.4.2. \u4F7F\u7528<code>hbm.xml</code>\u6620\u5C04\u5C5E\u6027
p5-1-4-2-1 = <code>&lt;property&gt;</code> \u5143\u7D20\u7528\u4E8E\u58F0\u660E\u7C7B\u4E2DJavaBean\u98CE\u683C\u7684\u5C5E\u6027\u3002
td5-1-4-2-1-1 = <code>name</code>: \u5C5E\u6027\u540D\uFF0C\u4EE5\u5C0F\u5199\u5B57\u6BCD\u5F00\u5934\u3002
td5-1-4-2-1-2 = <code>column</code> (\u53EF\u9009 - \u9ED8\u8BA4\u662F\u5C5E\u6027\u540D): \u5728\u6570\u636E\u5E93\u4E2D\u6620\u5C04\u7684\u5217\u540D\u3002\u4E5F\u53EF\u4EE5\u4F7F\u7528\u5D4C\u5165\u7684<column>\u5143\u7D20\u6765\u6307\u5B9A\u3002
td5-1-4-2-1-3 = <code>type</code> (\u53EF\u9009): \u8868\u660EHibernate \u7C7B\u578B\u3002
td5-1-4-2-1-4 = <code>update</code>, <code>insert</code> (\u53EF\u9009 - \u9ED8\u8BA4 true): \u8868\u660E\u6620\u5C04\u7684\u5217\u5E94\u8BE5\u5305\u542B\u5728update \u548Cinsert sql\u8BED\u53E5\u4E2D\u3002\u5982\u679C\u90FD\u8BBE\u7F6E\u4E3Afalse,\u5219\u5141\u8BB8\u4F7F\u7528\u4E00\u4E2A\u5B8C\u5168\u6D3E\u751F\u7684\u5C5E\u6027\uFF0C\u5B83\u7684\u503C\u7531\u548C\u5B83\u6620\u5C04\u5230\u76F8\u540C\u5217\u7684\u5C5E\u6027\u6216\u8005\u7531\u4E00\u4E2A\u89E6\u53D1\u5668\u6216\u5176\u4ED6\u5E94\u7528\u6307\u5B9A\u3002
td5-1-4-2-1-5 = <code>formula</code> (\u53EF\u9009): \u4E00\u4E2Asql\u8868\u8FBE\u5F0F\uFF0C\u6765\u8BA1\u7B97\u5C5E\u6027\u7684\u503C\u3002\u8BA1\u7B97\u5F97\u6765\u7684\u5C5E\u6027\u5728\u6570\u636E\u5E93\u4E2D\u6CA1\u6709\u5BF9\u5E94\u7684\u6620\u5C04\u5217\u3002
td5-1-4-2-1-6 = <code>access</code> (\u53EF\u9009 - \u9ED8\u8BA4 property): Hibernate\u5B58\u53D6\u5C5E\u6027\u503C\u7684\u7B56\u7565\u3002
td5-1-4-2-1-7 = <code>lazy</code> (\u53EF\u9009 - \u9ED8\u8BA4 false): \u6307\u5B9A\u5F53\u5B9E\u4F8B\u53D8\u91CF\u7B2C\u4E00\u6B21\u88AB\u8BBF\u95EE\u65F6\u8BE5\u5C5E\u6027\u5E94\u8BE5\u88AB\u5EF6\u8FDF\u6293\u53D6\u3002\u8FD9\u9700\u8981build-time\u5B57\u8282\u7801\u63A7\u4EF6\u3002
td5-1-4-2-1-8 = <code>unique</code> (\u53EF\u9009): \u4E3A\u8BE5\u5217\u542F\u7528DDL\u751F\u6210\u7684\u552F\u4E00\u7EA6\u675F\u3002\u540C\u6837\uFF0C\u8BE5\u5C5E\u6027\u4E5F\u53EF\u4EE5\u662Fproperty-ref\u7684\u76EE\u6807\u3002
td5-1-4-2-1-9 = <code>not-null</code> (\u53EF\u9009): \u4E3A\u8BE5\u5217\u542F\u7528DDL\u751F\u6210\u7684\u975E\u7A7A\u7EA6\u675F\u3002
td5-1-4-2-1-10 = <code>optimistic-lock</code> (\u53EF\u9009 - \u9ED8\u8BA4 true): \u6307\u5B9A\u4FEE\u6539\u8BE5\u5C5E\u6027\u65F6\u4E0D\u9700\u8981\u83B7\u53D6\u4E50\u89C2\u9501\u3002\u6362\u53E5\u8BDD\u8BF4\uFF0C\u5F53\u8BE5\u5C5E\u6027\u662F\u810F\u6570\u636E\u7684\u65F6\u5019\uFF0C\u662F\u5426\u5E94\u8BE5\u589E\u52A0\u7248\u672C\u53F7\u3002
td5-1-4-2-1-11 = <code>generated</code> (\u53EF\u9009 - \u9ED8\u8BA4 never): \u6307\u5B9A\u8BE5\u5C5E\u6027\u7684\u503C\u7531\u6570\u636E\u5E93\u751F\u6210\u3002\u53C2\u8003 <a href="#c5-5">\u751F\u6210\u7684\u5C5E\u6027</a>\u83B7\u53D6\u66F4\u591A\u4FE1\u606F\u3002
p5-1-4-2-2 = \u7C7B\u578B\u540D\u53EF\u4EE5\u4E3A:
li5-1-4-2-1-1 = Hibernate\u57FA\u672C\u7C7B\u578B\u7684\u540D\u5B57: <code>integer</code>, <code>string</code>, <code>character</code>, <code>date</code>, <code>timestamp</code>, <code>float</code>, <code>binary</code>, <code>serializable</code>, <code>object</code>, <code>blob</code> etc.
li5-1-4-2-1-2 = Java\u57FA\u672C\u7C7B\u578B\u7684\u540D\u5B57: <code>int</code>, <code>float</code>, <code>char</code>, <code>java.lang.String</code>, <code>java.util.Date</code>, <code>java.lang.Integer</code>, <code>java.sql.Clob</code> etc.
li5-1-4-2-1-3 = \u5E8F\u5217\u5316\u7684Java\u7C7B\u7684\u540D\u5B57\u3002
li5-1-4-2-1-4 = \u81EA\u5B9A\u4E49\u7C7B\u578B\u7684\u7C7B\u540D: <code>com.illflow.type.MyCustomType</code> etc.
p5-1-4-2-3 = \u5982\u679C\u6CA1\u6709\u6307\u5B9A\u7C7B\u578B, Hibernate\u5C06\u4F1A\u6839\u636E\u6307\u5B9A\u7684\u5C5E\u6027\u901A\u8FC7\u53CD\u5C04\u6765\u83B7\u53D6\u6B63\u786E\u7684Hibernate\u7C7B\u578B\u3002Hibernate\u5C06\u4F1A\u5C1D\u8BD5\u5B89\u88C5\u4E0A\u97622,3,4\u6761\u89C4\u5219\u89E3\u6790\u901A\u8FC7\u5C5E\u6027\u7684getter\u65B9\u6CD5\u8FD4\u56DE\u7684\u7C7B\u7684\u540D\u5B57\u3002\u5728\u67D0\u4E9B\u60C5\u51B5\u4E0B\u4F60\u9700\u8981type\u5C5E\u6027\u3002\u4F8B\u5982, \u7528\u6765\u533A\u5206Hibernate.DATE \u548C <code>Hibernate.TIMESTAMP</code>, \u6216\u8005\u7528\u6765\u6307\u5B9A\u81EA\u5B9A\u4E49\u7C7B\u578B\u3002
p5-1-4-2-4 = <code>access</code>\u7528\u6765\u63A7\u5236Hibernate\u5728\u8FD0\u884C\u65F6\u600E\u6837\u8BBF\u95EE\u5C5E\u6027\u3002\u9ED8\u8BA4\u7684\uFF0CHibernate\u5C06\u4F1A\u8C03\u7528\u5C5E\u6027\u7684get/set\u65B9\u6CD5\u3002\u5982\u679C\u4F60\u6307\u5B9Aaccess="field", Hibernate\u5C06\u4F1A\u7ED5\u5F00get/set\u65B9\u6CD5\uFF0C\u76F4\u63A5\u901A\u8FC7\u53CD\u5C04\u6765\u8BBF\u95EE\u5C5E\u6027\u3002\u4F60\u53EF\u4EE5\u901A\u8FC7\u6307\u5B9A\u4E00\u4E2A\u5B9E\u73B0\u4E86<code>org.hibernate.property.PropertyAccessor</code>\u63A5\u53E3\u7684\u7C7B\u6765\u81EA\u5B9A\u4E49\u5C5E\u6027\u8BBF\u95EE\u7B56\u7565\u3002
p5-1-4-2-5 = \u53E6\u4E00\u4E2A\u5F3A\u5927\u7684\u7279\u6027\u662F\u6D3E\u751F\u5C5E\u6027\u3002\u8FD9\u4E9B\u5C5E\u6027\u88AB\u5B9A\u4E49\u4E3A\u53EA\u8BFB\u7684\u3002\u5C5E\u6027\u7684\u503C\u5728\u52A0\u8F7D\u65F6\u8BA1\u7B97\u5F97\u51FA\u3002\u4F60\u53EF\u4EE5\u58F0\u660E\u4F7F\u7528SQL\u8868\u8FBE\u5F0F\u8BA1\u7B97\u3002\u8868\u8FBE\u5F0F\u5C06\u4F1A\u8F6C\u5316\u6210\u52A0\u8F7D\u4E00\u4E2A\u5B9E\u4F8B\u7684SQl\u5B50\u67E5\u8BE2\u8BED\u53E5\uFF1A
p5-1-4-2-6 = \u4F60\u53EF\u4EE5\u901A\u8FC7\u4E0D\u7ED9\u7279\u5B9A\u7684\u5217\u6307\u5B9A\u522B\u540D\u6765\u5F15\u7528\u5B9E\u4F53\u8868\u3002\u5728\u4E0A\u9762\u7684\u4F8B\u5B50\u4E2D\u662F <code>customerId</code>\u3002\u5982\u679C\u4F60\u4E0D\u60F3\u628A\u5B83\u4F5C\u4E3A\u5C5E\u6027\u4F7F\u7528\uFF0C\u4F60\u4E5F\u53EF\u4EE5\u4F7F\u7528\u5D4C\u5165\u7684<formula>\u5143\u7D20\u3002
 
#		**********************************************************************************************************
#		5.1.5. Embedded objects (aka components)
#		**********************************************************************************************************

title5-1-5 = 5.1.5. \u5D4C\u5165\u5F0F\u5BF9\u8C61 (\u53C8\u540D\u7EC4\u4EF6)
p5-1-5-1 = \u5D4C\u5165\u5F0F\u5BF9\u8C61(\u6216\u7EC4\u4EF6) \u662F\u90A3\u4E9B\u5C5E\u6027\u88AB\u540C\u6837\u6620\u5C04\u5230\u4E3B\u8868\u7684\u5BF9\u8C61\u3002\u53CD\u8FC7\u6765\uFF0C\u7EC4\u4EF6\u4E5F\u53EF\u4EE5\u5B9A\u4E49\u81EA\u5DF1\u7684\u5C5E\u6027\u3001\u7EC4\u4EF6\u3001\u548C\u96C6\u5408\u3002
p5-1-5-2 = \u53EF\u4EE5\u5728\u4E00\u4E2A\u5B9E\u4F53\u4E2D\u58F0\u660E\u5D4C\u5165\u7EC4\u4EF6\uFF0C\u751A\u81F3\u53EF\u4EE5\u91CD\u65B0\u6620\u5C04\u5C5E\u6027\u5217\u3002\u7EC4\u4EF6\u7C7B\u5FC5\u987B\u5728\u7C7B\u4E0A\u4F7F\u7528 @Embeddable\u6CE8\u89E3\u3002\u53EF\u4EE5\u5728\u5173\u8054\u7684\u5C5E\u6027\u4E0A\u9762\u4F7F\u7528<code>@Embedded</code> \u548C <code>@AttributeOverride</code> \u6CE8\u89E3\u6765\u4E3A\u4E00\u4E2A\u7279\u5B9A\u7684\u5B9E\u4F53\u8986\u5199\u5217\u7684\u6620\u5C04\uFF1A
p5-1-5-3 = \u5D4C\u5165\u5F0F\u5BF9\u8C61\u7EE7\u627F\u5176\u6240\u5C5E\u5B9E\u4F53\u4E2D\u5B9A\u4E49\u7684\u8BBF\u95EE\u7C7B\u578B\uFF08\u6CE8\u610F\uFF0C\u8FD9\u53EF\u4EE5\u901A\u8FC7\u4F7F\u7528<code>@Access</code> \u6CE8\u89E3\u6765\u8986\u76D6\u539F\u6709\u503C\uFF09\u3002
p5-1-5-4 = \u4E0A\u9762\u7684\u4F8B\u5B50\u4E2D\uFF0C<code>Person</code> \u6709\u4E24\u4E2A\u7EC4\u4EF6\u5C5E\u6027\uFF0C\u5206\u522B\u662FhomeAddress\u548CbornIn. homeAddress\u5C5E\u6027\u5E76\u6CA1\u6709\u88AB\u6CE8\u89E3\uFF0C\u4F46\u662FHibernate\u4F1A\u81EA\u52A8\u68C0\u6D4B\u5176\u5BF9\u5E94\u7684Address\u7C7B\u4E2D\u7684 <code>@Embeddable</code>\u6CE8\u89E3\uFF0C\u5E76\u5C06\u5176\u770B\u505A\u4E00\u4E2A\u6301\u4E45\u5316\u7EC4\u4EF6\u3002\u5BF9\u4E8ECountry\u4E2D\u5DF2\u6620\u5C04\u7684\u5C5E\u6027\uFF0C\u4F7F\u7528<code>@Embedded</code> \u548C <code>@AttributeOverride</code>\u6CE8\u89E3\u6765\u8986\u76D6\u539F\u6765\u6620\u5C04\u7684\u5217\u540D\uFF08\u8986\u5199\u4E3AbornCountryName\uFF09\u3002\u6B63\u5982\u4F60\u6240\u770B\u5230\u7684\uFF0CAddress\u5BF9\u8C61\u4E2D\u8FD8\u5185\u5D4C\u4E86Country\u5BF9\u8C61\uFF0C\u8FD9\u91CC\u4E5F\u540C\u6837\u4F7F\u7528\u4E86Hibernate\u548CEJB3\u7684\u81EA\u52A8\u68C0\u6D4B\u673A\u5236\u3002 \u901A\u8FC7\u201C.\u201D\u7B26\u53F7\u6765\u8986\u76D6\u5D4C\u5165\u5F0F\u5BF9\u8C61\u4E2D\u7684\u5D4C\u5165\u5F0F\u5BF9\u8C61\u3002
p5-1-5-5 = Hibernate \u6CE8\u89E3\u652F\u6301\u5F88\u591AEJB3\u89C4\u8303\u4E2D\u6CA1\u6709\u660E\u786E\u5B9A\u4E49\u7684\u7279\u6027\u3002\u4F8B\u5982\uFF0C\u4F60\u53EF\u4EE5\u5728\u5D4C\u5165\u5F0F\u5BF9\u8C61\u4E0A\u6DFB\u52A0 <code>@MappedSuperclass</code>\u6CE8\u89E3\uFF0C\u8FD9\u6837\u53EF\u4EE5\u5C06\u5176\u7236\u7C7B\u7684\u5C5E\u6027\u6301\u4E45\u5316\u3002(\u8BE6\u60C5\u53C2\u9605 <code>@MappedSuperclass</code> )\u3002
p5-1-5-6 = \u53EF\u4EE5\u5728\u5173\u8054\u6CE8\u89E3\u4E2D\u4F7F\u7528\u5D4C\u5165\u5F0F\u5BF9\u8C61(\u4F8B\u5982 <code>@OneToOne</code>, <code>@ManyToOne</code>, <code>@OneToMany</code> \u548C <code>@ManyToMany</code>)\u3002\u4F60\u53EF\u4EE5\u4F7F\u7528 <code>@AssociationOverride</code>\u6CE8\u89E3\u6765\u8986\u5199\u5173\u8054\u5217\u3002
p5-1-5-7 = \u5982\u679C\u4F60\u60F3\u5728\u4E00\u4E2A\u5B9E\u4F53\u4E2D\u4F7F\u7528\u4E24\u4E2A\u540C\u7C7B\u578B\u7684\u5D4C\u5165\u5BF9\u8C61\uFF0C\u5176\u9ED8\u8BA4\u7684\u5217\u540D\u662F\u65E0\u6548\u7684\uFF0C\u56E0\u4E3A\u51E0\u4E2A\u5D4C\u5165\u5BF9\u8C61\u5C06\u4F1A\u5171\u4EAB\u76F8\u540C\u7684\u5217\u3002\u5728JPA\u4E2D\uFF0C\u4F60\u9700\u8981\u81F3\u5C11\u5BF9\u4E00\u4E2A\u8FDB\u884C\u8986\u5199\u3002\u800C\u5728Hibernate\u4E2D\uFF0C\u5141\u8BB8\u4F60\u901A\u8FC7NamingStrategy\u63A5\u53E3\u5BF9\u9ED8\u8BA4\u7684\u547D\u540D\u673A\u5236\u8FDB\u884C\u6269\u5C55\u3002\u901A\u8FC7\u8FD9\u79CD\u65B9\u5F0F\u4F60\u53EF\u4EE5\u5199\u4E00\u4E2A\u9632\u6B62\u547D\u540D\u51B2\u7A81\u7684\u7B56\u7565\u3002DefaultComponentSafeNamingStrategy \u5C31\u662F\u8FD9\u6837\u4E00\u4E2A\u4F8B\u5B50\u3002
p5-1-5-8 = \u5982\u679C\u5D4C\u5165\u5BF9\u8C61\u5C5E\u6027\u53CD\u5411\u6307\u5411\u4E86\u4ED6\u7684\u6240\u5C5E\u5B9E\u4F53\uFF0C\u90A3\u4E48\uFF0C\u628A\u5B83\u6807\u8BB0\u4E3A <code>@Parent</code> \u3002Hibernate\u5C06\u4F1A\u786E\u4FDD\u5C5E\u6027\u548C\u5B9E\u4F53\u5F15\u7528\u88AB\u6B63\u786E\u52A0\u8F7D\u3002
p5-1-5-9 = \u5728XML\u4E2D\uFF0C\u4F7F\u7528<code>&lt;component\&gt;</code> \u5143\u7D20\u3002
td5-1-5-1-1 = <code>name</code>: \u5C5E\u6027\u540D\u3002
td5-1-5-1-2 = <code>class</code> (\u53EF\u9009 - \u9ED8\u8BA4\u7531\u53CD\u5C04\u51B3\u5B9A\u7684\u5C5E\u6027\u7C7B\u578B): \u7EC4\u4EF6(\u5B50)\u7C7B\u7684\u540D\u5B57\u3002
td5-1-5-1-3 = <code>insert</code>: \u6620\u5C04\u5217\u662F\u5426\u5728insert\u8BED\u53E5\u4E2D\u51FA\u73B0\uFF1F
td5-1-5-1-4 = <code>update</code>: \u6620\u5C04\u5217\u662F\u5426\u5728update\u8BED\u53E5\u4E2D\u51FA\u73B0\uFF1F
td5-1-5-1-5 = <code>access</code> (\u53EF\u9009 - \u9ED8\u8BA4\u662Fproperty): Hibernate\u8BBF\u95EE\u5C5E\u6027\u503C\u7684\u7B56\u7565\u3002
td5-1-5-1-6 = <code>lazy</code> (\u53EF\u9009 - \u9ED8\u8BA4false): \u6307\u5B9A\u5728\u7B2C\u4E00\u6B21\u8BBF\u95EE\u5B9E\u4F8B\u53D8\u91CF\u65F6\u8BE5\u7EC4\u4EF6\u5E94\u8BE5\u88AB\u61D2\u52A0\u8F7D\uFF0C\u9700\u8981\u5728\u6784\u5EFA\u65F6\u52A0\u5165\u4E8C\u8FDB\u5236\u6307\u793A\u6307\u4EE4\u3002
td5-1-5-1-7 = <code>optimistic-lock</code> (\u53EF\u9009 - \u9ED8\u8BA4 true): \u6307\u5B9A\u66F4\u65B0\u8BE5\u7EC4\u4EF6\u65F6\u4E0D\u9700\u8981\u83B7\u53D6\u4E50\u89C2\u9501\uFF0C\u4ED6\u51B3\u5B9A\u4E86\u5F53\u8BE5\u5C5E\u6027\u662F\u810F\u6570\u636E\u65F6\uFF0C\u662F\u5426\u589E\u52A0\u7248\u672C\u53F7\u3002
td5-1-5-1-8 = <code>unique</code> (\u53EF\u9009 - \u9ED8\u8BA4 false): \u6307\u5B9A\u5728\u6240\u6709\u7684\u6620\u5C04\u5217\u4E2D\u52A0\u5165\u552F\u4E00\u7EA6\u675F\u3002
p5-1-5-10 = \u5B50 <code>&lt;property&gt;</code> \u6807\u7B7E\uFF0C\u6620\u5C04\u5B50\u7C7B\u7684\u6240\u6709\u5C5E\u6027\u5230\u8868\u5217\u3002
p5-1-5-11 = <code>&lt;component&gt;</code> \u6807\u7B7E\u5185\u53EF\u4EE5\u4F7F\u7528&lt;parent&gt; \u5B50\u5143\u7D20\u6765\u6620\u5C04\u7EC4\u4EF6\u5185\u53CD\u5411\u5F15\u7528\u6240\u5C5E\u5B9E\u4F53\u7684\u5C5E\u6027\u3002
p5-1-5-12 = <code>&lt;dynamic-component&gt;</code> \u5143\u7D20\uFF0C\u53EF\u4EE5\u628AMap\u6620\u5C04\u4E3A\u7EC4\u4EF6\uFF0CMap\u7684key\u4F1A\u88AB\u6620\u5C04\u6210\u5C5E\u6027\u540D\uFF0C\u8BE6\u60C5\u53C2\u8003 <a href="#c9-5">Section 9.5, \u201C\u52A8\u6001\u7EC4\u4EF6\u201D</a> \u3002\u8BE5\u7279\u6027\u5728\u6CE8\u89E3\u4E2D\u4E0D\u88AB\u652F\u6301\u3002
 
#		**********************************************************************************************************
#		5.1.6. Inheritance strategy
#		**********************************************************************************************************

title5-1-6 = 5.1.6. \u7EE7\u627F\u7B56\u7565
p5-1-6-1 = Java\u652F\u6301\u591A\u6001: \u4E00\u4E2A\u7C7B\u53EF\u4EE5\u7EE7\u627F\u81EA\u53E6\u5916\u7684\u7C7B\u3002 \u8FD9\u4E9B\u7B56\u7565\u5B58\u5728\u4E00\u4E2A\u5C42\u6B21\u7ED3\u6784\uFF1A
li5-1-6-1-1 = \u6BCF\u4E2A\u7C7B\u5206\u5C42\u7ED3\u6784\u4E00\u5F20\u8868: \u4E00\u4E2A\u8868\u5B58\u50A8\u8BE5\u7C7B\u7684\u5C42\u6B21\u7ED3\u6784\u7684\u6240\u6709\u6570\u636E
li5-1-6-1-2 = \u94FE\u63A5\u7684\u5B50\u8868\u7B56\u7565: \u7C7B\u548C\u5176\u5B50\u7C7B\u5404\u4E00\u5F20\u8868\uFF0C\u5404\u4E2A\u8868\u5B58\u50A8\u5BF9\u5E94\u5B50\u7C7B\u7684\u7279\u6B8A\u5C5E\u6027\u3002\u5B9E\u4F53\u7684\u72B6\u6001\u88AB\u5B58\u50A8\u5728\u5B83\u5BF9\u7684\u7C7B\u548C\u5B83\u6240\u6709\u7684\u8D85\u7C7B\u4E2D\u3002 
li5-1-6-1-3 = \u6BCF\u4E2A\u7C7B\u4E00\u5F20\u8868: \u6BCF\u4E2A\u5177\u4F53\u7C7B\u548C\u5B50\u7C7B\u5404\u4E00\u5F20\u8868\uFF0C\u6BCF\u4E2A\u8868\u5B58\u50A8\u4E86\u4ED6\u7684\u5C5E\u6027\u548C\u5B83\u7236\u7C7B\u7684\u5C5E\u6027\u3002\u5B9E\u4F53\u7684\u72B6\u6001\u5B8C\u5168\u5B58\u50A8\u5728\u4ED6\u7684\u7279\u5B9A\u8868\u4E2D\u3002
 
#		**********************************************************************************************************
#		5.1.6.1. Single table per class hierarchy strategy
#		**********************************************************************************************************

title5-1-6-1 = 5.1.6.1. \u6BCF\u4E2A\u7C7B\u5C42\u6B21\u7ED3\u6784\u4E00\u5F20\u8868
p5-1-6-1-1 = \u5728\u8FD9\u79CD\u65B9\u6CD5\u4E2D\uFF0C\u4E00\u4E2A\u7ED9\u5B9A\u7C7B\u5C42\u6B21\u7ED3\u6784\u4E2D\u7684\u6240\u6709\u5B50\u8868\u7684\u5C5E\u6027\u90FD\u88AB\u4FDD\u5B58\u5728\u4E00\u5F20\u8868\u4E2D\u3002
p5-1-6-1-2 = \u6BCF\u4E2A\u5B50\u7C7B\u58F0\u660E\u81EA\u5DF1\u7684\u5C5E\u6027\u548C\u5B50\u7C7B\u3002\u7248\u672C\u548Cid\u5C5E\u6027\u7EE7\u627F\u81EA\u6839\u7C7B\u3002\u5C42\u6B21\u7ED3\u6784\u4E2D\u7684\u6BCF\u4E2A\u5B50\u7C7B\u90FD\u5FC5\u987B\u5B9A\u4E49\u4E00\u4E2A\u9274\u5B9A\u503C\u3002\u5982\u679C\u6CA1\u6709\u6307\u5B9A\uFF0C\u5219\u9ED8\u8BA4\u4F7F\u7528\u7C7B\u7684\u6743\u9650\u5B9A\u540D\u3002
p5-1-6-1-3 = \u5728<code>hbm.xml</code>\u4E2D, \u9488\u5BF9\u6BCF\u4E2A\u5C42\u6B21\u7ED3\u6784\u4E00\u5F20\u8868\u7684\u7B56\u7565\uFF0C\u4F7F\u7528<code>&lt;subclass&gt;</code> \u58F0\u660E\u3002\u4F8B\u5982:
td5-1-6-1-1 = <code>name</code>: \u5B50\u7C7B\u7684\u5168\u9650\u5B9A\u540D\u3002
td5-1-6-1-2 = <code>discriminator-value</code> (\u53EF\u9009 - \u9ED8\u8BA4\u7C7B\u540D): \u7528\u4E8E\u533A\u5206\u6BCF\u4E2A\u5B50\u7C7B\u7684\u503C\u3002
td5-1-6-1-3 = <code>proxy</code> (\u53EF\u9009): \u6307\u5B9A\u4E00\u4E2A\u7C7B\u6216\u8005\u63A5\u53E3\u7528\u4E8E\u61D2\u52A0\u8F7D\u4EE3\u7406\u3002
td5-1-6-1-4 = <code>lazy</code> (\u53EF\u9009 - \u9ED8\u8BA4true): \u8BBE\u7F6E lazy="false" \u6765\u7981\u7528\u61D2\u52A0\u8F7D\u3002
p5-1-6-1-4 = \u7EE7\u627F\u6620\u5C04\u7684\u66F4\u591A\u4FE1\u606F\u53C2\u8003<a href="c10">Chapter 10, \u7EE7\u627F\u6620\u5C04</a>.
 
#		**********************************************************************************************************
#		5.1.6.1.1. Discriminator
#		**********************************************************************************************************

title5-1-6-1-1 = 5.1.6.1.1. \u9274\u522B\u5668
p5-1-6-1-1-1 = \u5728\u4F7F\u7528table-per-class-hierarchy\u6620\u5C04\u7B56\u7565\u7684\u591A\u6001\u6301\u4E45\u5316\u4E2D\u9700\u8981\u4F7F\u7528\u9274\u522B\u5668\u3002\u5728\u8868\u4E2D\u58F0\u660E\u4E86\u9274\u522B\u5217\u3002 \u8FD9\u4E2A\u9274\u522B\u5217\u5305\u542B\u6807\u8BB0\u503C\uFF0C\u6765\u544A\u8BC9\u6301\u4E45\u5C42\u4E00\u4E2A\u7279\u5B9A\u7684\u884C\u5BF9\u5E94\u4E8E\u54EA\u4E00\u4E2A\u5B50\u7C7B\u3002Hibernate \u5185\u6838\u652F\u6301\u4EE5\u4E0B\u7C7B\u578B\u4F5C\u4E3A\u9274\u522B\u5217\uFF1A <code>string</code>, <code>character</code>, <code>integer</code>, <code>byte</code>, <code>short</code>, <code>boolean</code>, <code>yes_no</code>, <code>true_false</code>\u3002
p5-1-6-1-1-2 = \u548C\u9274\u522B\u7C7B\u578B\u4E00\u6837\uFF0C\u4F7F\u7528<code>@DiscriminatorColumn</code> \u6765\u5B9A\u4E49\u9274\u522B\u5217\u3002
nc5-1-6-1-1-1 = \u5728<code>javax.persitence.DiscriminatorColumn</code> \u4E2D\u53EF\u4EE5\u4F7F\u7528\u7684DiscriminatorType\u53EA\u5305\u62EC<code>STRING</code>, <code>CHAR</code> \u548C <code>INTEGER</code> \uFF0C\u8FD9\u610F\u5473\u7740\u5E76\u4E0D\u662F\u6240\u6709\u7684Hibernate\u7C7B\u578B\u90FD\u88AB<code>@DiscriminatorColumn</code> \u652F\u6301\u3002
p5-1-6-1-1-3 = \u4E5F\u53EF\u4EE5\u4F7F\u7528 <code>@DiscriminatorFormula</code> \u5728SQL\u4E2D\u521B\u5EFA\u4E00\u4E2A\u865A\u62DF\u7684\u9274\u522B\u5217\u3002\u5F53\u9274\u522B\u5668\u7684\u503C\u662F\u4ECE\u8868\u7684\u4E00\u5217\u6216\u8005\u591A\u5217\u4E2D\u83B7\u53D6\u65F6\uFF0C\u8FD9\u662F\u975E\u5E38\u6709\u7528\u7684\u3002 <code>@DiscriminatorColumn</code> \u548C <code>@DiscriminatorFormula</code> \u90FD\u53EA\u80FD\u7528\u5728\u6839\u5B9E\u4F53\u4E0A(\u6BCF\u4E2A\u6301\u4E45\u5316\u5C42\u6B21\u4E00\u4E2A).
p5-1-6-1-1-4 = <code>@org.hibernate.annotations.DiscriminatorOptions</code> allows to optionally specify Hibernate specific discriminator options which are not standardized in JPA. The available options are force and insert. The force attribute is useful if the table contains rows with "extra" discriminator values that are not mapped to a persistent class. This could for example occur when working with a legacy database. If force is set to true Hibernate will specify the allowed discriminator values in the SELECT query, even when retrieving all instances of the root class. The second option - insert - tells Hibernate whether or not to include the discriminator column in SQL INSERTs. Usually the column should be part of the INSERT statement, but if your discriminator column is also part of a mapped composite identifier you have to set this option to false.
tc5-1-6-1-1-1 = \u53C8\u6709\u4E00\u4E2A\u53EB <code>@org.hibernate.annotations.ForceDiscriminator</code> \u7684\u6CE8\u89E3\uFF0C\u4F46\u662F\u81EA\u4ECE3.6\u7248\u672C\u5F00\u59CB\u5C31\u88AB\u5F03\u7528\u4E86\u3002\u5B83\u88AB<code>@DiscriminatorOptions</code> \u6240\u53D6\u4EE3\u3002
p5-1-6-1-1-5 = \u6700\u540E, \u5728\u5C42\u6B21\u7ED3\u6784\u4E2D\u7684\u6BCF\u4E2A\u7C7B\u4E0A\u4F7F\u7528 <code>@DiscriminatorValue</code>\u6CE8\u89E3\u6765\u6307\u5B9A\u7ED9\u5B9A\u5B9E\u4F53\u7684\u9274\u522B\u5217\u7684\u503C\u3002\u5982\u679C\u5728\u7C7B\u4E0A\u6CA1\u6709\u6307\u5B9A<code>@DiscriminatorValue</code>\uFF0C\u5C06\u4F1A\u9ED8\u8BA4\u4F7F\u7528\u7C7B\u7684\u6743\u9650\u5B9A\u540D\u3002
p5-1-6-1-1-6 = \u5728 <code>hbm.xml</code>\u4E2D, \u4F7F\u7528 <code>&lt;discriminator&gt;</code> \u5143\u7D20\u6765\u5B9A\u4E49\u9274\u522B\u5217\u6216\u516C\u5F0F:
td5-1-6-1-1-1-1 = <code>column</code> (\u53EF\u9009 - \u9ED8\u8BA4 class): \u9274\u522B\u5217\u7684\u540D\u5B57\u3002
td5-1-6-1-1-1-2 = <code>type</code> (\u53EF\u9009 - \u9ED8\u8BA4 string): Hibernate\u7C7B\u578B\u540D\u3002
td5-1-6-1-1-1-3 = <code>force</code> (\u53EF\u9009 - \u9ED8\u8BA4 false): \u5F3A\u5236Hibernate\u53D6\u51FA\u9274\u522B\u5668\u7684\u503C\uFF0C\u5373\u4F7F\u5728\u53D6\u6240\u6709\u7684\u6839\u5B9E\u4F8B\u7684\u65F6\u5019\u3002
td5-1-6-1-1-1-4 = <code>insert</code> (\u53EF\u9009 - \u9ED8\u8BA4 true): \u5982\u679C\u4F60\u7684\u9274\u522B\u5217\u662F\u6620\u5C04\u7684\u7EC4\u4EF6\u6807\u8BC6\u7B26\u7684\u4E00\u90E8\u5206\u65F6\uFF0C\u628A\u5B83\u8BBE\u7F6E\u4E3Afalse\u3002\u6765\u544A\u8BC9Hibernate \u4E0D\u628A\u8BE5\u5217\u5305\u542B\u5728SQL insert\u8BED\u53E5\u4E2D\u3002
td5-1-6-1-1-1-5 = <code>formula</code> (\u53EF\u9009): \u4E00\u4E2A\u4EFB\u610F\u7684SQL\u8868\u8FBE\u5F0F\uFF0C\u5728\u7C7B\u578B\u5224\u65AD\u65F6\u6267\u884C\u3002\u53EF\u7528\u4E8E\u57FA\u4E8E\u5185\u5BB9\u7684\u9274\u522B\u5668\u3002
p5-1-6-1-1-7 = \u9274\u522B\u5217\u7684\u5B9E\u9645\u503C\u662F\u7531<code>&lt;class&gt;</code> \u548C <code>&lt;subclass&gt;</code> \u5143\u7D20\u7684discriminator-value\u5C5E\u6027\u5F97\u6765\u7684\u3002
p5-1-6-1-1-8 = \u4F7F\u7528 <code>formula</code> \u5C5E\u6027\uFF0C\u4F60\u53EF\u4EE5\u5B9A\u4E49\u4E00\u4E2A\u4EFB\u610F\u7684SQL\u8868\u8FBE\u5F0F\uFF0C\u7528\u6765\u5224\u65AD\u4E00\u884C\u6570\u636E\u7684\u7C7B\u578B\uFF1A
 
#		**********************************************************************************************************
#		5.1.6.2. Joined subclass strategy
#		**********************************************************************************************************

title5-1-6-2 = 5.1.6.2. \u94FE\u63A5\u5B50\u7C7B\u7B56\u7565
p5-1-6-2-1 = \u6BCF\u4E2A\u5B50\u7C7B\u53EF\u4EE5\u6620\u5C04\u4ED6\u81EA\u5DF1\u7684\u8868\u3002\u53C8\u88AB\u79F0\u4E3Atable-per-subclass \u6620\u5C04\u7B56\u7565\u3002 \u901A\u8FC7\u94FE\u63A5\u8BE5\u8868\u548C\u5176\u5176\u7236\u8868\u6765\u83B7\u53D6\u8BE5\u7C7B\u7684\u72B6\u6001\u3002\u5728\u8FD9\u79CD\u6620\u5C04\u7B56\u7565\u4E2D\u4E0D\u5728\u9700\u8981\u9274\u522B\u5217\uFF0C\u4F46\u662F\u6BCF\u4E2A\u5B50\u7C7B\u5FC5\u987B\u58F0\u660E\u4E00\u4E2A\u5217\u6765\u5B58\u50A8\u6807\u793A\u7B26\u3002\u8FD9\u4E2A\u8868\u7684\u4E3B\u952E\u662F\u7236\u8868\u7684\u5916\u952E\u3002\u7531 <code>@PrimaryKeyJoinColumns</code> \u6216\u8005<code>&lt;key&gt;</code> \u5143\u7D20\u6307\u5B9A\u3002
nc5-1-6-2-1 = \u8868\u540D\u9ED8\u8BA4\u662F\u7C7B\u7684\u6743\u9650\u5B9A\u540D\u3002 \u5982\u679C\u6CA1\u6709\u8BBE\u7F6E<code>@PrimaryKeyJoinColumn</code> \uFF0C\u90A3\u4E48\u4E3B\u952E/\u5916\u952E\u5217\u540D\u548C\u7236\u7C7B\u4E3B\u8868\u7684\u4E3B\u952E\u5217\u7684\u5217\u540D\u76F8\u540C\u3002
p5-1-6-2-2 = \u5728<code>hbm.xml</code>\u4E2D, \u4F7F\u7528<code>&lt;joined-subclass&gt;</code> \u5143\u7D20\u3002 \u4F8B\u5982:
td5-1-6-2-1-1 = <code>name</code>: \u5B50\u7C7B\u7684\u6743\u9650\u5B9A\u7C7B\u540D\u3002
td5-1-6-2-1-2 = <code>table</code>: \u5B50\u7C7B\u5BF9\u5E94\u7684\u8868\u540D\u3002
td5-1-6-2-1-3 = <code>proxy</code> (\u53EF\u9009): \u6307\u5B9A\u4E00\u4E2A\u7C7B\u6216\u8005\u63A5\u53E3\u7528\u4E8E\u61D2\u52A0\u8F7D\u4EE3\u7406\u3002
td5-1-6-2-1-4 = <code>lazy</code> (\u53EF\u9009, \u9ED8\u8BA4 true): \u8BBE\u7F6E lazy="false" \u7981\u7528\u61D2\u52A0\u8F7D\u3002
p5-1-6-2-3 = \u4F7F\u7528<code>&lt;key&gt;</code> \u5143\u7D20\u58F0\u660E\u4E3B\u952E/\u5916\u952E\u5217\u3002\u5728\u8FD9\u4E00\u7AE0\u5F00\u59CB\u7684\u6620\u5C04\u6587\u4EF6\u5E94\u8BE5\u88AB\u4FEE\u6539\u4E3A\uFF1A
p5-1-6-2-4 = \u5173\u4E8E\u7EE7\u627F\u6620\u5C04\u7684\u66F4\u591A\u4FE1\u606F\u53C2\u8003<a href="#c10">Chapter 10, \u7EE7\u627F\u6620\u5C04</a>.
 
#		**********************************************************************************************************
#		5.1.6.3. Table per class strategy
#		**********************************************************************************************************

title5-1-6-3 = 5.1.6.3. \u6BCF\u4E2A\u7C7B\u4E00\u5F20\u8868\u7B56\u7565
p5-1-6-3-1 = \u7B2C\u4E09\u79CD\u9009\u62E9\u662F\u5728\u7EE7\u627F\u5C42\u6B21\u7ED3\u6784\u4E2D\u7684\u6BCF\u4E2A\u5177\u4F53\u7C7B\u90FD\u6620\u5C04\u4E00\u5F20\u8868\u3002\u53C8\u88AB\u6210\u4E3A table-per-concrete-class \u7B56\u7565\u3002\u6BCF\u5F20\u8868\u5B9A\u4E49\u4E86\u5BF9\u5E94\u7C7B\u7684\u6240\u6709\u6301\u4E45\u5316\u72B6\u6001\uFF0C\u4E5F\u5305\u62EC\u7EE7\u627F\u7684\u72B6\u6001\u3002\u5728Hibernate\u4E2D, \u5E76\u4E0D\u9700\u8981\u5B8C\u5168\u663E\u793A\u7684\u6620\u5C04\u8FD9\u6837\u7684\u7EE7\u627F\u6811\u3002\u53EF\u4EE5\u628A\u6BCF\u4E2A\u7C7B\u4F5C\u4E3A\u5355\u72EC\u7684\u6839\u5B9E\u4F53\u6765\u6620\u5C04\u3002\u7136\u800C\uFF0C\u5982\u679C\u4F60\u60F3\u4F7F\u7528\u591A\u6001\u5173\u8054(\u4F8B\u5982\uFF0C\u5BF9\u7EE7\u627F\u7ED3\u6784\u4E2D\u8D85\u7C7B\u7684\u5173\u8054), \u4F60\u5E94\u8BE5\u4F7F\u7528\u8054\u5408\u5B50\u7C7B\u6620\u5C04\u3002
p5-1-6-3-2 = \u5728 <code>hbm.xml</code>\u4E2D:
td5-1-6-3-1-1 = <code>name</code>: \u5B50\u7C7B\u7684\u5168\u9650\u5B9A\u540D\u3002 
td5-1-6-3-1-2 = <code>table</code>: \u5B50\u7C7B\u7684\u8868\u540D\u3002
td5-1-6-3-1-3 = <code>proxy</code> (\u53EF\u9009): \u6307\u5B9A\u4E00\u4E2A\u7C7B\u6216\u8005\u63A5\u53E3\u7528\u4E8E\u61D2\u52A0\u8F7D\u4EE3\u7406\u3002
td5-1-6-3-1-4 = <code>lazy</code> (\u53EF\u9009, \u9ED8\u8BA4 true): \u8BBE\u7F6E lazy="false" \u7981\u7528\u61D2\u52A0\u8F7D\u3002
p5-1-6-3-3 = \u8FD9\u79CD\u6620\u5C04\u7B56\u7565\u4E0D\u9700\u8981\u6307\u5B9A\u9274\u522B\u6807\u8BC6\u5217\u3002
p5-1-6-3-4 = \u66F4\u591A\u7EE7\u627F\u6620\u5C04\u7684\u4FE1\u606F\u53C2\u8003<a href="#c10">Chapter 10, \u7EE7\u627F\u6620\u5C04</a>.
 
#		**********************************************************************************************************
#		5.1.6.4. Inherit properties from superclasses
#		**********************************************************************************************************

title5-1-6-4 = 5.1.6.4. \u4ECE\u7236\u7C7B\u7EE7\u627F\u5C5E\u6027
p5-1-6-4-1 = \u5728\u6CA1\u6709\u88AB\u6620\u5C04\u7684\u5B9E\u4F53(\u4F8B\u5982\uFF0C\u8BE5\u5B9E\u4F53\u6CA1\u6709\u5BF9\u5E94\u7684\u8868)\u7279\u5B9A\u7684\u4E1A\u52A1\u8D85\u7C7B\u4E4B\u95F4\u5171\u4EAB\u5C5E\u6027\u662F\u975E\u5E38\u6709\u7528\u7684\u3002\u51FA\u4E8E\u8FD9\u4E2A\u76EE\u7684\uFF0C\u4F60\u53EF\u4EE5\u4F7F\u7528<code>@MappedSuperclass</code>\u3002
p5-1-6-4-2 = \u5728\u6570\u636E\u5E93\u4E2D,\u8FD9\u4E2A\u5C42\u6B21\u7ED3\u6784\u5C06\u4F1A\u88AB\u8868\u793A\u4E3AOrder\u8868\uFF0C\u5E76\u4E14\u8868\u4E2D\u542B\u6709id, lastUpdate \u548C lastUpdater \u5217\u3002\u8D85\u7C7B\u7684\u5D4C\u5165\u7684\u5C5E\u6027\u7684\u6620\u5C04\u88AB\u590D\u5236\u5230\u4ED6\u4EEC\u5B50\u7C7B\u5B9E\u4F53\u4E2D\u3002\u8BB0\u4F4F\uFF0C\u53EF\u5D4C\u5165\u7684\u8D85\u7C7B\u4E0D\u662F\u7EE7\u627F\u7ED3\u6784\u7684\u6839\u3002.
nc5-1-6-4-1 = \u7236\u7C7B\u4E2D\u6CA1\u6709\u88AB\u6807\u8BB0\u4E3A<code>@MappedSuperclass</code>\u7684\u5C5E\u6027\u4F1A\u88AB\u5FFD\u7565\u3002
nc5-1-6-4-2 = \u9664\u975E\u4F7F\u7528 <code>@Access</code>\u6CE8\u89E3\uFF0C\u5426\u5219\u4F7F\u7528\u9ED8\u8BA4\u7684\u8BBF\u95EE\u7C7B\u578B(\u81EA\u52A8\u6216\u8005\u65B9\u6CD5)\u3002
nc5-1-6-4-3 = \u76F8\u540C\u7684\u6982\u5FF5\u53EF\u4EE5\u88AB\u7528\u5728<code>@Embeddable</code>\u5BF9\u8C61\u4ECE\u7236\u7C7B\u7EE7\u627F\u5C5E\u6027\u4E2D\u3002\u8FD9\u4E5F\u9700\u8981\u4F7F\u7528<code>@MappedSuperclass</code>\u6765\u5B8C\u6210\u3002(\u5230\u76EE\u524D\u4E3A\u6B62\uFF0C\u8FD8\u4E0D\u662F\u6807\u51C6\u7684EJB3\u7279\u6027)
nc5-1-6-4-4 = \u5141\u8BB8\u5728\u4E00\u4E2A\u7C7B\u4E0A\u4F7F\u7528<code>@MappedSuperclass</code>\uFF0C\u8FD9\u4E2A\u7C7B\u53EF\u4EE5\u5728\u7EE7\u627F\u7ED3\u6784\u6620\u5C04\u7684\u4E2D\u95F4\u3002
nc5-1-6-4-5 =  \u7EE7\u627F\u7ED3\u6784\u4E2D\u6240\u6709\u6CA1\u88AB <code>@MappedSuperclass</code> \u6216 <code>@Entity</code> \u6807\u8BB0\u7684\u7C7B\u5C06\u4F1A\u88AB\u5FFD\u7565\u3002
p5-1-6-4-3 = \u4F60\u53EF\u4EE5\u901A\u8FC7<code>@AttributeOverride</code> \u6CE8\u89E3\u8986\u76D6\u5B9E\u4F53\u7236\u7C7B\u4E2D\u5B9A\u4E49\u7684\u5217\uFF0C\u8FD9\u4E2A\u6CE8\u89E3\u53EA\u80FD\u5728\u7EE7\u627F\u5C42\u6B21\u7ED3\u6784\u7684\u9876\u7AEF\u4F7F\u7528\u3002
p5-1-6-4-4 = \u5728\u4E0A\u9762\u8FD9\u4E2A\u4F8B\u5B50\u4E2D\uFF0Caltitude\u5C5E\u6027\u7684\u503C\u6700\u7EC8\u5C06\u6301\u4E45\u5316\u5230Plane\u8868\u7684fld_altitude\u5217\u3002\u800C\u540D\u4E3Apropulsion\u7684\u5173\u8054\u5219\u4FDD\u5B58\u5728fld_propulsion_fk\u5916\u952E\u5217\u3002
p5-1-6-4-5 =  \u4F60\u53EF\u4EE5\u5728<code>@Entity</code>\uFF0C<code>@MappedSuperclass</code> \u4EE5\u53CA\u90A3\u4E9B\u5BF9\u8C61\u4E3A <code>@Embeddable</code>\u7684\u5C5E\u6027\u5B9A\u4E49<code>@AttributeOverride(s)</code> \u548C <code>@AssociationOverride(s)</code>\u3002
p5-1-6-4-6 = \u5728<code>hbm.xml</code>\u4E2D, \u53EA\u9700\u8981\u7B80\u5355\u5728\u9700\u8981\u7EE7\u627F\u4ED6\u4EEC\u7684\u5B9E\u4F53\u4E2D\u4F7F\u7528 <code>&lt;class&gt;</code> \u5143\u7D20\u6765\u6620\u5C04\u8D85\u7C7B\u7684\u5C5E\u6027\u3002
 
#		**********************************************************************************************************
#		5.1.6.5. Mapping one entity to several tables
#		**********************************************************************************************************

title5-1-6-5 = 5.1.6.5. \u4E00\u4E2A\u5B9E\u4F53\u6620\u5C04\u5230\u591A\u5F20\u8868
p5-1-6-5-1 = \u867D\u7136\u5728\u4E00\u4E2A\u5168\u65B0\u7684\u6A21\u5F0F\u4E2D\u4E0D\u63A8\u8350\u8FD9\u6837\u505A\uFF0C\u4F46\u662F\u6709\u4E9B\u9057\u7559\u7684\u6570\u636E\u5E93\u4F1A\u5F3A\u8FEB\u4F60\u6620\u5C04\u5355\u4E2A\u5B9E\u4F53\u5230\u591A\u5F20\u8868\u3002
p5-1-6-5-2 = \u4F7F\u7528\u7C7B\u7EA7\u7684 @SecondaryTable \u6216 @SecondaryTables \u6CE8\u89E3\u3002\u7528<code>@Column</code> \u6216 <code>@JoinColumn</code>\u7684table\u53C2\u6570\u6765\u8868\u660E\u67D0\u4E2A\u5217\u5728\u4E00\u4E2A\u7279\u5B9A\u7684\u8868\u4E2D\u3002
p5-1-6-5-3 = \u5728\u8FD9\u4E2A\u793A\u4F8B\u4E2D, name\u4FDD\u5B58\u5728MainCat\u8868\u4E2D, storyPart1\u4FDD\u5B58\u5728Cat1\u8868\u4E2D, storyPart2\u4FDD\u5B58\u5728Cat2\u8868\u4E2D. Cat1\u8868\u901A\u8FC7\u5916\u952Ecat_id\u548CMainCat\u8868\u5173\u8054, Cat2\u8868\u901A\u8FC7id\u5217\u548CMainCat\u8868\u5173\u8054 (\u548CMainCat\u7684id\u5217\u540C\u540D). \u5BF9storyPart2\u5217\u8FD8\u5B9A\u4E49\u4E86\u552F\u4E00\u7EA6\u675F\u3002
p5-1-6-5-4 = \u4F7F\u7528<code>@org.hibernate.annotations.Table</code> \u6CE8\u89E3\u53EF\u4EE5\u505A\u4E00\u4E9B\u4F18\u5316\u8C03\u6574:
li5-1-6-5-1-1 = <code>fetch</code>: \u5982\u679C\u8BBE\u4E3AJOIN, \u4E5F\u662F\u9ED8\u8BA4\u7684, Hibernate\u5C06\u4F1A\u4F7F\u7528\u5185\u8FDE\u63A5\u6765\u6293\u53D6\u6709\u4E00\u4E2A\u7C7B\u6216\u8005\u4ED6\u7684\u8D85\u7C7B\u5B9A\u4E49\u7684\u4E8C\u7EA7\u8868\uFF0C\u4F7F\u7528\u5916\u8FDE\u63A5\u6293\u53D6\u7531\u5B50\u7C7B\u5B9A\u4E49\u7684\u8033\u4E8C\u7EA7\u8868\u3002\u5982\u679C\u8BBE\u7F6E\u4E3ASELECT\uFF0C\u5F53\u8FD9\u884C\u6570\u636E\u662F\u5B50\u7C7B\u7684\u5B9E\u4F8B\u65F6\uFF0CHibernate\u5C06\u4F1A\u5728\u7531\u7236\u7C7B\u5B9A\u4E49\u7684\u4E8C\u7EA7\u8868\u4E0A\u4F7F\u7528\u8FDE\u7EED\u67E5\u8BE2\u3002\u5F53\u68C0\u7D22\u7531\u7C7B\u53CA\u5176\u7236\u7C7B\u5B9A\u4E49\u7684\u4E8C\u7EA7\u8868\u65F6\uFF0C\u5C06\u4F1A\u4E00\u76F4\u4F7F\u7528\u5185\u8FDE\u63A5\u3002
li5-1-6-5-1-2 = <code>inverse</code>: \u5982\u679C\u4E3Atrue, Hibernate\u5C06\u4E0D\u4F1A\u901A\u8FC7\u6B64\u94FE\u63A5\u6765\u63D2\u5165\u6216\u66F4\u65B0\u5C5E\u6027\uFF0C\u9ED8\u8BA4\u662Ffalse\u3002 
li5-1-6-5-1-3 = <code>optional</code>: \u5982\u679C\u542F\u7528 (\u9ED8\u8BA4\u7684), \u5982\u679C\u6253\u5F00\uFF0CHibernate \u53EA\u4F1A\u5728\u6B64\u8FDE\u63A5\u5B9A\u4E49\u7684\u5C5E\u6027\u975E\u7A7A\u65F6\u63D2\u5165\u4E00\u884C\u6570\u636E\uFF0C\u5E76\u4E14\u603B\u662F\u4F7F\u7528\u4E00\u4E2A\u5916\u8FDE\u63A5\u6765\u5F97\u5230\u8FD9\u4E9B\u5C5E\u6027\u3002
li5-1-6-5-1-4 = <code>foreignKey</code>: \u5B9A\u4E49\u4E8C\u7EA7\u8868\u6307\u5411\u4E3B\u8868\u7684\u5916\u952E\u540D\u3002
p5-1-6-5-5 = \u786E\u4FDD\u5728appliesto\u5C5E\u6027\u4E0A\u4F7F\u7528\u4E8C\u7EA7\u8868\u7684\u540D\u5B57
p5-1-6-5-6 = \u5728 <code>hbm.xml</code>\u4E2D, \u4F7F\u7528 <code>&lt;join&gt;</code> \u5143\u7D20\u3002
td5-1-6-5-1-1 = <code>table</code>: \u8FDE\u63A5\u8868\u7684\u540D\u5B57\u3002
td5-1-6-5-1-2 = <code>schema</code> (\u53EF\u9009): \u8986\u5199\u7531\u6839 <hibernate-mapping> \u5143\u7D20\u6307\u5B9A\u7684\u6A21\u5F0F\u540D\u3002
td5-1-6-5-1-3 = <code>catalog</code> (\u53EF\u9009): \u8986\u5199\u7531\u6839 <hibernate-mapping> \u5143\u7D20\u6307\u5B9A\u7684catalog\u540D\u3002
td5-1-6-5-1-4 = <code>fetch</code> (\u53EF\u9009 - \u9ED8\u8BA4join): \u5982\u679C\u8BBE\u7F6E\u4E3A\u9ED8\u8BA4\u503Cjoin\uFF0C Hibernate \u5C06\u4F7F\u7528\u4E00\u4E2A\u5185\u8FDE\u63A5\u6765\u5F97\u5230\u8FD9\u4E2A\u7C7B\u6216\u5176\u8D85\u7C7B\u5B9A\u4E49\u7684<join>\uFF0C\u800C\u4F7F\u7528\u4E00\u4E2A\u5916\u8FDE\u63A5\u6765\u5F97\u5230\u5176\u5B50\u7C7B\u5B9A\u4E49\u7684<join>\u3002\u5982\u679C\u8BBE\u7F6E\u4E3Aselect\uFF0C\u5219 Hibernate \u5C06\u4E3A\u5B50\u7C7B\u5B9A\u4E49\u7684 <join>\u4F7F\u7528\u987A\u5E8F\u9009\u62E9\u3002\u8FD9\u4EC5\u5728\u4E00\u884C\u6570\u636E\u8868\u793A\u4E00\u4E2A\u5B50\u7C7B\u7684\u5BF9\u8C61\u7684\u65F6\u5019\u624D\u4F1A\u53D1\u751F\u3002\u5BF9\u8FD9\u4E2A\u7C7B\u548C\u5176\u8D85\u7C7B\u5B9A\u4E49\u7684<join>\uFF0C\u4F9D\u7136\u4F1A\u4F7F\u7528\u5185\u8FDE\u63A5\u5F97\u5230\u3002
td5-1-6-5-1-5 = <code>inverse</code> (\u53EF\u9009 - \u9ED8\u8BA4 false): \u5982\u679C\u6253\u5F00\uFF0CHibernate \u4E0D\u4F1A\u63D2\u5165\u6216\u8005\u66F4\u65B0\u6B64\u8FDE\u63A5\u5B9A\u4E49\u7684\u5C5E\u6027\u3002
td5-1-6-5-1-6 = <code>optional</code> (\u53EF\u9009 - \u9ED8\u8BA4 false): \u5982\u679C\u6253\u5F00\uFF0CHibernate \u53EA\u4F1A\u5728\u6B64\u8FDE\u63A5\u5B9A\u4E49\u7684\u5C5E\u6027\u975E\u7A7A\u65F6\u63D2\u5165\u4E00\u884C\u6570\u636E\uFF0C\u5E76\u4E14\u603B\u662F\u4F7F\u7528\u4E00\u4E2A\u5916\u8FDE\u63A5\u6765\u5F97\u5230\u8FD9\u4E9B\u5C5E\u6027\u3002
p5-1-6-5-7 = \u4F8B\u5982, \u4E00\u4E2A\u4EBA(person)\u7684\u5730\u5740(address)\u4FE1\u606F\u53EF\u4EE5\u88AB\u6620\u5C04\u5230\u5355\u72EC\u7684\u8868\u4E2D(\u5E76\u4FDD\u7559\u6240\u6709\u5C5E\u6027\u7684\u503C\u7C7B\u578B\u8BED\u4E49)\uFF1A
p5-1-6-5-8 = \u6B64\u7279\u6027\u5E38\u5E38\u5BF9\u9057\u7559\u6570\u636E\u6A21\u578B\u6709\u7528\u3002\u6211\u4EEC\u63A8\u8350\u8868\u4E2A\u6570\u6BD4\u7C7B\u4E2A\u6570\u5C11\uFF0C\u4EE5\u53CA\u7EC6\u7C92\u5EA6\u7684\u9886\u57DF\u6A21\u578B\u3002\u7136\u800C\uFF0C\u5728\u5355\u72EC\u7684\u7EE7\u627F\u6811\u4E0A\u5207\u6362\u7EE7\u627F\u6620\u5C04\u7B56\u7565\u662F\u6709\u7528\u7684\uFF0C\u540E\u9762\u4F1A\u89E3\u91CA\u8FD9\u70B9\u3002
 
#		**********************************************************************************************************
#		5.1.7. Mapping one to one and one to many associations
#		**********************************************************************************************************

title5-1-7 = 5.1.7. \u6620\u5C04 \u4E00\u5BF9\u4E00 \u548C\u4E00\u5BF9\u591A\u5173\u8054
p5-1-7-1 = \u94FE\u63A5\u4E00\u4E2A\u5B9E\u4F53\u5230\u53E6\u4E00\u4E2A\u5B9E\u4F53, \u4F60\u9700\u8981\u6620\u5C04\u5173\u8054\u5C5E\u6027\u4E3A\u4E00\u4E2A \u5230\u4E00 \u7684\u5173\u8054\u3002\u5728\u8FD9\u79CD\u5173\u8054\u6A21\u578B\u4E2D\uFF0C\u4F60\u53EF\u4EE5\u4F7F\u7528\u5916\u952E\u6216\u8005\u4E00\u5F20\u6302\u94FE\u8868\uFF0C\u6216\u8005\u662F\u4E24\u4E2A\u5B9E\u4F53\u5171\u4EAB\u76F8\u540C\u7684\u4E3B\u952E(\u4E0D\u592A\u5E38\u7528)\u3002
p5-1-7-2 = \u4F7F\u7528<code>@ManyToOne</code> \u6216\u8005 <code>@OnetoOne</code>\u6765\u6807\u8BB0\u4E00\u4E2A\u5173\u8054\u3002
p5-1-7-3 = <code>@ManyToOne</code> \u548C <code>@OneToOne</code> \u6709\u4E00\u4E2AtargetEntity \u5C5E\u6027\uFF0C\u8FD9\u4E2A\u5C5E\u6027\u6307\u5B9A\u4E86\u76EE\u6807\u5B9E\u4F53\u7684\u540D\u5B57\u3002\u56E0\u4E3A\u5728\u5927\u90E8\u5206\u60C5\u51B5\u4E0B\u9ED8\u8BA4\u503C(\u8868\u793A\u5173\u8054\u5173\u7CFB\u7684\u5C5E\u6027\u7C7B\u578B)\u5C31\u53EF\u4EE5\u5F88\u597D\u7684\u6EE1\u8DB3\u8981\u6C42\u4E86\u3002\u4E0D\u8FC7\u4E0B\u9762\u8FD9\u79CD\u60C5\u51B5\u4E0B\u8FD9\u4E2A\u53C2\u6570\u5C31\u663E\u5F97\u6709\u610F\u4E49\u4E86\uFF1A\u4F7F\u7528\u63A5\u53E3\u4F5C\u4E3A\u8FD4\u56DE\u503C\u800C\u4E0D\u662F\u5E38\u89C1\u7684\u5B9E\u4F53\u3002
p5-1-7-4 = cascade\u5C5E\u6027\u8BBE\u7F6E\u4E3A\u9664\u4E86none\u4EE5\u5916\u4EFB\u4F55\u6709\u610F\u4E49\u7684\u503C\uFF0C\u5B83\u5C06\u628A\u7279\u5B9A\u7684\u64CD\u4F5C\u4F20\u9012\u5230\u5173\u8054\u5BF9\u8C61\u4E2D\u3002\u8FD9\u79CD\u6709\u610F\u4E49\u7684\u503C\u5206\u4E3A\u4E09\u79CD\uFF1A
li5-1-7-1-1 = \u57FA\u672C\u64CD\u4F5C,\u5305\u62EC: <code>persist</code>, <code>merge</code>, <code>delete</code>, <code>save-update</code>, <code>evict</code>, <code>replicate</code>, <code>lock</code> \u548C <code>refresh</code>;
li5-1-7-1-2 = \u7279\u6B8A\u7684\u503C: delete-orphan \u6216\u8005 all ; 
li5-1-7-1-3 = \u9017\u53F7\u5206\u9694\u7684\u64CD\u4F5C: <code>cascade="persist"</code>,<code>merge</code>,<code>evict</code>. \u6216\u8005 <code>cascade="all,delete-orphan"</code>. \u8BE6\u7EC6\u4FE1\u606F\u53C2\u8003 <a href="#c11-11">Section 11.11, \u201C\u6301\u4E45\u5316\u7684\u4F20\u64AD\u201D</a> \u3002\u5355\u503C\u5173\u8054\u7684many-to-one\u4E0D\u652F\u6301\u5220\u9664\u5B64\u513F\u3002
p5-1-7-5 = \u9ED8\u8BA4\uFF0C\u5355\u5411\u7684\u5173\u8054\u5728JPA2\u4E2D\u4F7F\u7528\u9965\u6E34\u52A0\u8F7D\u3002 \u4F60\u53EF\u4EE5\u4F7F\u7528<code>@ManyToOne(fetch=FetchType.LAZY)</code>\u6765\u628A\u5B83\u6807\u8BB0\u4E3A\u61D2\u52A0\u8F7D\uFF0C\u5728\u8FD9\u79CD\u60C5\u51B5\u4E0B\uFF0CHibernate\u4F1A\u4EE3\u7406\u5173\u8054\uFF0C\u5E76\u4E14\u5728\u5173\u8054\u5B9E\u4F53\u662F\u53EF\u8FBE\u7684\u65F6\u5019\u52A0\u8F7D\u5B83\u3002\u4F60\u53EF\u4EE5\u4F7F\u7528<code>@LazyToOne(NO_PROXY)</code>\u6765\u5F3A\u5236Hibernate\u4E0D\u9002\u7528\u4EE3\u7406\u3002\u8FD9\u65F6\uFF0C\u5F53\u5B9E\u4F8B\u53D8\u91CF\u7B2C\u4E00\u6B21\u88AB\u8BBF\u95EE\u65F6\uFF0C\u5C5E\u6027\u5EF6\u8FDF\u52A0\u8F7D\u3002 \u8FD9\u9700\u8981\u6784\u5EFA\u65F6\u5B57\u8282\u7801\u7F16\u8BD1\u5668\u3002 <code>lazy="false"</code> \u8868\u660E\u5173\u8054\u6C38\u8FDC\u88AB\u9965\u6E34\u52A0\u8F7D\u3002
p5-1-7-6 = \u5728JPA\u7684\u9ED8\u8BA4\u9009\u9879\u4E2D, \u5982\u679C\u88AB\u8BBE\u7F6E\u4E3ALAZY\uFF0C\u5355\u8282\u70B9\u7684\u5173\u8054\u5C06\u4F1A\u4F7F\u7528\u5B50\u67E5\u8BE2\u6765\u52A0\u8F7D\uFF0C\u5982\u679C\u88AB\u8BBE\u7F6E\u4E3AEAGER\uFF0C\u5C06\u4F1A\u4F7F\u7528SQL\u94FE\u63A5\u8BED\u53E5\u3002 \u7136\u800C\u4F60\u53EF\u4EE5\u8C03\u6574\u6293\u53D6\u7B56\u7565\uFF0C \u4F8B\u5982\uFF0C\u4F7F\u7528 <code>@Fetch</code>\u6765\u51B3\u5B9A\u83B7\u53D6\u7B56\u7565\u3002 FetchMode \u53EF\u4EE5\u662F SELECT (\u5728\u52A0\u8F7D\u5173\u8054\u65F6\u4F7F\u7528\u67E5\u8BE2) \u6216\u8005 JOIN (\u4F7F\u7528 SQL JOIN \u5728\u52A0\u8F7D\u5B9E\u4F53\u7684\u540C\u65F6\u52A0\u8F7D\u5173\u8054)\u3002JOIN \u8986\u5199\u4E86\u4EFB\u4F55lazy\u5C5E\u6027 (\u901A\u8FC7JOIN\u7B56\u7565\u52A0\u8F7D\u7684\u5173\u8054\u4E0D\u53EF\u4EE5\u662FLazy\u7684)\u3002
 
#		**********************************************************************************************************
#		5.1.7.1. Using a foreign key or an association table
#		**********************************************************************************************************

title5-1-7-1 = 5.1.7.1. \u4F7F\u7528\u5916\u952E\u6216\u8005\u5173\u8054\u8868
p5-1-7-1-1 = \u5230\u4E00\u4E2A\u6301\u4E45\u5316\u7C7B\u7684\u666E\u901A\u5173\u8054\u4F7F\u7528\u4EE5\u4E0B\u5B9A\u4E49\uFF1A
li5-1-7-1-1-1 = <code>@ManyToOne</code> \u5982\u679C\u591A\u4E2A\u5B9E\u4F53\u6307\u5411\u76EE\u6807\u5B9E\u4F53
li5-1-7-1-1-2 = <code>@OneToOne</code>. \u5982\u679C\u53EA\u6709\u4E00\u4E2A\u5B9E\u4F53\u6307\u5411\u76EE\u6807\u5B9E\u4F53\u3002
p5-1-7-1-2 = \u5E76\u4E14\u4E00\u4E2A\u8868\u7684\u5916\u952E\u5F15\u7528\u76EE\u6807\u8868\u7684\u4E3B\u952E\u3002 
p5-1-7-1-3 = <code>@JoinColumn</code> \u5C5E\u6027\u662F\u53EF\u9009\u7684\uFF0C\u5173\u8054\u5B57\u6BB5\u7684\u9ED8\u8BA4\u503C,\u5217\u540D\u4E3A\uFF1A\u4E3B\u4F53\u7684\u5173\u8054\u5C5E\u6027\u540D\uFF0B\u4E0B\u5212\u7EBF\uFF0B\u88AB\u5173\u8054\u7AEF\u7684\u4E3B\u952E\u5217\u540D.\u5728\u8FD9\u4E2A\u4F8B\u5B50\u4E2D\u662F <code>company_id</code> \u56E0\u4E3A\u5173\u8054\u7684\u5C5E\u6027\u662Fcompany, Company\u7684\u4E3B\u952E\u662Fid\u3002
p5-1-7-1-4 = \u5BF9\u4E8E\u591A\u5BF9\u4E00\u4E5F\u53EF\u4EE5\u901A\u8FC7\u5173\u8054\u8868\u7684\u65B9\u5F0F\u6765\u6620\u5C04\u3002\u901A\u8FC7<code>@JoinTable</code>\u6CE8\u89E3\u53EF\u5B9A\u4E49\u5173\u8054\u8868\uFF0C\u8BE5\u5173\u8054\u8868\u5305\u542B\u4E86\u6307\u56DE\u5B9E\u4F53\u8868\u7684\u5916\u952E(\u901A\u8FC7<code>@JoinTable.joinColumns</code>) \u4EE5\u53CA\u6307\u5411\u76EE\u6807\u5B9E\u4F53\u8868\u7684\u5916\u952E(\u901A\u8FC7<code>@JoinTable.inverseJoinColumns</code>)\u3002
nc5-1-7-1-1-1 = \u53EF\u4EE5\u4F7F\u7528\u6A21\u62DFSQL\u7247\u6BB5\u901A\u8FC7 <code>@JoinColumnOrFormula / @JoinColumnOrformulas</code> \u6CE8\u89E3\u6765\u6A21\u62DF\u7269\u7406\u8FDE\u63A5(\u5C31\u50CF\u4F60\u53EF\u4EE5\u4F7F\u7528 <code>@Formula</code> \u6CE8\u89E3\u6765\u6A21\u62DF\u4E00\u4E2A\u5C5E\u6027\u5217\u4E00\u6837)\u3002
p5-1-7-1-5 = \u53EF\u4EE5\u4F7F\u7528optional=false \u5C5E\u6027\u628A\u4E00\u4E2A\u5173\u8054\u6807\u8BB0\u4E3A\u5FC5\u987B\u7684\u3002\u6211\u4EEC\u63A8\u8350\u4F7F\u7528Bean\u9A8C\u8BC1\u7684 @NotNull\u6CE8\u89E3\u4F5C\u4E3A\u66F4\u597D\u7684\u9009\u62E9\u3002\u56E0\u6B64\uFF0C\u5916\u952E\u5217\u5C06\u4F1A\u88AB\u6807\u8BB0\u4E3A\u975E\u7A7A\u7684\uFF08\u5982\u679C\u6709\u53EF\u80FD\u7684\u8BDD\uFF09\u3002
p5-1-7-1-6 = \u5982\u679C\u88AB\u5173\u8054\u7684\u5143\u7D20\u5728\u6570\u636E\u8868\u4E2D\u4E0D\u5B58\u5728\uFF08\u5173\u8054\u5217\u4E0Aid\u9519\u8BEF\uFF09\uFF0CHibernate\u5C31\u4E0D\u80FD\u591F\u89E3\u6790\u8FD9\u4E2A\u5173\u8054\uFF0C\u5E76\u4E14\u4F1A\u629B\u51FA\u5F02\u5E38\u3002\u8FD9\u5BF9\u4E8E\u9057\u7559\u6216\u8005\u4E25\u683C\u7EF4\u62A4\u7684\u6A21\u5F0F\u4E2D\u662F\u975E\u5E38\u4E0D\u65B9\u4FBF\u7684\u3002 \u4F60\u53EF\u4EE5\u4F7F\u7528<code>@NotFound</code> \u6CE8\u89E3\u8BA9Hibernate\u5FFD\u7565\u8FD9\u4E2A\u5143\u7D20\u800C\u4E0D\u662F\u629B\u51FA\u5F02\u5E38\u3002
p5-1-7-1-7 = \u5F53\u4E00\u4E2A\u7ED9\u5B9A\u5B9E\u4F53\u88AB\u5220\u9664\u65F6\uFF0C\u6709\u65F6\u5019\u5E0C\u671B\u628A\u7EA7\u8054\u5220\u9664\u59D4\u6258\u7ED9\u6570\u636E\u5E93\u3002\u5728\u8FD9\u79CD\u60C5\u51B5\u4E0BHibernate\u4F1A\u5728\u6570\u636E\u5E93\u7EA7\u522B\u4E0A\u751F\u6210\u7EA7\u8054\u5220\u9664\u7EA6\u675F\u3002
p5-1-7-1-8 = \u5916\u952E\u7EA6\u675F, \u5F53\u7531Hibernate\u751F\u6210\u65F6, \u540D\u5B57\u6CA1\u6709\u53EF\u8BFB\u6027\u3002\u4F60\u53EF\u4EE5\u4F7F\u7528<code>@ForeignKey</code>\u6765\u8986\u5199\u8FD9\u4E2A\u7EA6\u675F\u540D\u3002
p5-1-7-1-9 = \u6709\u65F6\u5019, \u4F60\u5E0C\u671B\u4E00\u4E2A\u5B9E\u4F53\u5F15\u7528\u53E6\u5916\u7684\u5B9E\u4F53\uFF0C\u4F46\u662F\u4E0D\u662F\u901A\u8FC7\u76EE\u6807\u5B9E\u4F53\u7684\u4E3B\u952E\u5173\u8054\uFF0C\u800C\u662F\u901A\u8FC7\u67D0\u4E2A\u552F\u4E00\u952E\u5173\u8054\u3002\u4F60\u53EF\u4EE5\u5728<code>@JoinColumn.referenceColumnName</code>\u4E2D\u5F15\u7528\u8FD9\u4E2A\u552F\u4E00\u952E\u6765\u5B9E\u73B0\u3002
p5-1-7-1-10 = \u4F46\u662F\u5E76\u4E0D\u9F13\u52B1\u8FD9\u6837\u505A\uFF0C\u5E94\u8BE5\u6309\u7167\u539F\u6765\u7684\u6620\u5C04\u3002
p5-1-7-1-11 = \u5728<code>hbm.xml</code>\u4E2D, \u4F7F\u7528\u76F8\u4F3C\u7684\u65B9\u5F0F\u6620\u5C04\u5173\u8054\u3002\u4E3B\u8981\u7684\u533A\u522B\u5728\u4E8E<code>@OneToOne</code> \u88AB\u6620\u5C04\u6210 <code>&lt;many-to-one unique="true"/&gt;</code>, \u6211\u4EEC\u6765\u6DF1\u5165\u8BA8\u8BBA\u3002
td5-1-7-1-1-1 = <code>name</code>: \u5C5E\u6027\u540D\u3002
td5-1-7-1-1-2 = <code>column</code> (\u53EF\u9009): \u5916\u952E\u5217\u540D\u3002 \u4E5F\u53EF\u4EE5\u901A\u8FC7\u5D4C\u5165\u7684<code>&lt;column&gt;</code> \u5143\u7D20\u6307\u5B9A\u3002
td5-1-7-1-1-3 = <code>class</code> (\u53EF\u9009 - \u9ED8\u8BA4\u901A\u8FC7\u53CD\u5C04\u83B7\u53D6\u7684\u5C5E\u6027\u7C7B\u578B): \u5173\u8054\u7C7B\u7684\u540D\u5B57\u3002
td5-1-7-1-1-4 = <code>cascade</code> (\u53EF\u9009): \u6307\u5B9A\u4ECE\u7236\u5BF9\u8C61\u5230\u5173\u8054\u5BF9\u8C61\uFF0C\u5E94\u8BE5\u7EA7\u8054\u54EA\u4E9B\u64CD\u4F5C\u3002
td5-1-7-1-1-5 = <code>fetch</code> (\u53EF\u9009 - \u9ED8\u8BA4 select): \u9009\u62E9 outer-join \u6293\u53D6 \u6216 \u8FDE\u7EED\u7684\u67E5\u8BE2\u8BED\u53E5\u6293\u53D6\u3002
td5-1-7-1-1-6 = <code>update, insert</code> (\u53EF\u9009 - \u9ED8\u8BA4 true): \u8868\u660E\u6620\u5C04\u7684\u5217\u5E94\u8BE5\u5305\u542B\u5728update \u548Cinsert sql\u8BED\u53E5\u4E2D\u3002\u5982\u679C\u90FD\u8BBE\u7F6E\u4E3Afalse,\u5219\u5141\u8BB8\u4F7F\u7528\u4E00\u4E2A\u5B8C\u5168\u6D3E\u751F\u7684\u5C5E\u6027\uFF0C\u5B83\u7684\u503C\u7531\u548C\u5B83\u6620\u5C04\u5230\u76F8\u540C\u5217\u7684\u5C5E\u6027\u6216\u8005\u7531\u4E00\u4E2A\u89E6\u53D1\u5668\u6216\u5176\u4ED6\u5E94\u7528\u6307\u5B9A\u3002
td5-1-7-1-1-7 = <code>property-ref</code> (\u53EF\u9009): \u8FDE\u63A5\u5230\u5916\u952E\u7684\u5173\u8054\u7C7B\u7684\u5C5E\u6027\u540D\u3002\u5982\u679C\u6CA1\u6709\u6307\u5B9A\uFF0C\u9ED8\u8BA4\u4F7F\u7528\u5173\u8054\u7C7B\u7684\u4E3B\u952E\u3002
td5-1-7-1-1-8 = <code>access</code> (\u53EF\u9009 - \u9ED8\u8BA4 property): Hibernate\u8BBF\u95EE\u5C5E\u6027\u503C\u7684\u7B56\u7565\u3002
td5-1-7-1-1-9 = <code>unique</code> (\u53EF\u9009): \u4E3A\u5916\u952E\u5217\u4F7F\u7528DDL\u751F\u6210\u552F\u4E00\u7EA6\u675F\u3002\u901A\u8FC7\u628Aproperty-ref\u7684\u76EE\u6807\u8BBE\u7F6E\u4E3A\u552F\u4E00\u7684\uFF0C\u53EF\u4EE5\u5B9E\u73B0\u591A\u91CD\u7684\u4E00\u5BF9\u4E00\u3002
td5-1-7-1-1-10 = <code>not-null</code> (\u53EF\u9009): \u4F7F\u7528DDL\u4E3A\u8BE5\u5B57\u6BB5\u6DFB\u52A0\u53EF\u5426\u4E3A\u7A7A\uFF08nullability\uFF09\u7684\u7EA6\u675F\u3002
td5-1-7-1-1-11 = <code>optimistic-lock</code> (\u53EF\u9009 - \u9ED8\u8BA4 true):\u6307\u5B9A\u8FD9\u4E2A\u5C5E\u6027\u5728\u505A\u66F4\u65B0\u65F6\u662F\u5426\u9700\u8981\u83B7\u5F97\u4E50\u89C2\u9501\u5B9A\uFF08optimistic lock\uFF09\u3002\u6362\u53E5\u8BDD\u8BF4\uFF0C\u5B83\u51B3\u5B9A\u8FD9\u4E2A\u5C5E\u6027\u53D1\u751F\u810F\u6570\u636E\u65F6\u7248\u672C\uFF08version\uFF09\u7684\u503C\u662F\u5426\u589E\u957F\u3002
td5-1-7-1-1-12 = <code>lazy</code> (\u53EF\u9009 - \u9ED8\u8BA4proxy):\u9ED8\u8BA4\u60C5\u51B5\u4E0B\uFF0C\u5355\u70B9\u5173\u8054\u662F\u7ECF\u8FC7\u4EE3\u7406\u7684\u3002lazy="no-proxy"\u6307\u5B9A\u6B64\u5C5E\u6027\u5E94\u8BE5\u5728\u5B9E\u4F8B\u53D8\u91CF\u7B2C\u4E00\u6B21\u88AB\u8BBF\u95EE\u65F6\u5E94\u8BE5\u5EF6\u8FDF\u6293\u53D6\uFF08fetche lazily\uFF09\uFF08\u9700\u8981\u8FD0\u884C\u65F6\u5B57\u8282\u7801\u7684\u589E\u5F3A\uFF09\u3002 lazy="false"\u6307\u5B9A\u6B64\u5173\u8054\u603B\u662F\u88AB\u9884\u5148\u6293\u53D6\u3002
td5-1-7-1-1-13 = <code>not-found</code> (\u53EF\u9009 - \u9ED8\u8BA4 exception): \u6307\u5B9A\u5916\u952E\u5F15\u7528\u7684\u6570\u636E\u4E0D\u5B58\u5728\u65F6\u5982\u4F55\u5904\u7406\uFF1A ignore\u4F1A\u5C06\u884C\u6570\u636E\u4E0D\u5B58\u5728\u89C6\u4E3A\u4E00\u4E2A\u7A7A\uFF08null\uFF09\u5173\u8054\u3002
td5-1-7-1-1-14 = <code>entity-name</code> (\u53EF\u9009): \u88AB\u5173\u8054\u7684\u7C7B\u7684\u5B9E\u4F53\u540D\u3002
td5-1-7-1-1-15 = <code>formula</code> (\u53EF\u9009): SQL\u8868\u8FBE\u5F0F\uFF0C\u7528\u4E8E\u5B9A\u4E49computed\uFF08\u8BA1\u7B97\u51FA\u7684\uFF09\u5916\u952E\u503C\u3002
p5-1-7-1-12 = cascade\u5C5E\u6027\u8BBE\u7F6E\u4E3A\u9664\u4E86none\u4EE5\u5916\u4EFB\u4F55\u6709\u610F\u4E49\u7684\u503C\uFF0C\u5B83\u5C06\u628A\u7279\u5B9A\u7684\u64CD\u4F5C\u4F20\u9012\u5230\u5173\u8054\u5BF9\u8C61\u4E2D\u3002\u8FD9\u79CD\u503C\u88AB\u5206\u4E3A\u4E09\u7C7B\u3002\u9996\u5148\u662F\u57FA\u672C\u64CD\u4F5C\uFF0C\u5305\u62EC : persist, merge, delete, save-update, evict, replicate, lock \u548C refresh; \u4EE5\u53CA\u7279\u522B\u503C: delete-orphan\u548Call\uFF0C\u5E76\u4E14\u53EF\u4EE5\u7528\u9017\u53F7\u5206\u9694\u7B26 \u6765\u7EC4\u5408\u8FD9\u4E9B\u64CD\u4F5C\uFF0C\u4F8B\u5982\uFF1A <code>cascade="persist,merge,evict"</code> \u6216\u8005 <code>cascade="all,delete-orphan"</code>. \u53C2\u8003 <a href="#c11-11">Section 11.11, \u201C\u6301\u4E45\u5316\u4F20\u64AD\u201D</a> \u83B7\u53D6\u66F4\u591A\u4FE1\u606F\u3002\u6CE8\u610F\uFF0C\u5355\u503C\u5173\u8054 (<code>many-to-one</code> \u548C <code>one-to-one</code>\u5173\u8054) \u4E0D\u652F\u6301\u5220\u9664\u5B64\u513F \u3002
p5-1-7-1-13 = \u4E00\u4E2A\u5178\u578B\u7684\u7B80\u5355many-to-one\u5B9A\u4E49\u4F8B\u5B50\uFF1A
p5-1-7-1-14 = <code>property-ref</code>\u5C5E\u6027\u53EA\u5E94\u8BE5\u7528\u6765\u5BF9\u4ED8\u9057\u7559\u4E0B\u6765\u7684\u6570\u636E\u5E93\u7CFB\u7EDF\uFF0C\u53EF\u80FD\u6709\u5916\u952E\u6307\u5411\u5BF9\u65B9\u5173\u8054\u8868\u7684\u662F\u4E2A\u975E\u4E3B\u952E\u5B57\u6BB5\u7684\u60C5\u51B5\u4E0B \u8FD9\u662F\u4E00\u79CD\u5341\u5206\u4E11\u964B\u7684\u5173\u7CFB\u6A21\u578B\u3002\u6BD4\u5982\u8BF4\uFF0C\u5047\u8BBEProduct\u7C7B\u6709\u4E00\u4E2A\u60DF\u4E00\u7684\u5E8F\u5217\u53F7\uFF0C\u5B83\u5E76\u4E0D\u662F\u4E3B\u952E\u3002unique\u5C5E\u6027\u63A7\u5236Hibernate\u901A\u8FC7SchemaExport\u5DE5\u5177\u8FDB\u884C\u7684DDL\u751F\u6210\u3002
p5-1-7-1-15 = \u90A3\u4E48\u5173\u4E8EOrderItem \u7684\u6620\u5C04\u53EF\u80FD\u662F\uFF1A
p5-1-7-1-16 = \u5F53\u7136\uFF0C\u6211\u4EEC\u51B3\u4E0D\u9F13\u52B1\u8FD9\u79CD\u7528\u6CD5\u3002
p5-1-7-1-17 = \u5982\u679C\u88AB\u5F15\u7528\u7684\u552F\u4E00\u4E3B\u952E\u7531\u5173\u8054\u5B9E\u4F53\u7684\u591A\u4E2A\u5C5E\u6027\u7EC4\u6210\uFF0C \u4F60\u5E94\u8BE5\u5728\u540D\u79F0\u4E3A<code>&lt;properties&gt;</code>\u7684\u5143\u7D20 \u91CC\u9762\u6620\u5C04\u6240\u6709\u5173\u8054\u7684\u5C5E\u6027\u3002
p5-1-7-1-18 = \u5047\u82E5\u88AB\u5F15\u7528\u7684\u552F\u4E00\u4E3B\u952E\u662F\u7EC4\u4EF6\u7684\u5C5E\u6027\uFF0C\u4F60\u53EF\u4EE5\u6307\u5B9A\u5C5E\u6027\u8DEF\u5F84\uFF1A
 
#		**********************************************************************************************************
#		5.1.7.2. Sharing the primary key with the associated entity
#		**********************************************************************************************************

title5-1-7-2 = 5.1.7.2. \u5173\u8054\u5B9E\u4F53\u5171\u4EAB\u4E3B\u952E
p5-1-7-2-1 = \u7B2C\u4E8C\u79CD\u65B9\u6CD5\u662F\u786E\u4FDD\u5B9E\u4F53\u548C\u4ED6\u7684\u5173\u8054\u5B9E\u4F53\u5171\u4EAB\u4E3B\u952E\u3002\u5728\u8FD9\u79CD\u60C5\u51B5\u4E0B\uFF0C\u4E3B\u952E\u5217\u4E5F\u662F\u5916\u952E\u5217\uFF0C\u5E76\u4E14\u6CA1\u6709\u989D\u5916\u7684\u5217\u3002\u8FD9\u79CD\u5173\u8054\u901A\u5E38\u662F\u4E00\u5BF9\u4E00\u7684\u3002
nc5-1-7-2-1 = \u5F88\u591A\u4EBA\u5BF9\u4E8E\u57FA\u4E8E\u4E3B\u952E\u7684\u4E00\u5BF9\u4E00\u7684\u5173\u8054\u611F\u5230\u7591\u60D1\u3002\u5982\u679CHibernate\u80FD\u591F\u77E5\u9053\u5173\u8054\u7684\u53E6\u4E00\u7AEF\u662F\u6C38\u8FDC\u5B58\u5728\u7684\u5219\u53EF\u4EE5\u4F7F\u7528\u5EF6\u8FDF\u52A0\u8F7D\u3002\u4F7F\u7528<code>@OneToOne(optional=false)</code>\u6765\u901A\u77E5Hibernate\u3002
p5-1-7-2-2 = \u5728 <code>hbm.xml</code>\u4E2D, \u6309\u7167\u4E0B\u9762\u7684\u6620\u5C04\uFF1A
td5-1-7-2-1-1 = <code>name</code>:\u5C5E\u6027\u540D
td5-1-7-2-1-2 = <code>class</code> (\u53EF\u9009 -  \u9ED8\u8BA4\u4E3A\u901A\u8FC7\u53CD\u5C04\u5F97\u5230\u7684\u5C5E\u6027\u7C7B\u578B): \u5173\u8054\u7C7B\u7684\u540D\u79F0\u3002
td5-1-7-2-1-3 = <code>cascade</code> (\u53EF\u9009): \u6307\u5B9A\u4ECE\u7236\u5BF9\u8C61\u5230\u5173\u8054\u5BF9\u8C61\uFF0C\u5E94\u8BE5\u7EA7\u8054\u54EA\u4E9B\u64CD\u4F5C\u3002
td5-1-7-2-1-4 = <code>constrained</code> (\u53EF\u9009):  \u8868\u660E\u8BE5\u7C7B\u5BF9\u5E94\u7684\u8868\u5BF9\u5E94\u7684\u6570\u636E\u5E93\u8868\uFF0C\u548C\u88AB\u5173\u8054\u7684\u5BF9\u8C61\u6240\u5BF9\u5E94\u7684\u6570\u636E\u5E93\u8868\u4E4B\u95F4\uFF0C\u901A\u8FC7\u4E00\u4E2A\u5916\u952E\u5F15\u7528\u5BF9\u4E3B\u952E\u8FDB\u884C\u7EA6\u675F\u3002 \u8FD9\u4E2A\u9009\u9879\u5F71\u54CDsave()\u548Cdelete()\u5728\u7EA7\u8054\u6267\u884C\u65F6\u7684\u5148\u540E\u987A\u5E8F\u4EE5\u53CA \u51B3\u5B9A\u8BE5\u5173\u8054\u80FD\u5426\u88AB\u59D4\u6258(\u4E5F\u5728schema export tool\u4E2D\u88AB\u4F7F\u7528)\u3002
td5-1-7-2-1-5 = <code>fetch</code> (\u53EF\u9009 - \u9ED8\u8BA4 select): \u5728\u5916\u8FDE\u63A5\u6293\u53D6\u6216\u8005\u5E8F\u5217\u9009\u62E9\u6293\u53D6\u9009\u62E9\u5176\u4E00.
td5-1-7-2-1-6 = <code>property-ref</code> (\u53EF\u9009): \u6307\u5B9A\u5173\u8054\u7C7B\u7684\u5C5E\u6027\u540D\uFF0C\u8FD9\u4E2A\u5C5E\u6027\u5C06\u4F1A\u548C\u672C\u7C7B\u7684\u4E3B\u952E\u76F8\u5BF9\u5E94\u3002\u5982\u679C\u6CA1\u6709\u6307\u5B9A\uFF0C\u4F1A\u4F7F\u7528\u5BF9\u65B9\u5173\u8054\u7C7B\u7684\u4E3B\u952E\u3002
td5-1-7-2-1-7 = <code>access</code> (\u53EF\u9009 - \u9ED8\u8BA4 property): Hibernate\u7528\u6765\u8BBF\u95EE\u5C5E\u6027\u7684\u7B56\u7565\u3002
td5-1-7-2-1-8 = <code>formula</code> (\u53EF\u9009): \u7EDD\u5927\u591A\u6570\u4E00\u5BF9\u4E00\u7684\u5173\u8054\u90FD\u6307\u5411\u5176\u5B9E\u4F53\u7684\u4E3B\u952E\u3002\u5728\u4E00\u4E9B\u5C11\u89C1\u7684\u60C5\u51B5\u4E2D\uFF0C \u4F60\u53EF\u80FD\u4F1A\u6307\u5411\u5176\u4ED6\u7684\u4E00\u4E2A\u6216\u591A\u4E2A\u5B57\u6BB5\uFF0C\u6216\u8005\u662F\u4E00\u4E2A\u8868\u8FBE\u5F0F\uFF0C\u8FD9\u4E9B\u60C5\u51B5\u4E0B\uFF0C\u4F60\u53EF\u4EE5\u7528\u4E00\u4E2ASQL\u516C\u5F0F\u6765\u8868\u793A\u3002 \uFF08\u53EF\u4EE5\u5728org.hibernate.test.onetooneformula\u627E\u5230\u4F8B\u5B50\uFF09
td5-1-7-2-1-9 = <code>lazy</code> (\u53EF\u9009 - defaults to proxy):  \u9ED8\u8BA4\u60C5\u51B5\u4E0B\uFF0C\u5355\u70B9\u5173\u8054\u662F\u7ECF\u8FC7\u4EE3\u7406\u7684\u3002<code>lazy="no-proxy"</code> \u6307\u5B9A\u6B64\u5C5E\u6027\u5E94\u8BE5\u5728\u5B9E\u4F8B\u53D8\u91CF\u7B2C\u4E00\u6B21\u88AB\u8BBF\u95EE\u65F6\u5E94\u8BE5\u5EF6\u8FDF\u6293\u53D6\uFF08fetche lazily\uFF09\uFF08\u9700\u8981\u8FD0\u884C\u65F6\u5B57\u8282\u7801\u7684\u589E\u5F3A\uFF09\u3002 <code>lazy="false"</code> \u6307\u5B9A\u6B64\u5173\u8054\u603B\u662F\u88AB\u9884\u5148\u6293\u53D6\u3002\u6CE8\u610F\uFF0C\u5982\u679C<code>constrained="false"</code>, \u4E0D\u53EF\u80FD\u4F7F\u7528\u4EE3\u7406\uFF0CHibernate\u4F1A\u91C7\u53D6\u9884\u5148\u6293\u53D6\uFF01
td5-1-7-2-1-10 = <code>entity-name</code> (\u53EF\u9009):  \u88AB\u5173\u8054\u7684\u7C7B\u7684\u5B9E\u4F53\u540D\u3002
p5-1-7-2-3 = \u4E3B\u952E\u5173\u8054\u4E0D\u9700\u8981\u989D\u5916\u7684\u8868\u5B57\u6BB5\uFF1B\u5982\u679C\u4E24\u884C\u662F\u901A\u8FC7\u8FD9\u79CD\u4E00\u5BF9\u4E00\u5173\u7CFB\u76F8\u5173\u8054\u7684\uFF0C\u90A3\u4E48\u8FD9\u4E24\u884C\u5C31\u5171\u4EAB\u540C\u6837\u7684\u4E3B\u5173\u952E\u5B57\u503C\u3002\u6240\u4EE5\u5982\u679C\u4F60\u5E0C\u671B\u4E24\u4E2A\u5BF9\u8C61\u901A\u8FC7\u4E3B\u952E\u4E00\u5BF9\u4E00\u5173\u8054\uFF0C\u4F60\u5FC5\u987B\u786E\u8BA4\u5B83\u4EEC\u88AB\u8D4B\u4E88\u540C\u6837\u7684\u6807\u8BC6\u503C\uFF01
p5-1-7-2-4 = \u5BF9\u4E8E\u4E3B\u952E\u5173\u8054, \u5206\u522B\u4E3A <code>Employee</code> and <code>Person</code> \u6DFB\u52A0\u5982\u4E0B\u5173\u8054:
p5-1-7-2-5 = \u73B0\u5728\u6211\u4EEC\u5FC5\u987B\u786E\u4FDDPERSON\u548CEMPLOYEE\u4E2D\u76F8\u5173\u7684\u5B57\u6BB5\u662F\u76F8\u7B49\u7684\u3002\u6211\u4EEC\u4F7F\u7528\u4E00\u4E2A\u88AB\u6210\u4E3Aforeign\u7684\u7279\u6B8A\u7684hibernate\u6807\u8BC6\u7B26\u751F\u6210\u7B56\u7565\uFF1A
p5-1-7-2-6 = \u4E00\u4E2A\u521A\u521A\u4FDD\u5B58\u7684Person\u5B9E\u4F8B\u88AB\u8D4B\u4E88\u548C\u8BE5<code>Person</code>\u7684employee\u5C5E\u6027\u6240\u6307\u5411\u7684<code>employee</code> \u5B9E\u4F8B\u540C\u6837\u7684\u5173\u952E\u5B57\u503C\u3002
#		**********************************************************************************************************
#		5.1.8. Natural-id
#		**********************************************************************************************************

title5-1-8 = 5.1.8. Natural-id
p5-1-8-1 = \u5C3D\u7BA1\u6211\u4EEC\u5EFA\u8BAE\u4F7F\u7528\u65E0\u610F\u4E49\u7684\u952E\u4F5C\u4E3A\u4E3B\u952E\uFF0C\u4F46\u662F\u4F60\u4E5F\u53EF\u662F\u5C1D\u8BD5\u4E3A\u6240\u6709\u5B9E\u4F53\u4F7F\u7528\u81EA\u7136\u952E\u4F5C\u4E3A\u4E3B\u952E\u3002\u81EA\u7136\u95F4\u662F\u4E00\u4E2A\u6216\u7EC4\u5408\u552F\u4E00\u975E\u7A7A\u5C5E\u6027\u3002\u5B83\u540C\u6837\u662F\u4E0D\u53EF\u4FEE\u6539\u7684\u3002\u4F7F\u7528<code>@NaturalId</code>\u6216\u8005\u5728<code>&lt;natural-id&gt;</code>\u5143\u7D20\u4E2D\u5B9A\u4E49\u81EA\u7136\u952E\u3002Hibernate\u4F1A\u751F\u6210\u5FC5\u8981\u7684\u552F\u4E00\u952E\u548C\u975E\u7A7A\u7EA6\u675F\uFF0C\u4F60\u7684\u6620\u5C04\u5C06\u53D8\u5F97\u66F4\u52A0self-documenting\u3002
p5-1-8-2 = \u6216\u8005\u4F7F\u7528XML,
p5-1-8-3 = \u63A8\u8350\u5B9E\u73B0<code>equals()</code> \u548C <code>hashCode()</code>\u6765\u6BD4\u8F83\u5B9E\u4F53\u7684\u81EA\u7136\u952E\u5C5E\u6027\u503C\u3002
p5-1-8-4 = \u8FD9\u4E00\u6620\u5C04\u4E0D\u662F\u4E3A\u4E86\u628A\u81EA\u7136\u952E\u4F5C\u4E3A\u4E3B\u952E\u800C\u51C6\u5907\u7684\u3002
li5-1-8-1-1 = <code>mutable</code> (\u53EF\u9009 - \u9ED8\u8BA4\u4E3Afalse): \u9ED8\u8BA4\u60C5\u51B5\u4E0B\uFF0C\u81EA\u7136\u952E\u7684\u5C5E\u6027\u503C\u4E3A\u4E0D\u53EF\u53D8\u7684\uFF08\u5E38\u91CF\uFF09\u3002
 
#		**********************************************************************************************************
#		5.1.9. Any
#		**********************************************************************************************************

title5-1-9 = 5.1.9. Any
p5-1-9-1 = \u8FD9\u662F\u5C5E\u6027\u6620\u5C04\u7684\u53E6\u4E00\u79CD\u7C7B\u578B\u3002<code>@Any</code>\u6620\u5C04\u5B9A\u4E49\u4E86\u4E00\u79CD\u591A\u8868\u4E4B\u95F4\u7684\u591A\u6001\u5173\u8054\u5173\u7CFB\u3002\u8FD9\u79CD\u7C7B\u578B\u7684\u6620\u5C04\u9700\u8981\u591A\u4E2A\u5217\u3002\u7B2C\u4E00\u5217\u5305\u542B\u76F8\u5173\u5B9E\u4F53\u7684\u7C7B\u578B\u3002\u5269\u4E0B\u7684\u5217\u5305\u542BID\u3002\u5728\u8FD9\u79CD\u5173\u8054\u5173\u7CFB\u4E2D\u662F\u53EF\u4EE5\u6307\u5B9A\u4E00\u4E2A\u5916\u952E\u7EA6\u675F\u7684\u3002\u8FD9\u4E0D\u662F\u6307\u5B9A\u591A\u6001\u6620\u5C04\u5E38\u7528\u7684\u65B9\u5F0F\uFF0C\u800C\u4E14\u4F60\u4E5F\u5E94\u8BE5\u5C3D\u91CF\u907F\u514D\u4F7F\u7528\u8FD9\u79CD\u7EA6\u675F\uFF0C\u9664\u975E\u5728\u5341\u5206\u7279\u6B8A\u7684\u60C5\u51B5\u4E0B\u3002\u6BD4\u5982\uFF0C\u5BF9\u5BA1\u8BA1\u65E5\u5FD7\uFF0C\u7528\u6237\u4F1A\u8BDD\u6570\u636E\u7B49\u3002
p5-1-9-2 = <code>@Any</code>\u6CE8\u89E3\u63CF\u8FF0\u4E86\u5217\u6240\u6301\u6709\u7684metadata\u7684\u4FE1\u606F\u3002\u5982\u679C\u60F3\u5C06metadata\u4FE1\u606F\u548C\u5B9E\u9645\u7684\u5B9E\u4F53\u7C7B\u578B\u5173\u8054\u8D77\u6765\uFF0C\u53EF\u4EE5\u4F7F\u7528<code>@AnyDef</code>\u548C<code>@AnyDefs</code>\u6CE8\u89E3\u3002<code>meta-type</code>\u5C5E\u6027\u4F7F\u5F97\u5E94\u7528\u7A0B\u5E8F\u80FD\u6307\u5B9A\u4E00\u4E2A\u5C06\u6570\u636E\u5E93\u5B57\u6BB5\u7684\u503C\u6620\u5C04\u5230\u6301\u4E45\u5316\u7C7B\u7684\u81EA\u5B9A\u4E49\u7C7B\u578B\u3002\u8FD9\u4E2A\u6301\u4E45\u5316\u7C7B\u5305\u542B\u6709\u7528<code>id-type</code>\u6307\u5B9A\u7684\u6807\u8BC6\u7B26\u5C5E\u6027\u3002\u4F60\u5FC5\u987B\u6307\u5B9A\u4ECEmeta-type\u7684\u503C\u5230\u7C7B\u540D\u7684\u6620\u5C04\u3002
p5-1-9-3 = \u6CE8\u610F<code>@AnyDef</code>\u53EF\u4EE5\u4EA4\u4E92\u548C\u91CD\u7528\u3002\u5728\u8FD9\u4E2A\u4F8B\u5B50\u4E2D\u63A8\u8350\u628A\u5B83\u653E\u5728\u5305\u7684metadata\u4E2D\u3002
p5-1-9-4 = <code>hbm.xml</code>\u5982\u4E0B\uFF1A
nc5-1-9-1 = \u5728<code>hbm.xml</code>\u4E2D\u4F60\u4E0D\u80FD\u50CF\u5728\u6CE8\u89E3\u4E2D\u4E00\u6837\u8FDB\u884Cmetadata\u7684\u4EA4\u4E92\u3002
td5-1-9-1-1 = <code>name</code>: \u5C5E\u6027\u540D\u79F0\u3002
td5-1-9-1-2 = <code>id-type</code>: id\u7C7B\u578B\u3002
td5-1-9-1-3 = <code>meta-type</code> (\u53EF\u9009 - \u9ED8\u8BA4\u4E3Astring): \u5141\u8BB8\u8FA8\u522B\u6807\u5FD7(discriminator)\u6620\u5C04\u7684\u4EFB\u4F55\u7C7B\u578B
td5-1-9-1-4 = <code>cascade</code> (\u53EF\u9009- \u9ED8\u8BA4\u4E3Anone): \u7EA7\u8054\u7C7B\u578B\u3002
td5-1-9-1-5 = <code>access</code> (\u53EF\u9009 - \u9ED8\u8BA4\u4E3Aproperty): Hibernate\u7528\u6765\u8BBF\u95EE\u5C5E\u6027\u503C\u7684\u7B56\u7565\u65B9\u6CD5\u3002
td5-1-9-1-6 = <code>optimistic-lock</code> (\u53EF\u9009 - \u9ED8\u8BA4\u4E3Atrue):  \u8868\u660E\u66F4\u65B0\u6B64\u7EC4\u4EF6\u662F\u5426\u9700\u8981\u83B7\u53D6\u4E50\u89C2\u9501\u3002\u6362\u53E5\u8BDD\u8BF4\uFF0C\u5F53\u8FD9\u4E2A\u5C5E\u6027\u53D8\u810F\u65F6\uFF0C\u662F\u5426\u589E\u52A0\u7248\u672C\u53F7(Version)

 
#		**********************************************************************************************************
#		5.1.10. Properties
#		**********************************************************************************************************

title5-1-10 = 5.1.10. Properties
p5-1-10-1 = <code>&lt;properties&gt;</code>\u5143\u7D20\u7ED9\u5B9A\u4E49\u4E00\u4E2A\u7C7B\u7684\u5C5E\u6027\uFF0C\u8FD9\u5C5E\u6027\u5DF2\u7ECF\u547D\u540D\u548C\u903B\u8F91\u5206\u7EC4\u3002 The most important use of the construct is that it allows a combination of properties to be the target of a property-ref. It is also a convenient way to define a multi-column unique constraint. For example:
td5-1-10-1-1 = <code>name</code>: \u7EC4\u7684\u903B\u8F91\u540D\u79F0\u3002\u5B83\u4E0D\u662F\u771F\u6B63\u7684\u5C5E\u6027\u540D\u79F0\u3002
td5-1-10-1-2 = <code>insert</code>: \u5728\u63D2\u5165SQL\u8BED\u53E5\u4E2D\u663E\u793A\u6620\u5C04\u7684\u5217\u540D
td5-1-10-1-3 = <code>update</code>: \u5728\u66F4\u65B0SQL\u8BED\u53E5\u4E2D\u663E\u793A\u6620\u5C04\u7684\u5217\u540D
td5-1-10-1-4 = <code>optimistic-lock</code> (\u53EF\u9009 - \u9ED8\u8BA4\u4E3Atrue): \u6307\u5B9A\u8FD9\u4E2A\u5C5E\u6027\u5728\u505A\u66F4\u65B0\u65F6\u662F\u5426\u9700\u8981\u83B7\u5F97\u4E50\u89C2\u9501\u5B9A\uFF08optimistic lock\uFF09\u3002 \u6362\u53E5\u8BDD\u8BF4\uFF0C\u5B83\u51B3\u5B9A\u8FD9\u4E2A\u5C5E\u6027\u53D1\u751F\u810F\u6570\u636E\u65F6\u7248\u672C\uFF08version\uFF09\u7684\u503C\u662F\u5426\u589E\u957F\u3002
td5-1-10-1-5 = <code>unique</code> (\u53EF\u9009 - \u9ED8\u8BA4\u4E3Afalse): \u6307\u660E\u7EC4\u4EF6\u4E2D\u6240\u6709\u7684\u5217\u662F\u5426\u90FD\u6709\u552F\u4E00\u6027\u7EA6\u675F\u3002
p5-1-10-2 = \u6BD4\u5982\u8BF4\uFF0C\u5982\u679C\u6211\u4EEC\u6709<code>&lt;properties&gt;</code>\u6620\u5C04\uFF1A
p5-1-10-3 = \u4F60\u53EF\u80FD\u4F1A\u6709\u4E00\u4E9B\u9057\u7559\u6570\u636E\u6307\u5411<code>Person</code>\u8868\u4E2D\u8FD9\u4E2A\u552F\u4E00\u7684\u952E\u800C\u4E0D\u662F\u4E3B\u952E\u3002
nc5-1-10-1 = \u4F46\u662F\u5F53\u7528\u6CE8\u89E3\u6765\u5B9A\u4E49\u6620\u5C04\u7B56\u7565\u65F6\uFF0C\u7531\u4E8E\u5217\u548C\u4E0E\u8FD9\u4E2A\u5217\u76F8\u5173\u7684\u5217\u7684\u7ED1\u5B9A\u5DF2\u7ECF\u76F4\u63A5\u5B8C\u6210\u4E86\uFF0C\u6240\u4EE5\u8FD9\u6837\u7684\u505A\u6CD5\u662F\u4E0D\u5FC5\u8981\u7684\u3002
p5-1-10-4 = \u50CF\u8FD9\u6837\u5728\u5916\u90E8\u6620\u5C04\u9057\u7559\u6570\u636E\u7684\u65B9\u5F0F\u662F\u4E0D\u88AB\u63A8\u8350\u7684\u3002
 
#		**********************************************************************************************************
#		5.1.11. Some hbm.xml specificities
#		**********************************************************************************************************

title5-1-11 = 5.1.11. \u4E00\u4E9Bhbm.xml d\u7684\u7279\u6B8A\u6027
p5-1-11-1 = <code>hbm.xml</code> \u6587\u4EF6\u6709\u4E00\u4E9B\u4F7F\u7528\u6CE8\u89E3\u6CA1\u6709\u7684\u7279\u6027\uFF0C\u8BA9\u6211\u4EEC\u6765\u8BE6\u7EC6\u7684\u8BA8\u8BBA\u4E00\u4E0B\u8FD9\u4E9B\u7279\u6027\u3002
 
#		**********************************************************************************************************
#		5.1.11.1. Doctype
#		**********************************************************************************************************

title5-1-11-1 = 5.1.11.1. Doctype
p5-1-11-1-1 = \u6240\u6709\u7684XML\u6620\u5C04\u90FD\u5E94\u8BE5\u5B9A\u4E49dcttype\u4EE5\u7528\u6765\u5C55\u793A\u3002\u5B9E\u9645\u7684DTD\u53EF\u4EE5\u5728\u8FD9\u4E9B\u5730\u65B9\uFF0C \u6587\u4EF6\u5939<code>hibernate-x.x.x/src/org/hibernate</code> ,\u6216\u8005\u5728<code>hibernate3.jar</code>.Hibernate\u4F1A\u9996\u5148\u5728\u5B83\u7684\u7C7B\u8DEF\u5F84\u4E2D\u67E5\u627EDTD\u3002\u5982\u679C\u4F60\u60F3\u901A\u8FC7\u7F51\u7EDC\u7684\u65B9\u5F0F\u67E5\u627EDTD\uFF0C\u8BF7\u68C0\u67E5\u4F60\u7C7B\u8DEF\u5F84\u4E0B\u7684DTD\u6587\u6863\u3002
 
#		**********************************************************************************************************
#		5.1.11.1.1. EntityResolver
#		**********************************************************************************************************

title5-1-11-1-1 = 5.1.11.1.1. \u5B9E\u4F53\u89E3\u6790\u5668
p5-1-11-1-1-1 = Hibernate\u4F1A\u9996\u5148\u5C1D\u8BD5\u5728\u5B83\u7684\u7C7B\u8DEF\u5F84\u4E0B\u89E3\u6790DTD\u3002\u5B83\u901A\u8FC7\u6CE8\u518C\u4E00\u4E2A\u5B9E\u73B0\u4E86<code>SAXReader</code>\u7684\u81EA\u5B9A\u4E49<code>org.xml.sax.EntityResolver</code>\u6765\u89E3\u6790\u8FD9\u4E2Axml\u6587\u4EF6\u3002\u8FD9\u4E2A\u81EA\u5B9A\u4E49\u7684\u5B9E\u4F53\u89E3\u6790\u5668\u53EF\u4EE5\u8BA4\u8BC6\u4E24\u4E2A\u4E0D\u540C\u7CFB\u7EDFID\u7684\u547D\u540D\u7A7A\u95F4\uFF1A
li5-1-11-1-1-1-1 = \u65E0\u8BBA\u4EC0\u4E48\u65F6\u5019\u53EA\u8981\u9047\u5230\u7CFB\u7EDFID\u4EE5<code>http://www.hibernate.org/dtd/</code>\u5F00\u5934\uFF0C\u5C31\u8BA4\u4E3A\u5B83\u662F<code>hibernate namespace</code>\u3002\u89E3\u6790\u5668\u8BD5\u56FE\u7528Hibernate\u7C7B\u7684classloader\u6765\u89E3\u6790\u3002
li5-1-11-1-1-1-2 = \u65E0\u8BBA\u4EC0\u4E48\u65F6\u5019\u53EA\u8981\u9047\u5230\u7CFB\u7EDFID\u4EE5<code>classpath:// URL protocol</code>\u5F00\u5934\uFF0C\u5C31\u8BA4\u4E3A\u5B83\u662F<code>user namespace</code>\u3002\u89E3\u6790\u5668\u4F1A\u9996\u5148\u5C1D\u8BD5\u8C03\u7528\u5F53\u524D\u7EBF\u7A0B\u7684classloader\u89E3\u6790\uFF0C\u5982\u679C\u89E3\u6790\u5931\u8D25\uFF0C\u518D\u8C03\u7528Hibernate\u7C7B\u7684classloader\u8FDB\u884C\u89E3\u6790\u3002
p5-1-11-1-1-2 = \u4E0B\u9762\u662F\u4E00\u4E2A\u4F7F\u7528<code>user namespace</code>\u7684\u4F8B\u5B50\uFF1A
p5-1-11-1-1-3 = <code>types.xml</code>\u662F\u4E00\u4E2A\u5728<code>your.domain</code>\u5305\u4E2D\u7684\u542B\u6709\u81EA\u5B9A\u4E49typedef\u7684\u8D44\u6E90\u3002
 
#		**********************************************************************************************************
#		5.1.11.2. Hibernate-mapping
#		**********************************************************************************************************

title5-1-11-2 = 5.1.11.2. Hibernate-mapping
p5-1-11-2-1 = \u8FD9\u4E2A\u5143\u7D20\u6709\u51E0\u4E2A\u53EF\u9009\u5C5E\u6027\u3002<code>schema</code>\u548C<code>catalog</code>\u5C5E\u6027\u6307\u5B9A\u4E86\u6620\u5C04\u4E2D\u7684\u6570\u636E\u8868\u6240\u5C5E\u4E8E\u7684\u6A21\u5F0F\u548C/\u6216\u76EE\u5F55\u3002\u5047\u82E5\u6307\u5B9A\u4E86\u8FD9\u4E2A\u5C5E\u6027\uFF0C\u8868\u540D\u4F1A\u52A0\u4E0A\u6240\u6307\u5B9A\u7684schema\u548Ccatalog\u7684\u540D\u5B57\u6269\u5C55\u4E3A\u5168\u9650\u5B9A\u540D\u3002\u5047\u82E5\u6CA1\u6709\u6307\u5B9A\uFF0C\u8868\u540D\u5C31\u4E0D\u4F1A\u4F7F\u7528\u5168\u9650\u5B9A\u540D\u3002<code>default-cascade</code>\u5C5E\u6027\u7684\u4F5C\u7528\u662F\u731C\u6D4B\u6CA1\u6709\u88AB\u6307\u5B9Acascade\u5C5E\u6027\u7684\u5B57\u6BB5\u548C\u96C6\u5408\u5E94\u8BE5\u4F7F\u7528\u90A3\u79CD\u7EA7\u8054\u5173\u7CFB\u3002\u9ED8\u8BA4\u60C5\u51B5\u4E0B\uFF0C<code>auto-import</code>\u5C5E\u6027\u5141\u8BB8\u4F60\u5728\u67E5\u8BE2\u8BED\u8A00\u4E2D\u53EF\u4EE5\u4F7F\u7528 \u975E\u5168\u9650\u5B9A\u540D\u7684\u7C7B\u540D\u3002
td5-1-11-2-1-1 = <code>schema</code> (\u53EF\u9009): \u6570\u636E\u5E93\u6A21\u5F0F\u7684\u540D\u79F0\u3002
td5-1-11-2-1-2 = <code>catalog</code> (\u53EF\u9009): \u6570\u636E\u5E93\u76EE\u5F55\u7684\u540D\u79F0\u3002
td5-1-11-2-1-3 = <code>default-cascade</code> (\u53EF\u9009 - \u9ED8\u8BA4\u4E3Anone): \u9ED8\u8BA4\u4F7F\u7528\u7684\u7EA7\u8054\u98CE\u683C\u3002
td5-1-11-2-1-4 = <code>default-access</code> (\u53EF\u9009 - \u9ED8\u8BA4\u4E3Aproperty): \u4E3A\u4E86\u8BBF\u95EE\u6240\u6709\u5B57\u6BB5\uFF0CHibernate\u5E94\u8BE5\u4F7F\u7528\u7684\u7B56\u7565\u3002\u5B83\u53EF\u4EE5\u662F\u4E00\u4E2A\u81EA\u5B9A\u4E49\u7684PropertyAccssor\u3002
td5-1-11-2-1-5 = <code>default-lazy</code> (\u53EF\u9009 - \u9ED8\u8BA4\u4E3Atrue): \u5F53Java\u5C5E\u6027\u548C\u96C6\u5408\u7C7B\u6CA1\u6709\u6307\u5B9Alazy\u5C5E\u6027\u65F6\uFF0CHibernate\u5E94\u8BE5\u4F7F\u7528\u54EA\u79CD\u9ED8\u8BA4\u884C\u4E3A\u3002
td5-1-11-2-1-6 = <code>auto-import</code> (\u53EF\u9009 - \u9ED8\u8BA4\u4E3Atrue): \u6307\u5B9A\u6211\u4EEC\u662F\u5426\u53EF\u4EE5\u5728\u67E5\u8BE2\u8BED\u8A00\u4E2D\u4F7F\u7528\u975E\u5168\u9650\u5B9A\u7684\u7C7B\u540D\uFF08\u4EC5\u9650\u4E8E\u672C\u6620\u5C04\u6587\u4EF6\u4E2D\u7684\u7C7B\uFF09\u3002
td5-1-11-2-1-7 = <code>package</code> (\u53EF\u9009): \u4E3A\u5728\u6620\u5C04\u6587\u6863\u4E2D\u6CA1\u6709\u6307\u5B9A\u5168\u9650\u5B9A\u7C7B\u7684\u540D\u79F0\u6307\u5B9A\u4E00\u4E2A\u5305\u524D\u7F00\u3002
p5-1-11-2-2 = \u5982\u679C\u4F60\u6709\u4E24\u4E2A\u6301\u4E45\u5316\u7C7B\u62E5\u6709\u76F8\u540C\u7684\u975E\u5168\u9650\u5B9A\u540D\u79F0\uFF0C\u4F60\u5E94\u8BE5\u8BBE\u7F6E<code>auto-import="false"</code>\u3002\u5982\u679C\u4F60\u8BD5\u56FE\u7ED9\u4E24\u4E2A\u7C7B\u5206\u914D\u76F8\u540C\u7684"import\u8FC7"\u7684\u540D\u79F0\uFF0CHibernate\u4F1A\u629B\u51FA\u4E00\u4E2A\u5F02\u5E38\u3002
p5-1-11-2-3 = <code>hibernate-mapping</code> \u5C5E\u6027\u5141\u8BB8\u4F60\u5D4C\u5957\u591A\u4E2A\u5982\u4E0A\u6240\u793A\u7684<code>&lt;class&gt;</code>\u3002\u4F46\u662F\u66F4\u597D\u7684\u505A\u6CD5\u662F\u4E00\u4E2A\u6301\u4E45\u5316\u7C7B\uFF08\u6216\u8005\u4E00\u4E2A\u7C7B\u7684\u7EE7\u627F\u5C42\u6B21\uFF09\u5BF9\u5E94\u4E00\u4E2A\u6620\u5C04\u6587\u4EF6\uFF0C\u5E76\u4EE5\u8D85\u7C7B\u7684\u540D\u79F0\u547D\u540D\u3002\u4F8B\u5982\uFF0C<code>Cat.hbm.xml</code>\uFF0C <code>Dog.hbm.xml</code>\u6216\u8005\u4F7F\u7528\u7EE7\u627F\uFF0C<code>Animal.hbm.xml</code>\u3002
 
#		**********************************************************************************************************
#		5.1.11.3. Key
#		**********************************************************************************************************

title5-1-11-3 = 5.1.11.3. Key
p5-1-11-3-1 = <code>&lt;key&gt;</code>\u5143\u7D20\u5728\u8FD9\u4E2A\u6559\u7A0B\u4E2D\u51FA\u73B0\u4E86\u5F88\u591A\u6B21\u3002\u8FD9\u4E2A\u5143\u7D20\u5728\u7236\u6620\u5C04\u5143\u7D20\u5B9A\u4E49\u4E86\u5BF9\u65B0\u8868\u7684\u8FDE\u63A5\uFF0C\u5E76\u4E14\u5728\u88AB\u8FDE\u63A5\u8868\u4E2D\u5B9A\u4E49\u4E86\u4E00\u4E2A\u5916\u952E\u5F15\u7528\u539F\u8868\u7684\u4E3B\u952E\u7684\u60C5\u51B5\u4E0B\u7ECF\u5E38\u4F7F\u7528\u3002
td5-1-11-3-1-1 = <code>column</code> (\u53EF\u9009): \u5916\u952E\u5217\u7684\u540D\u79F0\u3002\u8FD9\u4E2A\u4E5F\u53EF\u4EE5\u5728<code>&lt;column&gt;</code>\u5143\u7D20\u7684\u5D4C\u5957\u4E2D\u5B9A\u4E49\u3002
td5-1-11-3-1-2 = <code>on-delete</code> (\u53EF\u9009 - \u9ED8\u8BA4\u503C\u4E3Anoaction): \u6307\u660E\u5916\u952E\u7EA6\u675F\u662F\u5426\u5728\u6570\u636E\u5E93\u7EA7\u522B\u7684\u7EA7\u8054\u5220\u9664\u65F6\u5F00\u542F\u3002
td5-1-11-3-1-3 = <code>property-ref</code> (\u53EF\u9009): \u6807\u793A\u5916\u952E\u5F15\u7528\u7684\u5B57\u6BB5\u4E0D\u662F\u539F\u8868\u7684\u4E3B\u952E\u3002\u63D0\u4F9B\u5728\u9057\u7559\u6570\u636E\u3002
td5-1-11-3-1-4 = <code>not-null</code> (\u53EF\u9009): \u6307\u5B9A\u5916\u952E\u5217\u4E0D\u80FD\u4E3A\u7A7A\u3002\u8FD9\u8868\u660E\u65E0\u8BBA\u4EC0\u4E48\u65F6\u5019\u5916\u952E\u90FD\u662F\u4E3B\u952E\u7684\u4E00\u90E8\u5206\u3002
td5-1-11-3-1-5 = <code>update</code> (\u53EF\u9009): \u6307\u660E\u5916\u952E\u6C38\u8FDC\u4E0D\u80FD\u88AB\u66F4\u65B0\u3002\u8FD9\u8868\u660E\u65E0\u8BBA\u4EC0\u4E48\u65F6\u5019\u5916\u952E\u90FD\u662F\u4E3B\u952E\u7684\u4E00\u90E8\u5206\u3002
td5-1-11-3-1-6 = <code>unique</code> (\u53EF\u9009): \u6307\u660E\u5916\u952E\u5E94\u8BE5\u6709\u552F\u4E00\u6027\u7EA6\u675F\u3002\u8FD9\u8868\u660E\u65E0\u8BBA\u4EC0\u4E48\u65F6\u5019\u5916\u952E\u90FD\u662F\u4E3B\u952E\u7684\u4E00\u90E8\u5206\u3002
p5-1-11-3-2 = \u5BF9\u4E8E\u770B\u91CD\u5220\u9664\u6027\u80FD\u7684\u7CFB\u7EDF\uFF0C\u6211\u4EEC\u5EFA\u8BAE\u6240\u6709\u7684\u952E\u90FD\u5E94\u8BE5\u5B9A\u4E49\u4E3A<code>on-delete="cascade"</code>\u3002Hibernate\u5C06\u4F7F\u7528\u6570\u636E\u5E93\u7EA7\u522B\u7684ON CASCADE DELETE\u7EA6\u675F\uFF0C\u800C\u4E0D\u662F\u591A\u4E2A\u5355\u72EC\u7684DELETE\u8BED\u53E5\u3002 \u6CE8\u610F\uFF0C\u8FD9\u4E2A\u7279\u6027\u4F1A\u7ED5\u8FC7 Hibernate \u901A\u5E38\u5BF9\u7248\u672C\u6570\u636E(versioned data)\u91C7\u7528\u7684\u4E50\u89C2\u9501\u7B56\u7565\u3002
p5-1-11-3-3 = <code>not-null</code>\u548C<code>update</code>\u5C5E\u6027\u5728\u6620\u5C04\u4F46\u50CF\u4E00\u5BF9\u591A\u5173\u8054\u5173\u7CFB\u65F6\u6709\u7528\u3002\u5982\u679C\u4F60\u6620\u5C04\u4E00\u4E2A\u5355\u5411\u4E00\u5BF9\u591A\u5173\u8054\u5230\u4E00\u4E2A\u975E\u7A7A\u7684\u5916\u952E\uFF0C\u4F60\u5FC5\u987B\u7528<code>&lt;key not-null="true"&gt;</code>\u5B9A\u4E49\u8FD9\u4E2A\u5B57\u6BB5\u3002
 
#		**********************************************************************************************************
#		5.1.11.4. Import
#		**********************************************************************************************************

title5-1-11-4 = 5.1.11.4. Import
p5-1-11-4-1 = \u5982\u679C\u4F60\u7684\u5E94\u7528\u4E2D\u6709\u4E24\u4E2A\u540D\u5B57\u76F8\u540C\u7684\u6301\u4E45\u5316\u7C7B\uFF0C\u800C\u4E14\u4F60\u4E0D\u60F3\u5728Hibernate\u67E5\u8BE2\u4E2D\u6307\u5B9A\u5168\u7C7B\u540D\uFF0C\u90A3\u4E48\u9664\u4E86\u4F9D\u8D56<code>auto-import="true"</code>\u4E4B\u5916\uFF0C\u7C7B\u4E5F\u53EF\u4EE5\u663E\u793A\u7684\u88AB\u5F15\u5165\u3002\u4F60\u4E5F\u53EF\u4EE5\u5F15\u5165\u6CA1\u6709\u663E\u793A\u6307\u660E\u7684\u7C7B\u548C\u63A5\u53E3\uFF1A
td5-1-11-4-1-1 = <code>class</code>: \u4EFB\u4F55Java\u7C7B\u7684\u5168\u9650\u5B9A\u540D\u3002
td5-1-11-4-1-2 = <code>rename</code> (\u53EF\u9009 - \u9ED8\u8BA4\u60C5\u51B5\u4E0B\u4E3A\u975E\u5168\u9650\u5B9A\u540D): \u5728\u67E5\u8BE2\u8BED\u8A00\u4E2D\u53EF\u4EE5\u88AB\u4F7F\u7528\u7684\u540D\u79F0\u3002
nc5-1-11-4-1 = \u8FD9\u4E2A\u7279\u6027\u53EA\u5728<code>hbm.xml</code>\u4E2D\u5B58\u5728\uFF0C\u5728\u6CE8\u89E3\u65F6\u4E0D\u88AB\u652F\u6301\u3002
 
#		**********************************************************************************************************
#		5.1.11.5. Column and formula elements
#		**********************************************************************************************************

title5-1-11-5 = 5.1.11.5. \u5217\u548C\u516C\u5F0F\u5143\u7D20
p5-1-11-5-1 = \u5C31\u6536column\u5C5E\u6027\u7684\u5143\u7D20\u4E5F\u4F1A\u652F\u6301<code>&lt;column&gt;</code>\u5B50\u5143\u7D20\u3002\u540C\u6837\u7684\uFF0C<code>&lt;formula&gt;</code>\u4E5F\u662Fformula\u5143\u7D20\u7684\u4E00\u79CD\u9009\u62E9\u3002\u6BD4\u5982\uFF1A
p5-1-11-5-2 = \u5728<code>column</code>\u4E2D\u7684\u5927\u591A\u6570\u5C5E\u6027\u5728\u81EA\u52A8\u751F\u6210schema\u65F6\u63D0\u4F9B\u4E86\u526A\u5207DDL\u7684\u65B9\u6CD5\u3002read\u548Cwrite\u5C5E\u6027\u5141\u8BB8\u4F60\u6307\u5B9A\u81EA\u5B9A\u4E49\u7684SQL\uFF0C\u8FD9\u4E2ASQLHibernate\u4F1A\u7528\u6765\u8BBF\u95EE\u8FD9\u4E2A\u5217\u7684\u503C\u3002\u60F3\u8981\u83B7\u53D6\u66F4\u591A\u54A8\u8BE2\uFF0C\u67E5\u770B\u5217\u8BFB\u5199\u8868\u8FBE\u5F0F\u7684\u8BA8\u8BBA\u3002
p5-1-11-5-3 = <code>column</code>\u548C<code>formula</code>\u5143\u7D20\u751A\u81F3\u53EF\u4EE5\u7528\u540C\u4E00\u4E2A\u5C5E\u6027\u6216\u8005\u5173\u8054\u6620\u5C04\u88AB\u5408\u5E76\u8D77\u6765\u8868\u793A\uFF0C\u4F8B\u5982\uFF0C\u5947\u602A\u7684\u8FDE\u63A5\u6761\u4EF6\u3002
 
#		**********************************************************************************************************
#		5.2. Hibernate types
#		**********************************************************************************************************

title5-2 = 5.2. Hibernate\u7C7B\u578B
 
#		**********************************************************************************************************
#		5.2.1. Entities and values
#		**********************************************************************************************************

title5-2-1 = 5.2.1. \u5B9E\u4F53\u548C\u503C
p5-2-1-1 = \u6309\u6301\u4E45\u5316\u670D\u52A1\u6765\u5206\uFF0CJava\u8BED\u8A00\u7684\u5BF9\u8C61\u53EF\u4EE5\u5927\u81F4\u88AB\u5206\u4E3A\u4E24\u7EC4\uFF1A
p5-2-1-2 = \u4E00\u4E2A<code>entity</code>\u72EC\u7ACB\u4E8E\u4EFB\u4F55\u5176\u4ED6\u5BF9\u8C61\u5F15\u7528\u7684\u5B9E\u4F53\u800C\u5B58\u5728\u3002\u5BF9\u6BD4\u4E00\u822C\u7684Java\u6A21\u578B\uFF0C\u8FD9\u6837\u4E00\u4E2A\u4E3A\u88AB\u5F15\u7528\u7684\u5BF9\u8C61\u5C06\u4F1A\u88AB\u5F53\u505A\u5783\u573E\u6E05\u7406\u6389\u3002\u5B9E\u4F53\u5FC5\u987B\u88AB\u663E\u793A\u7684\u4FDD\u5B58\u548C\u5220\u9664\u3002\u7136\u800C\u5BF9\u4E8E\u4FDD\u5B58\u548C\u5220\u9664\uFF0C\u4E5F\u53EF\u4EE5\u5728\u64CD\u4F5C\u7236\u5B9E\u4F53\u65F6\u7EA7\u8054\u64CD\u4F5C\u5B50\u5B9E\u4F53\u3002\u8FD9\u4E00\u70B9\u662F\u548CODMG\u6A21\u5F0F\u7684\u5DEE\u522B\uFF0C\u800C\u4E14\u8FD9\u4E48\u505A\u4E5F\u66F4\u52A0\u8D34\u5408\u5927\u578B\u7CFB\u7EDF\u4E2D\u7684\u4F7F\u7528\u903B\u8F91\u3002\u5B9E\u4F53\u652F\u6301\u5FAA\u73AF\u5F15\u7528\u548C\u4EA4\u53C9\u5F15\u7528\u3002\u5B83\u4EEC\u4E5F\u53EF\u4EE5\u6DFB\u52A0\u7248\u672C\u4FE1\u606F\u3002
p5-2-1-3 = \u4E00\u4E2A\u5B9E\u4F53\u7684\u6301\u4E45\u72B6\u6001\u5305\u542B\u6307\u5411\u5176\u4ED6\u5B9E\u4F53\u548C\u503C\u7C7B\u578B\u5B9E\u4F8B\u7684\u5F15\u7528\u3002\u503C\u7C7B\u578B\u662F\u539F\u59CB\u7C7B\u578B\uFF1A\u96C6\u5408\uFF08\u4E0D\u662F\u96C6\u5408\u4E2D\u7684\u5BF9\u8C61\uFF09\uFF0C\u7EC4\u4EF6\u6216\u8005\u7279\u5B9A\u7684\u4E0D\u53EF\u53D8\u5BF9\u8C61\u3002\u4E0E\u5B9E\u4F53\u4E0D\u540C\u7684\u662F\uFF0C\u5728\u7279\u5B9A\u96C6\u5408\u548C\u7EC4\u4EF6\u4E2D\u7684\u503C\u7C7B\u578B\uFF0C\u662F\u901A\u8FC7\u53EF\u5230\u8FBE\u6027\u6765\u8FDB\u884C\u6301\u4E45\u5316\u6216\u662F\u5220\u9664\u64CD\u4F5C\u7684\u3002\u7531\u4E8E\u503C\u7C7B\u578B\u548C\u539F\u59CB\u7C7B\u7684\u5B58\u50A8\u548C\u5220\u9664\u64CD\u4F5C\u8BBE\u8BA1\u5230\u5B83\u4EEC\u6240\u5305\u542B\u7684\u5B9E\u4F53\uFF0C\u6240\u4EE5\u4ED6\u4EEC\u4E0D\u80FD\u5355\u72EC\u7684\u6807\u6CE8\u7248\u672C\u4FE1\u606F\u3002\u503C\u7C7B\u578B\u6CA1\u6709\u72EC\u7ACB\u7684id\uFF0C\u6240\u4EE5\u4ED6\u4EEC\u4E0D\u80FD\u88AB\u4E24\u4E2A\u5B9E\u4F53\u6216\u96C6\u5408\u5171\u4EAB\u3002
p5-2-1-4 = \u76F4\u5230\u73B0\u5728\uFF0C\u6211\u4EEC\u4E00\u76F4\u7528"\u6301\u4E45\u5316\u7C7B"\u6765\u5F62\u5BB9\u5B9E\u4F53\u3002\u6211\u4EEC\u8FD8\u4F1A\u7EE7\u7EED\u8FD9\u4E48\u505A\u3002\u4E0D\u662F\u6240\u6709\u7528\u6237\u5B9A\u4E49\u7684\u7C7B\u90FD\u6709\u6301\u4E45\u5316\u72B6\u6001\uFF0C\u4F46\u662F\u5B9E\u4F53\u5FC5\u987B\u6709\u3002\u4E00\u4E2A\u7EC4\u4EF6\u662F\u7528\u6237\u5B9A\u4E49\u7684\u6709\u503C\u8BED\u4E49\u7684\u7C7B\u3002<code>java.lang.String</code>\u7C7B\u578B\u7684Java\u5C5E\u6027\u4E5F\u662F\u6709\u503C\u8BED\u4E49\u7684\u3002\u6211\u4EEC\u7ED9\u51FA\u4EE5\u4E0B\u5B9A\u4E49\uFF0CJava\u4E2DJDK\u63D0\u4F9B\u7ED9\u7684\u6240\u6709\u7684\u7C7B\u578B(classes)\u90FD\u662F\u6709\u503C\u8BED\u4E49\u7684\uFF0C\u4F46\u662F\u7528\u6237\u5B9A\u4E49\u7684\u7C7B\u578B\u53EF\u4EE5\u88AB\u6620\u5C04\u5230\u5B9E\u4F53\u6216\u8005\u503C\u8BED\u4E49\u4E0A\u3002\u8FD9\u4E2A\u51B3\u5B9A\u7531\u5E94\u7528\u7684\u5F00\u53D1\u8005\u51B3\u5B9A\u3002\u5728domain\u6A21\u578B\u4E2D\u7684\u5B9E\u4F53\u7C7B\u4E00\u822C\u90FD\u4F1A\u6301\u6709\u4E00\u4E2A\u90A3\u4E2A\u7C7B\u7684\u5355\u4E00\u5F15\u7528\uFF0C\u7136\u800C\u7EC4\u5408\u6216\u8005\u805A\u5408\u4E00\u822C\u4F1A\u88AB\u8F6C\u5316\u4E3A\u503C\u7C7B\u578B\u3002
p5-2-1-5 = \u6211\u4EEC\u4F1A\u5728\u672C\u6559\u7A0B\u4E2D\u591A\u6B21\u63D0\u5230\u4E0A\u9762\u7684\u6982\u5FF5\u3002
p5-2-1-6 = \u6311\u6218\u5728\u4E8E\u5C06Java\u7C7B\u578B\u7CFB\u7EDF\u548C\u5F00\u53D1\u8005\u5B9A\u4E49\u7684\u5B9E\u4F53\u548C\u503C\u7C7B\u578B\u6620\u5C04\u5230SQL/\u6570\u636E\u5E93\u7C7B\u578B\u7CFB\u7EDF\u4E0A\u3002Hiebrate\u63D0\u4F9B\u4E86\u8FDE\u63A5\u4E24\u4E2A\u7CFB\u7EDF\u7684\u6865\u6881\u3002\u5BF9\u4E8E\u5B9E\u4F53\uFF0C<code>&lt;class&gt;</code>, <code>&lt;subclass&gt;</code>\u7B49\u4F1A\u88AB\u4F7F\u7528\u3002\u5BF9\u4E8E\u503C\u7C7B\u578B\u6211\u4EEC\u4F7F\u7528<code>&lt;property&gt;</code>, <code>&lt;component&gt;</code>\u7B49\u6709<code>type</code>\u5C5E\u6027\u7684\u6807\u7B7E\u3002\u8FD9\u4E2A\u5C5E\u6027\u7684\u503C\u5C31\u662FHibernate\u6620\u5C04\u7C7B\u578B\u7684\u540D\u79F0\u3002Hibernate\u4E3A\u6807\u51C6\u7684JDK\u503C\u7C7B\u578B\u63D0\u4F9B\u4E86\u4E00\u7CFB\u5217\u7EBF\u7A0B\u7684\u6620\u5C04\u7C7B\u578B\u3002\u4F60\u4E5F\u53EF\u4EE5\u6839\u636E\u81EA\u5DF1\u7684\u8F6C\u6362\u7B56\u7565\u4E66\u5199\u81EA\u5DF1\u7684\u6620\u5C04\u7C7B\u578B\u3002
p5-2-1-7 = \u9664\u4E86collection\u4E4B\u5916\uFF0C\u6240\u6709\u7684\u5185\u5EFAHibernate\u7C7B\u578B\u90FD\u652F\u6301<code>null</code>\u8BED\u4E49\u3002
 
#		**********************************************************************************************************
#		5.2.2. Basic value types
#		**********************************************************************************************************

title5-2-2 = 5.2.2. \u57FA\u7840\u503C\u7C7B\u578B
p5-2-2-1 = \u5185\u5EFA\u7684\u57FA\u7840\u6620\u5C04\u7C7B\u578B\u53EF\u4EE5\u5927\u81F4\u7684\u5206\u4E3A\u4EE5\u4E0B\u51E0\u7C7B\uFF1A
dd5-2-2-1-1 = \u5C06Java\u539F\u59CB\u7C7B\u6216\u5C01\u88C5\u7C7B\u6620\u5C04\u5230\u9002\u5F53\u7684SQL\u7C7B\u3002\u5BF9\u4E8EJava\u7684\u5E03\u5C14\u7C7B\u578B\u6216\u8005<code>java.lang.Boolean</code>\uFF0C <code>yes_no</code>\u548C<code>true_false</code>\u90FD\u53EF\u4EE5\u88AB\u9009\u62E9\u7528\u6765\u4F7F\u7528\u3002
dd5-2-2-1-2 = \u5C06\u4F1A\u628A<code>java.lang.String</code>\u6620\u5C04\u5230<code>VARCHARA</code>\uFF08\u6216\u8005Oracle\u7684<code>VARCHAR2</code>\uFF09\u3002
dd5-2-2-1-3 = \u5C06\u4F1A\u628A<code>java.util.Date</code>\u548C\u5B83\u7684\u5B50\u7C7B\u6620\u5C04\u5230SQL\u7C7B\u578B\u7684<code>DATE</code>\uFF0C<code>TIME</code>\u548C<code>TIMESTAMP</code>\u3002
dd5-2-2-1-4 = \u5C06\u4F1A\u628A<code>java.util.Calendar</code>\u6620\u5C04\u5230SQL\u7C7B\u578B\u7684<code>TIMESTAMP</code>\u548C<code>DATE</code>\u3002
dd5-2-2-1-5 = \u5C06\u4F1A\u628A<code>java.math.BigDecimal</code>\u548C<code>java.math.BigInteger</code>\u6620\u5C04\u6210<code>NUMERIC</code>\uFF08\u6216\u8005Oracle\u7684<code>NUMBER</code>\uFF09\u3002
dd5-2-2-1-6 = \u5C06\u4F1A\u628A<code>java.util.Locale</code>\uFF0C<code>java.util.TimeZone</code> \u548C <code>java.util.Currency</code>\u6620\u5C04\u6210<code>VARCHAR</code>\uFF08\u6216\u8005Oracle\u7684<code>VARCHAR2</code>\uFF09\u3002<code>Locale</code>\u548C<code>Currency</code>\u7684\u5B9E\u4F8B\u5C06\u4F1A\u6620\u5C04\u6210\u5B83\u4EEC\u7684ISO\u7801\u3002<code>TimeZone</code>\u7684\u5B9E\u4F8B\u5C06\u4F1A\u6620\u5C04\u6210\u5B83\u4EEC\u7684ID\u3002
dd5-2-2-1-7 = \u5C06\u4F1A\u628A<code>java.lang.Class</code>\u6620\u5C04\u6210<code>VARCHAR</code>\uFF08\u6216\u8005Oracle\u7684<code>VARCHAR2</code>\uFF09\u3002<code>Class</code>\u4F1A\u6620\u5C04\u5230\u5B83\u7684\u5168\u7C7B\u540D\u79F0\u3002
dd5-2-2-1-8 = \u5C06bytpe\u6570\u7EC4\u6620\u5C04\u6210\u9002\u5408\u7684SQL\u4E8C\u8FDB\u5236\u7C7B\u578B\u3002
dd5-2-2-1-9 = \u5C06Java\u7684\u957F\u5B57\u7B26\u4E32\u6620\u5C04\u6210SQL\u7684<code>LONGVARCHAR</code>\u6216\u8005<code>TEXT</code>\u7C7B\u578B\u3002
dd5-2-2-1-10 = \u5C06\u957Fbyte\u6570\u7EC4\u6620\u5C04\u6210SQL\u7684<code>LONGVARBINARY</code>\u3002
dd5-2-2-1-11 = \u5C06\u53EF\u5E8F\u5217\u5316\u7684Java\u7C7B\u578B\u6620\u5C04\u6210\u9002\u5F53\u7684SQL\u4E8C\u8FDB\u5236\u7C7B\u578B\u3002\u4F60\u4E5F\u53EF\u4EE5\u4E3A\u4E00\u4E2A\u5E76\u975E\u9ED8\u8BA4\u4E3A\u57FA\u672C\u7C7B\u578B\u7684\u53EF\u5E8F\u5217\u5316Java\u7C7B\u6216\u8005\u63A5\u53E3\u6307\u5B9AHibernate\u7C7B\u578Bserializable\u3002
dd5-2-2-1-12 = \u662FJDBC\u7C7B\u578B<code>java.sql.Clob</code>\u548C<code>java.sql.Blob</code>\u7684\u6620\u5C04\u7C7B\u578B\u3002\u8FD9\u4E24\u4E2A\u7C7B\u578B\u53EF\u80FD\u5728\u4E00\u4E9B\u7A0B\u5E8F\u4E2D\u5E76\u4E0D\u9002\u7528\uFF0C\u56E0\u4E3A<code>blob</code>\u6216\u8005<code>clob</code>\u5728\u4E8B\u52A1\u5916\u4E0D\u80FD\u88AB\u91CD\u7528\u3002\u9A71\u52A8\u5BF9\u5B83\u4EEC\u7684\u652F\u6301\u4E5F\u4E0D\u597D\u3002
dd5-2-2-1-13 = \u5C06Java\u957F\u5B57\u7B26\u4E32\u6620\u5C04\u6210SQL\u7684<code>CLOB</code>\u7C7B\u578B\u3002\u5F53\u8BFB\u5230<code>CLOB</code>\uFF0C\u5B83\u4F1A\u9A6C\u4E0A\u8F6C\u5316\u4E3AJava\u7684<code>string</code>\u3002\u4E00\u4E9B\u9A71\u52A8\u9700\u8981CLOB\u7684\u503C\u5728\u4E8B\u52A1\u5185\u88AB\u8BFB\u53D6\u3002\u4E00\u65E6\u88AB\u8F6C\u5316\u6210\u4E86Java string\uFF0C\u5B83\u4FBF\u53EF\u4EE5\u5728\u4E8B\u52A1\u5916\u88AB\u8BBF\u95EE\u3002
dd5-2-2-1-14 = \u5C06\u957Fbyte\u6570\u7EC4\u6620\u5C04\u6210SQL\u7684<code>BLOB</code>\u7C7B\u578B\u3002\u5F53\u8BFB\u53D6\u65F6\uFF0CBLOB\u503C\u4F1A\u9A6C\u4E0A\u8F6C\u6362\u6210byte\u6570\u7EC4\u3002\u4E00\u4E9B\u9A71\u52A8\u9700\u8981BLOB\u7684\u503C\u5728\u4E8B\u52A1\u4E2D\u88AB\u8BFB\u53D6\u3002\u4E00\u65E6\u88AB\u8F6C\u6362\u6210byte\u6570\u7EC4\uFF0C\u5B83\u4FBF\u53EF\u4EE5\u5728\u4E8B\u52A1\u5916\u88AB\u8BBF\u95EE\u3002
dd5-2-2-1-15 = \u6620\u5C04\u53EF\u53D8\u7684Java\u7C7B\u578B\u3002\u53EA\u6709\u5BF9\u4E0D\u53EF\u53D8\u7684Java\u7C7B\u578B\uFF0CHibernate\u624D\u4F1A\u91C7\u7528\u7279\u5B9A\u7684\u4F18\u5316\u63AA\u65BD\uFF0C\u5E94\u7528\u7A0B\u5E8F\u4F1A\u628A\u5B83\u5F53\u505A\u4E0D\u53EF\u53D8\u5151\u73B0\u521A\u8FDB\u884C\u5904\u7406\u3002\u6BD4\u5982\uFF0C\u5BF9\u4E8E\u6620\u5C04\u4E86<code>imm_timestamp</code>\u7684\u5B9E\u4F53\u6765\u8BF4\uFF0C\u4F60\u4E0D\u5E94\u8BE5\u8C03\u7528<code>Date.setTime()</code>\u65B9\u6CD5\u3002\u60F3\u8981\u6539\u53D8\u8FD9\u4E2A\u5C5E\u6027\u7684\u503C\uFF0C\u5E76\u8BA9\u8FD9\u4E2A\u53D8\u5316\u6301\u4E45\u5316\uFF0C\u5E94\u7528\u7A0B\u5E8F\u5FC5\u987B\u7ED9\u8FD9\u4E2A\u5BF9\u8C61\u5206\u914D\u4E00\u4E2A\u65B0\u7684\uFF0C\u4E0D\u4E00\u6837\u7684\u5BF9\u8C61\u3002
p5-2-2-2 = \u5B9E\u4F53\u7684\u552F\u4E00\u6807\u793A\u7B26\u548C\u96C6\u5408\u53EF\u4EE5\u4F7F\u7528\u9664\u4E86<code>binary</code>,<code>blob</code>\u548C<code>clob</code>\u4E4B\u5916\u7684\u6240\u6709\u57FA\u672C\u7C7B\u578B\u3002\u590D\u5408\u6807\u793A\u7B26\u4E5F\u662F\u88AB\u5141\u8BB8\u7684\uFF0C\u8FD9\u5C06\u5728\u540E\u9762\u63D0\u5230\u3002
p5-2-2-3 = \u57FA\u7840\u7684\u503C\u7C7B\u578B\u5E38\u91CF\u5728<code>org.hibernate.Hibernate</code>\u4E2D\u88AB\u5B9A\u4E49\u3002\u6BD4\u5982\uFF0C<code>Hibernate.STRING</code>\u4EE3\u8868string\u7C7B\u578B\u3002
 
#		**********************************************************************************************************
#		5.2.3. Custom value types
#		**********************************************************************************************************

title5-2-3 = 5.2.3. \u81EA\u5B9A\u4E49\u503C\u7C7B\u578B
p5-2-3-1 = \u5F00\u53D1\u8005\u521B\u5EFA\u81EA\u5DF1\u7684\u503C\u7C7B\u578B\u76F8\u5BF9\u7B80\u5355\u4E00\u4E9B\u3002\u6BD4\u5982\uFF0C\u4F60\u53EF\u80FD\u60F3\u8981\u5C06\u7C7B\u578B<code>java.lang.BigInteger</code>\u4FDD\u5B58\u6210\u4E3A\u6570\u636E\u5E93\u4E2D\u7684<code>VARCHAR</code>\u7C7B\u3002Hibernate\u5E76\u6CA1\u6709\u5185\u5EFA\u8FD9\u6837\u7684\u89C4\u5219\u3002\u81EA\u5B9A\u4E49\u7C7B\u578B\u5E76\u6CA1\u6709\u9650\u5236\u5C06\u4E00\u4E2A\u5C5E\u6027\u6216\u8005\u96C6\u5408\u5143\u7D20\u6620\u5C04\u5230\u4E00\u5F20\u8868\u7684\u4E00\u5217\u4E2D\u53BB\u3002\u6240\u4EE5\uFF0C\u4E3E\u4F8B\u8BF4\uFF0C\u4F60\u53EF\u80FD\u6709<code>java.lang.String</code>\u7C7B\u578B\u7684<code>getName()/setName()</code>\u5C5E\u6027\uFF0C\u5BF9\u5E94\u7684\u6301\u4E45\u5316\u5230<code>FIRST_NAME</code>,<code>INITIAL</code>\u548C<code>SURNAME</code>\u4E09\u5217\u4E2D\u3002
p5-2-3-2 = \u60F3\u8981\u5B9E\u73B0\u4E00\u4E2A\u81EA\u5B9A\u4E49\u7C7B\u578B\uFF0C\u9700\u8981\u5B9E\u73B0<code>org.hibernate.UserType</code>\u6216\u8005<code>org.hibernate.CompositeUserType</code>\uFF0C\u5E76\u4E14\u7528\u5168\u7C7B\u540D\u6765\u5B9A\u4E49\u5C5E\u6027\u3002\u67E5\u770B <code>org.hibernate.test.DoubleStringType</code>\uFF0C\u770B\u770B\u5B83\u662F\u600E\u4E48\u505A\u7684\u3002
p5-2-3-3 = \u6CE8\u610F\u8FD9\u91CC\u4F7F\u7528\u4E86<code>&lt;column&gt;</code>\u6807\u7B7E\u6620\u5C04\u4E86\u591A\u5217\u3002
p5-2-3-4 = <code>CompositeUserType</code>, <code>EnhancedUserType</code>, <code>UserCollectionType</code>, \u548C <code>UserVersionType</code>\u63A5\u53E3\u63D0\u4F9B\u4E86\u66F4\u591A\u7279\u522B\u7684\u7528\u6CD5\u3002
p5-2-3-5 = \u4F60\u751A\u81F3\u53EF\u4EE5\u5728\u6620\u5C04\u6587\u4EF6\u4E2D\u5C06\u53C2\u6570\u4F20\u7ED9UserType\u3002\u60F3\u8981\u8FD9\u4E48\u505A\uFF0CUserType\u5FC5\u987B\u5B9E\u73B0<code>org.hibernate.usertype.ParameterizedType</code>\u63A5\u53E3\u3002\u60F3\u8981\u4F20\u9012\u53C2\u6570\u7ED9\u81EA\u5B9A\u4E49\u7C7B\u578B\uFF0C\u4F60\u53EF\u4EE5\u5728\u4F60\u7684\u6620\u5C04\u6587\u4EF6\u4E2D\u4F7F\u7528<code>&lt;type&gt;</code>\u5143\u7D20\u3002
p5-2-3-6 = \u73B0\u5728<code>UserType</code>\u53EF\u4EE5\u4ECE\u4F20\u5165\u7684\u53C2\u6570\u503C\u4E2D\u83B7\u5F97\u9ED8\u8BA4\u7684\u5C5E\u6027\u503C\u3002
p5-2-3-7 = \u5982\u679C\u4F60\u7ECF\u5E38\u4F7F\u7528\u4E00\u4E2AUserType\uFF0C\u90A3\u4E48\u7ED9\u5B83\u4E00\u4E2A\u77ED\u4E00\u70B9\u7684\u540D\u5B57\u662F\u5341\u5206\u6709\u7528\u5904\u7684\u3002\u4F60\u53EF\u4EE5\u901A\u8FC7\u4F7F\u7528<code>&lt;typedef&gt;</code>\u5143\u7D20\u7C7B\u5B9E\u73B0\u3002Typedefs\u7ED9\u81EA\u5B9A\u4E49\u7C7B\u578B\u5206\u914D\u4E86\u4E00\u4E2A\u540D\u79F0\uFF0C\u5982\u679C\u6709\u53C2\u6570\u7684\u8BDD\u5B83\u8FD8\u4F1A\u5305\u542B\u4E00\u4E9B\u5217\u7684\u53C2\u6570\u9ED8\u8BA4\u503C\u3002
p5-2-3-8 = \u4E5F\u53EF\u4EE5\u6839\u636E\u5177\u4F53\u6848\u4F8B\u901A\u8FC7\u5C5E\u6027\u6620\u5C04\u4E2D\u7684\u7C7B\u578B\u53C2\u6570\u8986\u76D6\u5728typedef\u4E2D\u63D0\u4F9B\u7684\u53C2\u6570\u3002
p5-2-3-9 = \u7531\u4E8EHibernate\u4E30\u5BCC\u7684\u5185\u5EFA\u7C7B\u578B\u4EE5\u53CA\u5BF9\u7EC4\u4EF6\u7684\u652F\u6301\uFF0C\u4F60\u5F88\u5C11\u4F1A\u7528\u5230\u81EA\u5B9A\u4E49\u7C7B\u578B\uFF0C\u4F46\u662F\u5728\u5E94\u7528\u4E2D\u4E3A\u975E\u5B9E\u4F53\u7C7B\u4F7F\u7528\u81EA\u5B9A\u4E49\u7C7B\u578B\u4E5F\u662F\u4E00\u4E2A\u597D\u529E\u6CD5\u3002\u6BD4\u5982\uFF0C\u4E00\u4E2A<code>MonetaryAmount</code>\u4F7F\u7528<code>CompositeUserType</code>\u6765\u6620\u5C04\u5C31\u5F88\u4E0D\u9519\uFF0C\u867D\u7136\u5B83\u53EF\u4EE5\u88AB\u6620\u5C04\u6210\u4E00\u4E2A\u7EC4\u4EF6\u3002\u8FD9\u4E48\u505A\u7684\u4E00\u4E2A\u539F\u56E0\u662F\u62BD\u8C61\u3002\u4F7F\u7528\u81EA\u5B9A\u4E49\u7C7B\u578B\uFF0C\u91D1\u94B1\u663E\u793A\u65B9\u5F0F\u7684\u6539\u53D8\u5E76\u4E0D\u4F1A\u6539\u53D8\u4F60\u7684\u6620\u5C04\u6587\u4EF6\u3002
 
#		**********************************************************************************************************
#		5.3. Mapping a class more than once
#		**********************************************************************************************************

title5-3 = 5.3. \u591A\u6B21\u6620\u5C04\u540C\u4E00\u4E2A\u7C7B
p5-3-1 = \u4E3A\u4E00\u4E2A\u7279\u5B9A\u7684\u6301\u4E45\u5316\u7C7B\u63D0\u4F9B\u591A\u4E2A\u6620\u5C04\u662F\u53EF\u884C\u7684\u3002\u5728\u8FD9\u79CD\u60C5\u51B5\u4E0B\uFF0C\u4F60\u5FC5\u987B\u4E3A\u5B9E\u4F53\u6307\u5B9A\u4E00\u4E2A\u540D\u79F0\u6765\u6D88\u9664\u4E24\u4E2A\u88AB\u6620\u5C04\u5B9E\u4F53\u7684\u6B67\u4E49\u6027\u3002\u9ED8\u8BA4\u60C5\u51B5\u4E0B\uFF0C\u5B9E\u4F53\u540D\u548C\u7C7B\u540D\u76F8\u540C\u3002Hibernate\u5728\u64CD\u4F5C\u6301\u4E45\u5316\u5BF9\u8C61\uFF0C\u7F16\u5199\u67E5\u8BE2\u8BED\u53E5\u6216\u8005\u628A\u6620\u5C04\u8FD9\u9876\u5230\u5B9E\u4F53\u662F\u4F1A\u8BA9\u4F60\u6307\u5B9A\u5B9E\u4F53\u540D\u3002
p5-3-2 = \u8FD9\u91CC\u5173\u8054\u4F7F\u7528\u4E86<code>entity-name</code>\u800C\u4E0D\u662Fclass\u3002
nc5-3-1 = \u8FD9\u4E2A\u7279\u6027\u5728\u6CE8\u89E3\u4E2D\u4E0D\u88AB\u652F\u6301\u3002
 
#		**********************************************************************************************************
#		5.4. SQL quoted identifiers
#		**********************************************************************************************************

title5-4 = 5.4. SQL\u5F15\u7528\u6807\u793A\u7B26
p5-4-1 = \u4F60\u53EF\u901A\u8FC7\u5728\u6620\u5C04\u6587\u6863\u4E2D\u4F7F\u7528\u53CD\u5411\u5F15\u53F7(`)\u628A\u8868\u540D\u6216\u8005\u5B57\u6BB5\u540D\u5305\u56F4\u8D77\u6765\uFF0C\u4EE5\u5F3A\u5236Hibernate\u5728\u751F\u6210\u7684SQL\u4E2D\u628A\u6807\u8BC6\u7B26\u7528\u5F15\u53F7\u5305\u56F4\u8D77\u6765\u3002Hibernate\u4F1A\u4F7F\u7528\u76F8\u5E94\u7684SQLDialect(\u65B9\u8A00)\u6765\u4F7F\u7528\u6B63\u786E\u7684\u5F15\u53F7\u98CE\u683C(\u901A\u5E38\u662F\u53CC\u5F15\u53F7\uFF0C\u4F46\u662F\u5728SQL Server\u4E2D\u662F\u62EC\u53F7\uFF0CMySQL\u4E2D\u662F\u53CD\u5411\u5F15\u53F7)\u3002
 
#		**********************************************************************************************************
#		5.5. Generated properties
#		**********************************************************************************************************

title5-5 = 5.5. \u6570\u636E\u5E93\u751F\u6210\u5C5E\u6027
p5-5-1 = \u6570\u636E\u5E93\u751F\u6210\u5C5E\u6027\u662F\u6307\u6570\u636E\u5E93\u751F\u6210\u7684\u5177\u6709\u503C\u7684\u5C5E\u6027\u3002\u4E00\u822C\u6765\u8BF4\uFF0C\u5982\u679C\u5BF9\u8C61\u5305\u542B\u7531\u6570\u636E\u5E93\u751F\u6210\u7684\u4EFB\u4F55\u5C5E\u6027\uFF0CHibernate\u90FD\u9700\u8981\u8FDB\u884C\u5237\u65B0\u3002\u7136\u800C\u5982\u679C\u5C06\u5C5E\u6027\u6807\u8BB0\u6210generated\uFF0C\u5E94\u7528\u7A0B\u5E8F\u5C31\u5C06\u63A7\u5236\u6743\u4EA4\u7ED9\u4E86Hiberante\u3002\u5F53Hibernate\u6267\u884C\u4E86\u63D2\u5165\u6216\u66F4\u65B0\u64CD\u4F5C\u4E4B\u540E\uFF0C\u4F1A\u7ACB\u5373\u6267\u884Cselect\u6765\u83B7\u5F97\u8FD9\u4E9B\u751F\u6210\u503C\u3002
p5-5-2 = \u88AB\u6807\u8BB0\u4E3Agenerated\u7684\u5C5E\u6027\u5FC5\u987B\u662F\u4E0D\u53EF\u63D2\u5165\u4E5F\u4E0D\u53EF\u66F4\u65B0\u7684\u3002\u53EA\u6709<a href="#c5-5">versions</a>, <a href="#c5-1-3-2">timestamps</a>, \u548C <a href="#c5-1-4">simple properties</a>\u53EF\u4EE5\u88AB\u6807\u8BB0\u6210generated\u3002
p5-5-3 = <code>never</code> (\u9ED8\u8BA4\u503C): \u6B64\u5C5E\u6027\u503C\u4E0D\u7531\u6570\u636E\u5E93\u751F\u6210\u3002
p5-5-4 = <code>insert</code>: \u8FD9\u4E2A\u5C5E\u6027\u503C\u5728\u6267\u884C\u63D2\u5165\u64CD\u4F5C\u65F6\u751F\u6210\uFF0C\u4F46\u4E0D\u4F1A\u5728\u4E4B\u540E\u7684update\u65F6\u91CD\u65B0\u751F\u6210\u3002\u6BD4\u5982<code>created-date</code>\u5C5E\u6027\u5C31\u5C5E\u4E8E\u8FD9\u79CD\u60C5\u51B5\u3002\u867D\u7136<a href="#c5-5">versions</a>\u548C<a href="#c5-1-3-2">timestamps</a>\u53EF\u4EE5\u88AB\u6807\u8BB0\u6210generated\uFF0C\u4F46\u662F\u4E0D\u80FD\u505A\u8FD9\u4E2A\u64CD\u4F5C\u3002
p5-5-5 = <code>always</code>: \u65E0\u8BBA\u63D2\u5165\u8FD8\u662F\u66F4\u65B0\u64CD\u4F5C\u90FD\u4F1A\u751F\u6210\u8FD9\u4E2A\u5C5E\u6027\u503C\u3002
p5-5-6 = \u60F3\u8981\u5C06\u4E00\u4E2A\u5C5E\u6027\u6807\u8BB0\u6210generated\uFF0C\u4F7F\u7528<code>@Generated</code>\u3002
 
#		**********************************************************************************************************
#		5.6. Column transformers: read and write expressions
#		**********************************************************************************************************

title5-6 = 5.6. \u5217\u7684\u53D8\u5316\uFF1A\u8BFB\u548C\u5199\u8868\u8FBE\u5F0F
p5-6-1 = Hibernate\u5141\u8BB8\u4F60\u901A\u8FC7\u6620\u5C04<a href="#c5-1-4">simple properties</a>\u6765\u81EA\u5B9A\u4E49\u8BFB\u5199\u6240\u7528\u7684SQL\u3002\u6BD4\u5982\uFF0C\u5982\u679C\u4F60\u7684\u6570\u636E\u5E93\u63D0\u4F9B\u7684\u8BB8\u591A\u52A0\u5BC6\u65B9\u6CD5\uFF0C\u4F60\u53EF\u4EE5\u50CF\u8FD9\u6837\u4E3A\u4E00\u4E2A\u5355\u72EC\u7684\u5217\u6267\u884C\u5B83\u4EEC:
p5-6-2 = \u6216\u8005\u7528XML
nc5-6-1 = \u5982\u679C\u6709\u4E0D\u6B62\u4E00\u5217\u9700\u8981\u5B9A\u4E49\u8FD9\u4E9B\u89C4\u5219\uFF0C\u4F60\u53EF\u4EE5\u4F7F\u7528\u590D\u6570\u5F62\u5F0F<code>@ColumnTransformers</code>\u3002
p5-6-3 = \u5982\u679C\u4E00\u4E2A\u5C5E\u6027\u4F7F\u7528\u4E86\u4E0D\u6B62\u4E00\u5217\uFF0C\u4F60\u5FC5\u987B\u4F7F\u7528<code>forColumn</code>\u5C5E\u6027\u6765\u6307\u5B9A\u8868\u8FBE\u5F0F\u6307\u5B9A\u7684\u54EA\u4E00\u5217\u3002
p5-6-4 = \u5F53\u67E5\u8BE2\u4E2D\u8BFB\u5199\u5C5E\u6027\u65F6\uFF0CHibernate\u4F1A\u81EA\u52A8\u4F7F\u7528\u81EA\u5B9A\u4E49\u7684\u8868\u8FBE\u5F0F\uFF0C\u8FD9\u4E2A\u529F\u80FD\u4E0E\u6D3E\u751F\u7279\u6027\uFF08derived-property \uFF09<code>formula</code>\u5341\u5206\u76F8\u4F3C\uFF0C\u4F46\u6709\u4E24\u4E2A\u4E0D\u540C\u70B9\uFF1A
li5-6-1-1 = \u8FD9\u4E2A\u5C5E\u6027\u503C\u88AB\u4E00\u4E2A\u6216\u591A\u4E2A\u81EA\u52A8\u751F\u6210\u7684\u5217\u652F\u6301\u3002
li5-6-1-2 = \u8FD9\u4E2A\u5C5E\u6027\u503C\u53EF\u8BFB\u5199\uFF0C\u4E0D\u4EC5\u4EC5\u662F\u53EA\u8BFB\u3002
p5-6-5 = \u5982\u679C\u6307\u5B9A\u4E86<code>write</code>\u8868\u8FBE\u5F0F\uFF0C\u90A3\u4E48\u5B83\u5FC5\u987B\u4E3A\u503C\u4FDD\u7559\u4E00\u4E2A \u2018\uFF1F\u2019\u5360\u4F4D\u7B26\u3002
 
#		**********************************************************************************************************
#		5.7. Auxiliary database objects
#		**********************************************************************************************************

title5-7 = 5.7. \u8F85\u52A9\u6570\u636E\u5E93\u5BF9\u8C61
p5-7-1 = \u8F85\u52A9\u6570\u636E\u5E93\u5BF9\u8C61\u53EF\u4EE5\u521B\u5EFA\u548C\u5220\u9664\u4EFB\u610F\u6570\u636E\u5E93\u5BF9\u8C61\u3002\u4E0EHibernate\u56FE\u8868\u4EA4\u4E92\u5DE5\u5177\u7ED3\u5408\u8D77\u6765\uFF0C\u53EF\u4EE5\u6839\u636E\u7528\u6237\u7684\u6620\u5C04\u6587\u4EF6\u751F\u6210\u54CD\u5E94\u56FE\u8868\u3002\u5C3D\u7BA1\u8FD9\u662F\u4E3A\u4E86\u521B\u5EFA\u548C\u5220\u9664\u6BD4\u5982\u89E6\u53D1\u5668\uFF0C\u6216\u8005\u5B58\u50A8\u8FC7\u7A0B\u800C\u8BBE\u8BA1\u7684\uFF0C\u4F46\u662F\u4EFB\u4F55SQL\u6307\u4EE4\u90FD\u53EF\u4EE5\u901A\u8FC7<code>java.sql.Statement.execute()</code>\u6765\u6267\u884C\uFF08\u6BD4\u5982\uFF0CALTERs, INSERTs\u7B49\uFF09\u3002\u672C\u8D28\u4E0A\u6709\u4E24\u79CD\u6A21\u5F0F\u6765\u5B9A\u4E49\u8F85\u52A9\u6570\u636E\u5E93\u5BF9\u8C61\uFF1A
p5-7-2 = \u7B2C\u4E00\u79CD\u6A21\u5F0F\u662F\u5728\u6620\u5C04\u6587\u4EF6\u4E2D\u663E\u793A\u7684\u751F\u547D<code>CREATE</code>\u548C<code>DROP</code>\u547D\u4EE4\u3002
p5-7-3 = \u7B2C\u4E8C\u79CD\u6A21\u5F0F\u662F\u63D0\u4F9B\u4E00\u4E2A\u5305\u542B\u4E86<code>CREATE</code>\u548C<code>DROP</code>\u547D\u4EE4\u7684\u7684\u7C7B\u3002\u8FD9\u4E2A\u81EA\u5B9A\u4E49\u7C7B\u5FC5\u987B\u5B9E\u73B0<code>org.hibernate.mapping.AuxiliaryDatabaseObject</code>\u63A5\u53E3\u3002
p5-7-4 = \u53E6\u5916\uFF0C\u8FD9\u4E9B\u6570\u636E\u5E93\u5BF9\u8C61\u53EF\u4EE5\u7279\u522B\u6307\u5B9A\u4E3A\u4EC5\u5728\u7279\u5B9A\u7684\u65B9\u8A00\u4E2D\u624D\u4F7F\u7528\u3002
nc5-7-1 = \u5728\u6CE8\u91CA\u6A21\u5F0F\u4E0B\u4E0D\u652F\u6301\u8FD9\u4E2A\u7279\u6027\u3002
