
#		**********************************************************************************************************
#		Chapter 13. Transactions and Concurrency
#		**********************************************************************************************************

title13 = \u7B2C\u5341\u4E09\u7AE0. \u4E8B\u52A1\u548C\u5E76\u53D1
p13-1 = Hibernate\u6700\u91CD\u8981\u7684\u4E8B\u52A1\u5E76\u53D1\u63A7\u5236\u5F88\u5BB9\u6613\u638C\u63E1\u3002Hibernate\u76F4\u63A5\u4F7F\u7528JDBC\u94FE\u63A5\u548CJTA\u8D44\u6E90\uFF0C\u4E0D\u6DFB\u52A0\u4EFB\u4F55\u9644\u52A0\u7684\u9501\u5B9A\u884C\u4E3A\u3002\u6211\u4EEC\u63A8\u8350\u4F60\u82B1\u70B9\u65F6\u95F4\u4E86\u89E3JDBC\u7F16\u7A0B\uFF0CANSI SQL\u67E5\u8BE2\u8BED\u8A00\u548C\u4F60\u662F\u7528\u7684\u6570\u636E\u5E93\u7CFB\u7EDF\u7684\u4E8B\u52A1\u3002
p13-2 = Hibernate\u4E0D\u4F1A\u9501\u5B9A\u5185\u5B58\u4E2D\u7684\u5BF9\u8C61\u3002\u5E94\u7528\u7A0B\u5E8F\u4F1A\u6309\u7167\u6570\u636E\u5E93\u4E2D\u5B9A\u4E49\u7684\u4E8B\u52A1\u9694\u79BB\u7EA7\u522B\u89C4\u5B9A\u7684\u90A3\u6837\u8FD0\u884C\u3002Session\u4E5F\u662F\u4E8B\u52A1\u7EA7\u522B\u7684\u7F13\u5B58\uFF0C\u901A\u8FC7\u5B83Hibernate\u63D0\u4F9B\u4E86\u901A\u8FC7\u6807\u793A\u7B26\u67E5\u627E\u6216\u8005\u5B9E\u4F53\u67E5\u8BE2\u800C\u4E0D\u662F\u8FD4\u56DE\u6807\u91CF\u503C\u7684\u62A5\u8868\u67E5\u8BE2\u7684\u53EF\u91CD\u590D\u8BFB\u53D6\u7684\u529F\u80FD\u3002
p13-3 = \u9664\u4E86\u81EA\u52A8\u4E50\u89C2\u5E76\u53D1\u7248\u672C\u7BA1\u7406\u4E4B\u5916\uFF0C\u9488\u5BF9\u884C\u7EA7\u60B2\u89C2\u9501\u5B9A\uFF0CHibernate\u4E5F\u63D0\u4F9B\u4E86\u8F85\u52A9\u7684API(\u8F83\u5C0F\u7684)\uFF0C\u5B83\u4F7F\u7528\u4E86<code>SELECT FOR UPDATE </code>\u7684\u8BED\u6CD5\u3002\u672C\u7AE0\u7684\u540E\u9762\u4F1A\u8BA8\u8BBA\u4E50\u89C2\u5E76\u53D1\u63A7\u5236\u548C\u8FD9\u4E2AAPI\u3002
p13-4 = \u6211\u4EEC\u4ECE\u914D\u7F6E\u7684\u7C92\u5EA6\u3001<code>SessionFactory</code>\u3001<code>Session</code>\u548C\u6570\u636E\u5E93\u4E8B\u52A1\u548C\u5E38\u957F\u4E8B\u52A1\u7684\u89D2\u5EA6\u6765\u8BA8\u8BBAHibernate\u5E76\u53D1\u63A7\u5236\u3002

#		**********************************************************************************************************
#		13.1. Session and transaction scopes
#		**********************************************************************************************************

title13-1 = 13.1. Session \u548C\u4E8B\u52A1\u8303\u56F4
p13-1-1 = \u521B\u5EFA<code>SessionFactory</code> \u5BF9\u8C61\u662F\u5F88\u6602\u8D35\u7684, \u5B83\u662F\u7EBF\u7A0B\u5B89\u5168\u7684\uFF0C\u88AB\u6240\u6709\u5E94\u7528\u7EBF\u7A0B\u5171\u4EAB\u3002\u4ED6\u53EA\u521B\u5EFA\u4E00\u6B21\uFF0C\u901A\u5E38\u662F\u5728\u5E94\u7528\u542F\u52A8\u7684\u65F6\u5019\uFF0C\u6709\u4E00\u4E2AConfiguration \u5B9E\u4F8B\u6765\u521B\u5EFA\u3002
p13-1-2 = \u521B\u5EFA<code>Session</code>\u5BF9\u8C61\u7684\u4EE3\u4EF7\u6BD4\u8F83\u5C0F\uFF0C\u662F\u975E\u7EBF\u7A0B\u5B89\u5168\u7684\uFF0C\u5BF9\u4E8E\u5355\u4E2A\u8BF7\u6C42\uFF0C\u5355\u4E2A\u4F1A\u8BDD\u6216\u8005\u5355\u4E2A\u5DE5\u4F5C\u5355\u5143\u800C\u8A00\u5B83\u53EA\u80FD\u88AB\u4F7F\u7528\u4E00\u4E2A\u3002\u53EA\u6709\u5728\u9700\u8981\u7684\u65F6\u5019\uFF0C\u4E00\u4E2ASession\u5BF9\u8C61\u624D\u4F1A\u83B7\u53D6JDBC\u94FE\u63A5\uFF0C\u6216\u8005\u4E00\u4E2A<code>Datasource</code>\u5BF9\u8C61\u3002\u5982\u679C\u4E0D\u9002\u7528\u7684\u8BDD\u4E0D\u4F1A\u6D88\u8017\u4EFB\u4F55\u7684\u8D44\u6E90\u3002
p13-1-3 = \u4E3A\u4E86\u964D\u4F4E\u6570\u636E\u5E93\u4E2D\u7684\u9501\u4E89\u7528\uFF0C\u4E00\u4E2A\u6570\u636E\u5E93\u4E8B\u52A1\u5E94\u8BE5\u5C3D\u53EF\u80FD\u7684\u77ED\u3002\u957F\u6570\u636E\u5E93\u4E8B\u52A1\u4F1A\u963B\u6B62\u4F60\u7684\u5E94\u7528\u7A0B\u5E8F\u6269\u5C55\u5230\u9AD8\u7684\u5E76\u53D1\u8D1F\u8F7D\u3002\u5047\u82E5\u5728\u7528\u6237\u601D\u8003\u671F\u95F4\u8BA9\u6570\u636E\u5E93\u4E8B\u52A1\u5F00\u7740\uFF0C\u77E5\u9053\u6574\u4E2A\u5DE5\u4F5C\u5355\u5143\u5B8C\u6210\u624D\u5173\u95ED\u4E8B\u52A1\uFF0C\u8FD9\u7EDD\u4E0D\u662F\u4E00\u4E2A\u597D\u7684\u8BBE\u8BA1\u3002
p13-1-4 = \u4E00\u4E2A\u5DE5\u4F5C\u5355\u5143\u7684\u8303\u56F4\u662F\u591A\u5927\uFF1F\u4E00\u4E2AHibernate Session\u53EF\u4EE5\u8DE8\u8D8A\u591A\u4E2A\u6570\u636E\u5E93\u4E8B\u52A1\u5417\uFF1F\u8FD8\u662F\u4ED6\u4EEC\u662F\u4E00\u5BF9\u4E00\u7684\u5173\u7CFB\uFF1F\u5E94\u8BE5\u4F55\u65F6\u6253\u5F00\u548C\u5173\u95ED\u4E00\u4E2ASession\u5E76\u4E14\u600E\u6837\u5B9A\u4E49\u6570\u636E\u5E93\u4E8B\u52A1\u7684\u8FB9\u754C\uFF1F\u8FD9\u4E9B\u95EE\u9898\u5C06\u4F1A\u5728\u4E0B\u9762\u7684\u7AE0\u8282\u4E2D\u8BB2\u89E3\u3002

#		**********************************************************************************************************
#		13.1.1. Unit of work
#		**********************************************************************************************************

title13-1-1 = 13.1.1. \u5DE5\u4F5C\u5355\u5143
p13-1-1-1 = \u9996\u5148\uFF0C\u6211\u4EEC\u6765\u5B9A\u4E49\u4E00\u4E2A\u5DE5\u4F5C\u5355\u5143\u3002\u4E00\u4E2A\u5DE5\u4F5C\u5355\u5143\u662F\u4E00\u4E2A\u8BBE\u8BA1\u6A21\u5F0F\uFF0C\u5982Martin Fowler\u6240\u63CF\u8FF0\u7684\u201C [\u7EF4\u62A4\u4E2D] \u53D7\u4E1A\u52A1\u4E8B\u52A1\u5F71\u54CD\u7684\u4E00\u7EC4\u5BF9\u8C61\uFF0C\u5E76\u4E14\u534F\u8C03\u53D8\u5316\u7684\u8F93\u51FA\uFF0C\u548C\u5E76\u53D1\u95EE\u9898\u7684\u89E3\u51B3\u65B9\u6848\u3002\u201D[PoEAA] \u6362\u53E5\u8BDD\u8BF4, \u662F\u6211\u4EEC\u5E0C\u671B\u4E00\u8D77\u5BF9\u5230\u6570\u636E\u5E93\u6267\u884C\u7684\u4E00\u7CFB\u5217\u64CD\u4F5C\u3002\u6700\u57FA\u7840\u7684\uFF0C\u4ED6\u662F\u4E00\u4E2A\u4E8B\u52A1\uFF0C\u5C3D\u7BA1\u5B8C\u6210\u4E00\u4E2A\u5DE5\u4F5C\u5355\u5143\u901A\u5E38\u9700\u8981\u8DE8\u8D8A\u591A\u4E2A\u7269\u7406\u7684\u6570\u636E\u5E93\u4E8B\u52A1\u3002(\u53C2\u8003 <a href="c13-1-2">Section 13.1.2, \u201C\u957F\u4F1A\u8BDD\u201D</a>)\u3002\u6240\u4EE5\u6211\u4EEC\u8BA8\u8BBA\u7684\u662F\u4E8B\u52A1\u7684\u66F4\u62BD\u8C61\u7684\u6982\u5FF5\u3002\u672F\u8BED "\u4E1A\u52A1\u4E8B\u52A1" \u6709\u65F6\u5019\u4E5F\u7528\u4E8E\u8868\u793A\u5DE5\u4F5C\u5355\u5143\u3002
p13-1-1-2 = \u4E0D\u8981\u4F7F\u7528session-per-operation \u8FD9\u79CD\u53CD\u6A21\u5F0F: \u4E0D\u8981\u5728\u5355\u4E2A\u7EBF\u7A0B\u4E2D\u4E3A\u4E00\u4E2A\u7B80\u5355\u7684\u6570\u636E\u5E93\u8C03\u7528\u5C31\u6253\u5F00\u548C\u5173\u95ED\u4E00\u6B21Session\u3002\u6570\u636E\u4E8B\u52A1\u4E5F\u662F\u5982\u6B64\u3002\u5E94\u7528\u4E2D\u6570\u636E\u5E93\u7684\u8C03\u7528\u662F\u6309\u7167\u6392\u5E8F\u597D\u7684\u6B21\u5E8F\uFF1B\u4ED6\u4EEC\u6309\u7167\u539F\u5B50\u64CD\u4F5C\u5355\u5143\u5206\u7EC4\u3002\u8FD9\u610F\u5473\u7740\uFF0C\u5728\u5E94\u7528\u7A0B\u5E8F\u4E2D\uFF0C\u5728\u5355\u4E2A\u7684SQL\u8BED\u53E5\u53D1\u9001\u4E4B\u540E\uFF0C\u81EA\u52A8\u4E8B\u52A1\u63D0\u4EA4\u6A21\u5F0F\u5931\u6548\u4E86\u3002\u8FD9\u79CD\u6A21\u5F0F\u64B0\u6587\u4E3ASQL\u63A7\u5236\u53F0\u64CD\u4F5C\u8BBE\u8BA1\u7684\u3002 Hibernate\u7981\u6B62\u7ACB\u5373\u81EA\u52A8\u63D0\u4EA4\u6A21\u5F0F\uFF0C\u6216\u8005\u671F\u671B\u5E94\u7528\u670D\u52A1\u5668\u7981\u6B62\u7ACB\u5373\u81EA\u52A8\u63D0\u4EA4\u6A21\u5F0F\u3002\u6570\u636E\u5E93\u4E8B\u52A1\u7EDD\u4E0D\u662F\u53EF\u6709\u53EF\u65E0\u7684\u3002\u4EFB\u4F55\u4E0E\u6570\u636E\u5E93\u4E4B\u95F4\u7684\u901A\u8BAF\u90FD\u5FC5\u987B\u5728\u67D0\u4E2A\u4E8B\u52A1\u4E2D\u8FDB\u884C\uFF0C\u4E0D\u7BA1\u4F60\u662F\u5728\u8BFB\u8FD8\u662F\u5728\u5199\u6570\u636E\u3002\u5BF9\u6570\u636E\u800C\u8A00\uFF0C\u5E94\u8BE5\u907F\u514DAuto-commit\u884C\u4E3A\uFF0C\u56E0\u4E3A\u5F88\u591A\u5C0F\u7684\u4E8B\u52A1\u6BD4\u4E00\u4E2A\u6E05\u6670\u5B9A\u4E49\u7684\u5DE5\u4F5C\u5355\u5143\u6027\u80FD\u5DEE\u3002\u540E\u8005\u4E5F\u66F4\u5BB9\u6613\u7EF4\u62A4\u548C\u6269\u5C55\u3002
p13-1-1-3 = \u5728\u591A\u7528\u6237\u7684client/server \u5E94\u7528\u4E2D\uFF0C\u6700\u5E38\u7528\u7684\u6A21\u5F0F\u662F\u6BCF\u4E2A\u8BF7\u6C42\u4E00\u4E2A\u4F1A\u8BDD\u3002\u5728\u8FD9\u79CD\u6A21\u5F0F\u4E0B\uFF0C\u6765\u81EA\u5BA2\u6237\u7AEF\u7684\u8BF7\u6C42\u88AB\u53D1\u9001\u5230\u670D\u52A1\u5668\u5373Hibernate\u6301\u4E45\u5C42\u8FD0\u884C\u7684\u5730\u65B9\u3002\u4E00\u4E2A\u65B0\u7684 Hibernate <code>Session</code>\u88AB\u6253\u5F00\uFF0C\u5E76\u4E14\u6267\u884C\u8FD9\u4E2A\u64CD\u4F5C\u5355\u5143\u4E2D\u6240\u6709\u7684\u6570\u636E\u5E93\u64CD\u4F5C\u3002\u4E00\u65E6\u64CD\u4F5C\u5B8C\u6210 \u540C\u65F6\u5BF9\u5BA2\u6237\u7AEF\u7684\u54CD\u5E94\u4E5F\u51C6\u5907\u5C31\u7EEA\uFF0C\u540C\u65F6\u5BF9\u5BA2\u6237\u7AEF\u7684\u54CD\u5E94\u4E5F\u51C6\u5907\u5C31\u7EEA\u3002\u4F60\u4E5F\u53EF\u4EE5\u4F7F\u7528\u5355 \u4E2A\u6570\u636E\u5E93\u4E8B\u52A1\u6765\u5904\u7406\u5BA2\u6237\u7AEF\u8BF7\u6C42\uFF0C\u5728\u4F60\u6253\u5F00Session\u4E4B\u540E\u542F\u52A8\u4E8B\u52A1\uFF0C\u5728\u4F60\u5173\u95ED Session\u4E4B\u524D\u63D0\u4EA4\u4E8B\u52A1\u3002\u4F1A\u8BDD\u548C\u8BF7\u6C42\u4E4B\u95F4\u7684\u5173\u7CFB\u662F\u4E00\u5BF9\u4E00\u7684\u5173\u7CFB\uFF0C\u8FD9\u79CD\u6A21\u5F0F\u5BF9 \u4E8E\u5927\u591A\u6570\u5E94\u7528\u7A0B\u5E8F\u6765\u8BF4\u662F\u5F88\u68D2\u7684\u3002
p13-1-1-4 = \u5B9E\u73B0\u624D\u662F\u771F\u6B63\u7684\u6311\u6218\u3002Hibernate\u5185\u7F6E\u4E86\u5BF9"\u5F53\u524Dsession(current session)" \u7684\u7BA1\u7406\uFF0C\u7528\u4E8E\u7B80\u5316\u6B64\u6A21\u5F0F\u3002\u4F60\u8981\u505A\u7684\u4E00\u5207\u5C31\u662F\u5728\u670D\u52A1\u5668\u7AEF\u8981\u5904\u7406\u8BF7\u6C42\u7684\u65F6\u5019\uFF0C\u5F00\u542F\u4E8B\u52A1\uFF0C\u5728\u54CD\u5E94\u53D1\u9001\u7ED9\u5BA2\u6237\u4E4B\u524D\u7ED3\u675F\u4E8B\u52A1\u3002\u4F60\u53EF\u4EE5\u7528\u4EFB\u4F55\u65B9\u5F0F\u6765\u5B8C\u6210\u8FD9\u4E00\u64CD\u4F5C\uFF0C\u901A\u5E38\u7684\u65B9\u6848\u6709ServletFilter\uFF0C\u5728service\u65B9\u6CD5\u4E2D\u8FDB\u884Cpointcut\u7684AOP\u62E6\u622A\u5668\uFF0C \u6216\u8005proxy/interception\u5BB9\u5668\u3002 EJB\u5BB9\u5668\u662F\u5B9E\u73B0\u6A2A\u5207\u8BF8\u5982EJB session bean\u4E0A\u7684\u4E8B\u52A1\u5206\u754C\uFF0C\u7528CMT\u5BF9\u4E8B\u52A1\u8FDB\u884C\u58F0\u660E\u7B49\u65B9\u9762\u7684\u6807\u51C6\u624B\u6BB5\u3002\u5047\u82E5\u4F60\u51B3\u5B9A\u4F7F\u7528\u7F16\u7A0B\u5F0F\u7684\u4E8B\u52A1\u5206\u754C\uFF0C\u8BF7\u53C2\u8003\u672C\u7AE0\u540E\u9762\u8BB2\u5230\u7684Hibernate Transaction API\uFF0C\u8FD9\u5BF9\u6613\u7528\u6027\u548C\u4EE3\u7801\u53EF\u79FB\u690D\u6027\u90FD\u6709\u597D\u5904\u3002
p13-1-1-5 = \u5728\u4EFB\u4F55\u65F6\u95F4\uFF0C\u4EFB\u4F55\u5730\u65B9\uFF0C\u4F60\u7684\u5E94\u7528\u4EE3\u7801\u53EF\u4EE5\u901A\u8FC7\u7B80\u5355\u7684\u8C03\u7528<code>sessionFactory.getCurrentSession()</code>\u6765\u8BBF\u95EE"\u5F53\u524Dsession"\uFF0C\u7528\u4E8E\u5904\u7406\u8BF7\u6C42\u3002\u4F60\u603B\u662F\u4F1A\u5F97\u5230\u5F53\u524D\u6570\u636E\u5E93\u4E8B\u52A1\u8303\u56F4\u5185\u7684Session\u3002\u5728\u4F7F\u7528\u672C\u5730\u8D44\u6E90\u6216JTA\u73AF\u5883\u65F6\uFF0C\u5FC5\u987B\u914D\u7F6E\u5B83\uFF0C \u53C2\u8003 <a href="#c2-2">Section 2.2, \u201C\u4E0A\u4E0B\u6587\u76F8\u5173\u7684sessions\u201D</a>\u3002
p13-1-1-6 = \u6709\u65F6\uFF0C\u5C06Session\u548C\u6570\u636E\u5E93\u4E8B\u52A1\u7684\u8FB9\u754C\u5EF6\u4F38\u5230"\u5C55\u793A\u5C42\u88AB\u6E32\u67D3\u540E"\u4F1A\u5E26\u6765\u4FBF\u5229\u3002\u6709\u4E9Bserlvet\u5E94\u7528\u7A0B\u5E8F\u5728\u5BF9\u8BF7\u6C42\u8FDB\u884C\u5904\u7406\u540E\uFF0C\u6709\u4E2A\u5355\u72EC\u7684\u6E32\u67D3\u671F\uFF0C\u8FD9\u79CD\u5EF6\u4F38\u5BF9\u8FD9\u79CD\u7A0B\u5E8F\u7279\u522B\u6709\u7528\u3002\u5047\u82E5\u4F60\u5B9E\u73B0\u4F60\u81EA\u5DF1\u7684\u62E6\u622A\u5668\uFF0C\u628A\u4E8B\u52A1\u8FB9\u754C\u5EF6\u4F38\u5230\u5C55\u793A\u5C42\u6E32\u67D3\u7ED3\u675F\u540E\u975E\u5E38\u5BB9\u6613\u3002\u7136\u800C\uFF0C\u5047\u82E5\u4F60\u4F9D\u8D56\u6709\u5BB9\u5668\u7BA1\u7406\u4E8B\u52A1\u7684EJB\uFF0C\u8FD9\u5C31\u4E0D\u592A\u5BB9\u6613\u4E86\uFF0C\u56E0\u4E3A\u4E8B\u52A1\u4F1A\u5728EJB\u65B9\u6CD5\u8FD4\u56DE\u540E\u7ED3\u675F\uFF0C\u800C\u90A3\u662F\u5728\u4EFB\u4F55\u5C55\u793A\u5C42\u6E32\u67D3\u5F00\u59CB\u4E4B\u524D\u3002\u8BF7\u8BBF\u95EEHibernate\u7F51\u7AD9\u548C\u8BBA\u575B\uFF0C\u4F60\u53EF\u4EE5\u627E\u5230Open Session in View\u8FD9\u4E00\u6A21\u5F0F\u7684\u63D0\u793A\u548C\u793A\u4F8B\u3002

#		**********************************************************************************************************
#		13.1.2. Long conversations
#		**********************************************************************************************************

title13-1-2 = 13.1.2. \u957F\u5BF9\u8BDD
p13-1-2-1 = session-per-request\u6A21\u5F0F\u4E0D\u4EC5\u4EC5\u662F\u4E00\u4E2A\u53EF\u4EE5\u7528\u6765\u8BBE\u8BA1\u64CD\u4F5C\u5355\u5143\u7684\u6709\u7528\u6982\u5FF5\u3002\u5F88\u591A\u4E1A\u52A1\u5904\u7406\u90FD\u9700 \u8981\u4E00\u7CFB\u5217\u5B8C\u6574\u7684\u4E0E\u7528\u6237\u4E4B\u95F4\u7684\u4EA4\u4E92\uFF0C\u800C\u8FD9\u4E9B\u7528\u6237\u662F\u6307\u5BF9\u6570\u636E\u5E93\u6709\u4EA4\u53C9\u8BBF\u95EE\u7684\u7528\u6237\u3002\u5728\u57FA\u4E8Eweb\u7684\u5E94\u7528\u548C\u4F01\u4E1A\u5E94\u7528\u4E2D\uFF0C\u8DE8\u7528\u6237\u4EA4\u4E92\u7684\u6570\u636E\u5E93\u4E8B\u52A1\u662F\u65E0\u6CD5\u63A5\u53D7\u7684\u3002\u8003\u8651\u4E0B\u9762\u7684\u4F8B\u5B50\uFF1A
li13-1-2-1-1 = \u5728\u754C\u9762\u7684\u7B2C\u4E00\u5C4F\uFF0C\u6253\u5F00\u5BF9\u8BDD\u6846\uFF0C\u7528\u6237\u6240\u770B\u5230\u7684\u6570\u636E\u662F\u88AB\u4E00\u4E2A\u7279\u5B9A\u7684 Session \u548C\u6570\u636E\u5E93\u4E8B\u52A1\u8F7D\u5165(load)\u7684\u3002\u7528\u6237\u53EF\u4EE5\u968F\u610F\u4FEE\u6539\u5BF9\u8BDD\u6846\u4E2D\u7684\u6570\u636E\u5BF9\u8C61\u3002
li13-1-2-1-2 = 5\u5206\u949F\u540E\uFF0C\u7528\u6237\u70B9\u51FB\u201C\u4FDD\u5B58\u201D\uFF0C\u671F\u671B\u6240\u505A\u51FA\u7684\u4FEE\u6539\u88AB\u6301\u4E45\u5316\uFF1B\u540C\u65F6\u4ED6\u4E5F\u671F\u671B\u81EA\u5DF1\u662F\u552F\u4E00\u4FEE\u6539\u8FD9\u4E2A\u4FE1\u606F\u7684\u4EBA\uFF0C\u4E0D\u4F1A\u51FA\u73B0\u4FEE\u6539\u51B2\u7A81\u3002
p13-1-2-2 = \u4ECE\u7528\u6237\u7684\u89D2\u5EA6\u6765\u770B\uFF0C\u6211\u4EEC\u628A\u8FD9\u4E2A\u64CD\u4F5C\u5355\u5143\u79F0\u4E3A\u957F\u65F6\u95F4\u8FD0\u884C\u7684\u5BF9\u8BDD\u6216\u8005 <code>application transaction</code>\u5E94\u7528\u4E8B\u52A1\u3002\u5728\u4F60\u7684\u5E94\u7528\u7A0B\u5E8F\u4E2D\uFF0C\u53EF\u4EE5\u6709\u5F88\u591A\u79CD\u65B9\u6CD5\u6765\u5B9E\u73B0\u5B83\u3002
p13-1-2-3 = \u5934\u4E00\u4E2A\u5E7C\u7A1A\u7684\u505A\u6CD5\u662F\uFF0C\u5728\u7528\u6237\u601D\u8003\u7684\u8FC7\u7A0B\u4E2D\uFF0C\u4FDD\u6301Session\u548C\u6570\u636E\u5E93\u4E8B\u52A1\u662F\u6253\u5F00\u7684\uFF0C\u4FDD\u6301\u6570\u636E\u5E93\u9501\u5B9A\uFF0C\u4EE5\u963B\u6B62\u5E76\u53D1\u4FEE\u6539\uFF0C\u4ECE\u800C\u4FDD\u8BC1\u6570\u636E\u5E93\u4E8B\u52A1\u9694\u79BB\u7EA7\u522B\u548C\u539F\u5B50\u64CD\u4F5C\u3002\u8FD9\u79CD\u65B9\u5F0F\u5F53\u7136\u662F\u4E00\u4E2A\u53CD\u6A21\u5F0F\uFF0C \u56E0\u4E3A\u9501\u4E89\u7528\u4F1A\u5BFC\u81F4\u5E94\u7528\u7A0B\u5E8F\u65E0\u6CD5\u6269\u5C55\u5E76\u53D1\u7528\u6237\u7684\u6570\u76EE\u3002
p13-1-2-4 = \u5F88\u660E\u663E\uFF0C\u6211\u4EEC\u5FC5\u987B\u4F7F\u7528\u591A\u4E2A\u6570\u636E\u5E93\u4E8B\u52A1\u6765\u5B9E\u73B0\u8FD9\u4E2A\u5BF9\u8BDD\u3002\u5728\u8FD9\u4E2A\u4F8B\u5B50\u4E2D\uFF0C\u7EF4\u62A4\u4E1A\u52A1\u5904\u7406\u7684\u4E8B\u52A1\u9694\u79BB\u53D8\u6210\u4E86\u5E94\u7528\u7A0B\u5E8F\u5C42\u7684\u90E8\u5206\u8D23\u4EFB\u3002\u4E00\u4E2A\u5BF9\u8BDD\u901A\u5E38\u8DE8\u8D8A\u591A\u4E2A\u6570\u636E\u5E93\u4E8B\u52A1\u3002 \u3002\u5982\u679C\u4EC5\u4EC5\u53EA\u6709\u4E00 \u4E2A\u6570\u636E\u5E93\u4E8B\u52A1\uFF08\u6700\u540E\u7684\u90A3\u4E2A\u4E8B\u52A1\uFF09\u4FDD\u5B58\u66F4\u65B0\u8FC7\u7684\u6570\u636E\uFF0C\u800C\u6240\u6709\u5176\u4ED6\u4E8B\u52A1\u53EA\u662F\u5355\u7EAF\u7684\u8BFB\u53D6\u6570\u636E\uFF08\u4F8B\u5982\u5728\u4E00 \u4E2A\u8DE8\u8D8A\u591A\u4E2A\u8BF7\u6C42/\u54CD\u5E94\u5468\u671F\u7684\u5411\u5BFC\u98CE\u683C\u7684\u5BF9\u8BDD\u6846\u4E2D\uFF09\uFF0C\u90A3\u4E48\u5E94\u7528\u7A0B\u5E8F\u4E8B\u52A1\u5C06\u4FDD\u8BC1\u5176\u539F\u5B50\u6027\u3002\u8FD9\u79CD\u65B9\u5F0F\u6BD4\u542C \u8D77\u6765\u8FD8\u8981\u5BB9\u6613\u5B9E\u73B0\uFF0C\u7279\u522B\u662F\u5F53\u4F60\u4F7F\u7528\u4E86Hibernate\u7684\u4E0B\u8FF0\u7279\u6027\u7684\u65F6\u5019\uFF1A
li13-1-2-2-1 = <code>\u81EA\u52A8\u7248\u672C\u5316</code>: Hibernate\u80FD\u591F\u81EA\u52A8\u8FDB\u884C\u4E50\u89C2\u5E76\u53D1\u63A7\u5236\u3002\u5982\u679C\u5728\u7528\u6237\u601D\u8003 \u7684\u8FC7\u7A0B\u4E2D\u53D1\u751F\u5E76\u53D1\u4FEE\u6539\uFF0CHibernate\u80FD\u591F\u81EA\u52A8\u68C0\u6D4B\u5230\u3002\u4E00\u822C\u6211\u4EEC\u53EA\u5728\u5BF9\u8BDD\u7ED3\u675F\u65F6\u624D\u68C0\u67E5\u3002
li13-1-2-2-2 = <code>\u8131\u7BA1\u5BF9\u8C61</code>: \u5982\u679C\u4F60\u51B3\u5B9A\u91C7\u7528\u524D\u9762\u5DF2\u7ECF\u8BA8\u8BBA\u8FC7\u7684 session-per-request\u6A21\u5F0F\uFF0C\u6240\u6709\u8F7D\u5165\u7684\u5B9E\u4F8B\u5728\u7528\u6237\u601D\u8003\u7684\u8FC7\u7A0B \u4E2D\u90FD\u5904\u4E8E\u4E0ESession\u8131\u79BB\u7684\u72B6\u6001\u3002 Hibernate\u5141\u8BB8\u4F60\u628A\u4E0ESession\u8131\u79BB\u7684\u5BF9\u8C61\u91CD\u65B0\u5173\u8054\u5230Session \u4E0A\uFF0C\u5E76\u4E14\u5BF9\u4FEE\u6539\u8FDB\u884C\u6301\u4E45\u5316\uFF0C\u8FD9\u79CD\u6A21\u5F0F\u88AB\u79F0\u4E3A session-per-request-with-detached-objects\u3002\u81EA\u52A8\u7248\u672C\u5316\u88AB\u7528\u6765\u9694\u79BB\u5E76\u53D1\u4FEE\u6539\u3002
li13-1-2-2-3 = <code>\u6269\u5C55\u7684 (\u6216\u8005\u957F) Session</code>:Hibernate \u7684Session \u53EF\u4EE5\u5728\u6570\u636E\u5E93\u4E8B\u52A1\u63D0\u4EA4\u4E4B\u540E\u548C\u5E95\u5C42\u7684JDBC\u8FDE\u63A5\u65AD\u5F00\uFF0C\u5F53\u4E00\u4E2A\u65B0\u7684\u5BA2\u6237\u7AEF\u8BF7\u6C42\u5230\u6765\u7684\u65F6\u5019\uFF0C\u5B83\u53C8\u91CD\u65B0\u8FDE\u63A5\u4E0A\u5E95\u5C42\u7684 JDBC\u8FDE\u63A5\u3002\u8FD9\u79CD\u6A21\u5F0F\u88AB\u79F0\u4E4B\u4E3Asession-per-conversation\uFF0C\u8FD9\u79CD\u60C5\u51B5\u53EF \u80FD\u4F1A\u9020\u6210\u4E0D\u5FC5\u8981\u7684Session\u548CJDBC\u8FDE\u63A5\u7684\u91CD\u65B0\u5173\u8054\u3002\u81EA\u52A8\u7248\u672C\u5316\u88AB\u7528\u6765\u9694\u79BB\u5E76\u53D1\u4FEE\u6539, Session\u901A\u5E38\u4E0D\u5141\u8BB8\u81EA\u52A8flush,\u800C\u662F\u660E\u786Eflush\u3002
p13-1-2-5 = <code>session-per-request-with-detached-objects</code> \u548C <code>session-per-conversation</code> \u5404\u6709\u4F18\u7F3A\u70B9\uFF0C\u6211\u4EEC\u5728\u672C\u7AE0\u540E\u9762\u4E50\u89C2\u5E76\u53D1 \u63A7\u5236\u90A3\u90E8\u5206\u518D\u8FDB\u884C\u8BA8\u8BBA\u3002

#		**********************************************************************************************************
#		13.1.3. Considering object identity
#		**********************************************************************************************************

title13-1-3 = 13.1.3. \u5173\u6CE8\u5BF9\u8C61\u6807\u8BC6
p13-1-3-1 = \u5E94\u7528\u7A0B\u5E8F\u53EF\u80FD\u5728\u4E24\u4E2A\u4E0D\u540C\u7684Session\u4E2D\u5E76\u53D1\u8BBF\u95EE\u540C\u4E00\u6301\u4E45\u5316\u72B6\u6001\uFF0C\u4F46\u662F\uFF0C \u4E00\u4E2A\u6301\u4E45\u5316\u7C7B\u7684\u5B9E\u4F8B\u65E0\u6CD5\u5728\u4E24\u4E2A Session\u4E2D\u5171\u4EAB\u3002\u56E0\u6B64\u6709\u4E24\u79CD\u4E0D\u540C\u7684\u6807\u8BC6\u8BED\u4E49\uFF1A
p13-1-3-2 = \u5BF9\u4E8E\u90A3\u4E9B\u5173\u8054\u5230 \u7279\u5B9A<code>Session</code>\u4E0A\u7684\u5BF9\u8C61\u6765\u8BF4 (\u4E5F\u5C31\u662F\u5728\u5355\u4E2ASession\u7684\u8303\u56F4\u5185), \u8FD9 \u4E24\u79CD\u6807\u8BC6\u7684\u8BED\u4E49\u662F\u7B49\u4EF7\u7684,\u4E0E\u6570\u636E\u5E93\u6807\u8BC6\u5BF9\u5E94\u7684JVM\u6807\u8BC6\u662F\u7531Hibernate\u6765\u4FDD\u8BC1\u7684. \u4E0D\u8FC7\uFF0C\u5F53\u5E94\u7528\u7A0B\u5E8F\u5728\u4E24\u4E2A\u4E0D\u540C\u7684session\u4E2D\u5E76\u53D1\u8BBF\u95EE\u5177\u6709\u540C\u4E00\u6301\u4E45\u5316\u6807 \u8BC6\u7684\u4E1A\u52A1\u5BF9\u8C61\u5B9E\u4F8B\u7684\u65F6\u5019\uFF0C\u8FD9\u4E2A\u4E1A\u52A1\u5BF9\u8C61\u7684\u4E24\u4E2A\u5B9E\u4F8B\u4E8B\u5B9E\u4E0A\u662F\u4E0D\u76F8\u540C\u7684\uFF08\u4ECE JVM\u8BC6\u522B\u6765\u770B\uFF09\u3002\u8FD9\u79CD\u51B2\u7A81\u53EF\u4EE5\u901A\u8FC7\u5728\u540C\u6B65\u548C\u63D0\u4EA4\u7684\u65F6\u5019\u4F7F\u7528\u81EA\u52A8\u7248\u672C\u5316\u548C\u4E50 \u89C2\u9501\u5B9A\u65B9\u6CD5\u6765\u89E3\u51B3\u3002
p13-1-3-3 = \u8FD9\u79CD\u65B9\u5F0F\u628A\u5173\u4E8E\u5E76\u53D1\u7684\u5934\u75BC\u95EE\u9898\u7559\u7ED9\u4E86Hibernate\u548C\u6570\u636E\u5E93\uFF1B \u7531\u4E8E\u5728\u5355\u4E2A\u7EBF\u7A0B\u5185\uFF0C\u64CD\u4F5C\u5355\u5143\u4E2D\u7684\u5BF9\u8C61\u8BC6\u522B\u4E0D \u9700\u8981\u4EE3\u4EF7\u6602\u8D35\u7684\u9501\u5B9A\u6216\u5176\u4ED6\u610F\u4E49\u4E0A\u7684\u540C\u6B65\uFF0C\u56E0\u6B64\u5B83\u540C\u65F6\u53EF\u4EE5\u63D0\u4F9B\u6700\u597D\u7684\u53EF\u4F38\u7F29\u6027\u3002\u53EA\u8981\u5728\u5355\u4E2A\u7EBF\u7A0B\u53EA\u6301\u6709\u4E00\u4E2A Session\uFF0C\u5E94\u7528\u7A0B\u5E8F\u5C31\u4E0D\u9700\u8981\u540C\u6B65\u4EFB\u4F55\u4E1A\u52A1\u5BF9\u8C61\u3002\u5728Session \u7684\u8303\u56F4\u5185\uFF0C\u5E94\u7528\u7A0B\u5E8F\u53EF\u4EE5\u653E\u5FC3\u7684\u4F7F\u7528==\u8FDB\u884C\u5BF9\u8C61\u6BD4\u8F83\u3002
p13-1-3-4 = \u4E0D\u8FC7\uFF0C\u5E94\u7528\u7A0B\u5E8F\u5728Session\u7684\u5916\u9762\u4F7F\u7528==\u8FDB\u884C\u5BF9\u8C61\u6BD4\u8F83\u53EF\u80FD\u4F1A\u5BFC\u81F4\u65E0\u6CD5\u9884\u671F\u7684\u7ED3\u679C\u3002\u5728\u4E00\u4E9B\u65E0\u6CD5\u9884\u6599\u7684\u573A\u5408, \u4F8B\u5982\uFF0C\u5982\u679C\u4F60\u628A\u4E24\u4E2A\u8131\u7BA1\u5BF9\u8C61\u5B9E\u4F8B\u653E\u8FDB\u540C\u4E00\u4E2A Set\u7684\u65F6\u5019,\u5C31\u53EF\u80FD\u53D1\u751F,\u8FD9\u4E24\u4E2A\u5BF9\u8C61\u5B9E\u4F8B\u53EF\u80FD\u6709\u540C\u4E00\u4E2A\u6570\u636E\u5E93\u6807\u8BC6 (\u4E5F\u5C31\u662F\u8BF4\uFF0C\u4ED6\u4EEC\u4EE3\u8868\u4E86\u8868\u7684\u540C\u4E00\u884C\u6570\u636E)\u3002\u4ECEJVM\u6807\u8BC6\u7684\u5B9A\u4E49\u4E0A\u6765\u8BF4, \u5BF9\u8131\u7BA1\u7684\u5BF9\u8C61\u800C\u8A00\uFF0CHibernate\u65E0\u6CD5\u4FDD\u8BC1\u4ED6\u4EEC \u7684\u7684JVM\u6807\u8BC6\u4E00\u81F4\u3002\u5F00\u53D1\u4EBA\u5458\u5FC5\u987B\u8986\u76D6\u6301\u4E45\u5316\u7C7B\u7684equals()\u65B9\u6CD5\u548C hashCode()\u65B9\u6CD5\uFF0C\u4ECE\u800C\u5B9E\u73B0\u81EA\u5B9A\u4E49\u7684\u5BF9\u8C61\u76F8\u7B49\u8BED\u4E49\u3002\u8B66\u544A\uFF1A\u4E0D\u8981\u4F7F\u7528\u6570\u636E\u5E93\u6807\u8BC6 \u6765\u5B9E\u73B0\u5BF9\u8C61\u76F8\u7B49\uFF0C\u5E94\u8BE5\u4F7F\u7528\u4E1A\u52A1\u952E\u503C\uFF0C\u7531\u552F\u4E00\u7684\uFF0C\u901A\u5E38\u4E0D\u53D8\u7684\u5C5E\u6027\u7EC4\u6210\u3002\u5F53\u4E00\u4E2A\u77AC\u65F6\u5BF9\u8C61\u88AB\u6301\u4E45\u5316\u7684\u65F6\u5019\uFF0C\u5B83\u7684\u6570\u636E\u5E93\u6807\u8BC6\u4F1A\u53D1\u751F\u6539\u53D8\u3002\u5982\u679C\u4E00\u4E2A\u77AC\u65F6\u5BF9\u8C61(\u901A\u5E38\u4E5F\u5305\u62EC\u8131\u7BA1\u5BF9\u8C61\u5B9E\u4F8B) \u88AB\u653E\u5165\u4E00 \u4E2ASet, \u6539\u53D8\u5B83\u7684hashcode\u4F1A\u5BFC\u81F4\u4E0E\u8FD9\u4E2ASet\u7684\u5173\u7CFB\u4E2D\u65AD\u3002\u867D\u7136\u4E1A\u52A1\u952E\u503C\u7684\u5C5E\u6027\u4E0D\u8C61\u6570\u636E\u5E93\u4E3B\u952E\u90A3\u6837\u7A33\u5B9A\u4E0D\u53D8\uFF0C\u4F46\u662F\u4F60\u53EA\u9700\u8981\u4FDD\u8BC1\u5728\u540C\u4E00\u4E2ASet \u4E2D\u7684\u5BF9\u8C61\u5C5E\u6027\u7684\u7A33\u5B9A\u6027\u5C31\u8DB3\u591F\u4E86\u3002\u8BF7\u5230Hibernate\u7F51\u7AD9\u53BB\u5BFB\u6C42\u8FD9\u4E2A\u95EE\u9898\u66F4\u591A\u7684\u8BE6\u7EC6\u7684\u8BA8\u8BBA\u3002\u8BF7\u6CE8\u610F\uFF0C\u8FD9\u4E0D\u662FHibernate\u7684\u95EE\u9898\uFF0C\u800C\u4EC5\u4EC5\u662F\u4E00\u4E2A\u5173\u4E8EJava\u5BF9\u8C61\u6807\u8BC6\u548C\u5224\u7B49\u884C\u4E3A\u5982\u4F55\u5B9E\u73B0\u7684\u95EE\u9898\u3002

#		**********************************************************************************************************
#		13.1.4. Common issues
#		**********************************************************************************************************

title13-1-4 = 13.1.4. \u5E38\u89C1\u95EE\u9898
p13-1-4-1 = \u51B3\u4E0D\u8981\u4F7F\u7528\u53CD\u6A21\u5F0F<code>session-per-user-session</code> \u6216\u8005 <code>session-per-application</code> (\u5F53\u7136\uFF0C\u8FD9\u4E2A\u89C4\u5B9A\u51E0\u4E4E\u6CA1\u6709\u4F8B\u5916)\u3002\u8BF7\u6CE8\u610F\uFF0C \u4E0B\u8FF0\u4E00\u4E9B\u95EE\u9898\u53EF\u80FD\u4E5F\u4F1A\u51FA\u73B0\u5728\u6211\u4EEC\u63A8\u8350\u7684\u6A21\u5F0F\u4E2D\uFF0C\u5728\u4F60\u4F5C\u51FA\u67D0\u4E2A\u8BBE\u8BA1\u51B3\u5B9A\u4E4B\u524D\uFF0C\u8BF7\u52A1\u5FC5\u7406\u89E3\u8BE5\u6A21\u5F0F\u7684\u5E94\u7528\u524D\u63D0\uFF1A
li13-1-4-1-1 = <code>Session</code> \u5BF9\u8C61\u662F\u975E\u7EBF\u7A0B\u5B89\u5168\u7684\u3002\u5982\u679C\u4E00\u4E2ASession \u5B9E\u4F8B\u5141\u8BB8\u5171\u4EAB\u7684\u8BDD\uFF0C\u90A3\u4E9B\u652F\u6301\u5E76\u53D1\u8FD0\u884C\u7684\u4E1C\u4E1C\uFF0C\u4F8B\u5982HTTP request\uFF0Csession beans,\u6216\u8005\u662F Swing workers\uFF0C\u5C06\u4F1A\u5BFC\u81F4\u51FA\u73B0\u8D44\u6E90\u4E89\u7528\u3002\u5982\u679C\u5728<code>HttpSession</code>\u4E2D\u6709 Hibernate \u7684Session\u7684\u8BDD (\u7A0D\u540E\u8BA8\u8BBA), \u4F60\u5E94\u8BE5\u8003\u8651\u540C\u6B65\u8BBF\u95EE\u4F60\u7684Http session\u3002\u5426\u5219\uFF0C\u53EA\u8981\u7528\u6237\u8DB3\u591F\u5FEB\u7684\u70B9\u51FB\u6D4F\u89C8\u5668\u7684\u201C\u5237\u65B0\u201D\uFF0C\u5C31\u4F1A\u5BFC\u81F4\u4E24\u4E2A\u5E76\u53D1\u8FD0\u884C\u7EBF\u7A0B\u4F7F\u7528\u540C\u4E00\u4E2A Session\u3002
li13-1-4-1-2 = \u4E00\u4E2A\u7531Hibernate\u629B\u51FA\u7684\u5F02\u5E38\u610F\u5473\u7740\u4F60\u5FC5\u987B\u7ACB\u5373\u56DE\u6EDA\u6570\u636E\u5E93\u4E8B\u52A1\uFF0C\u5E76\u7ACB\u5373\u5173\u95EDSession(\u7A0D\u540E\u4F1A\u5C55\u5F00\u8BA8\u8BBA)\u3002\u5982\u679C\u4F60\u7684Session\u7ED1\u5B9A\u5230\u4E00\u4E2A\u5E94\u7528\u7A0B\u5E8F\u4E0A\uFF0C\u4F60\u5FC5 \u987B\u505C\u6B62\u8BE5\u5E94\u7528\u7A0B\u5E8F\u3002\u56DE\u6EDA\u6570\u636E\u5E93\u4E8B\u52A1\u5E76\u4E0D\u4F1A\u628A\u4F60\u7684\u4E1A\u52A1\u5BF9\u8C61\u9000\u56DE\u5230\u4E8B\u52A1\u542F\u52A8\u65F6\u5019\u7684\u72B6\u6001\u3002\u8FD9\u610F\u5473\u7740\u6570\u636E\u5E93\u72B6\u6001\u548C\u4E1A\u52A1\u5BF9\u8C61\u72B6\u6001\u4E0D\u540C\u6B65\u3002\u901A\u5E38\u60C5\u51B5\u4E0B\uFF0C\u8FD9\u4E0D\u662F\u4EC0\u4E48\u95EE\u9898\uFF0C\u56E0\u4E3A\u5F02\u5E38\u662F\u4E0D\u53EF\u6062\u590D\u7684,\u4F60\u5FC5\u987B\u5728\u56DE\u6EDA\u4E4B\u540E\u91CD\u65B0\u5F00\u59CB\u6267\u884C\u3002
li13-1-4-1-3 = <code>Session</code> \u7F13\u5B58\u4E86\u5904\u4E8E\u6301\u4E45\u5316\u72B6\u6001\u7684\u6BCF\u4E2A\u5BF9\u8C61(Hibernate\u4F1A\u76D1\u89C6\u548C\u68C0\u67E5\u810F\u6570\u636E)\u3002 \u8FD9\u610F\u5473\u7740\uFF0C\u5982\u679C\u4F60\u8BA9Session\u6253\u5F00\u5F88\u957F\u4E00\u6BB5\u65F6\u95F4\uFF0C\u6216\u662F\u4EC5\u4EC5\u8F7D\u5165\u4E86\u8FC7\u591A\u7684\u6570\u636E\uFF0CSession\u5360\u7528\u7684\u5185\u5B58\u4F1A\u4E00\u76F4\u589E\u957F\uFF0C Session\u5360\u7528\u7684\u5185\u5B58\u4F1A\u4E00\u76F4\u589E\u957F\uFF0C\u8FD9\u4E2A\u95EE\u9898\u7684\u4E00\u4E2A\u89E3\u51B3\u65B9\u6CD5\u662F\u8C03\u7528clear() \u548Cevict()\u6765\u7BA1\u7406 Session\u7684\u7F13\u5B58\uFF0C\u4F46\u662F\u5982\u679C\u4F60\u9700\u8981\u5927\u6279\u91CF\u6570\u636E\u64CD\u4F5C\u7684\u8BDD\uFF0C\u6700\u597D\u8003\u8651 \u4F7F\u7528\u5B58\u50A8\u8FC7\u7A0B\u3002\u5728\u7B2C 15\u7AE0 \u6279\u5904\u7406 \u4E2D\u6709\u63D0\u5230\u4E00\u4E9B\u89E3\u51B3\u65B9\u6848\u3002 \u5728\u7528\u6237\u4F1A\u8BDD\u671F\u95F4\u4E00\u76F4\u4FDD\u6301 Session\u6253\u5F00\u4E5F\u610F\u5473\u7740\u51FA\u73B0\u810F\u6570\u636E\u7684\u53EF\u80FD\u6027\u5F88\u9AD8\u3002

#		**********************************************************************************************************
#		13.2. Database transaction demarcation
#		**********************************************************************************************************

title13-2 = 13.2. \u6570\u636E\u5E93\u4E8B\u52A1\u754C\u5B9A
p13-2-1 = \u6570\u636E\u5E93\uFF0C\u6216\u8005\u7CFB\u7EDF\uFF0C\u4E8B\u52A1\u7684\u58F0\u660E\u603B\u662F\u5FC5\u987B\u7684\u3002\u6CA1\u6709\u6570\u636E\u5E93\u4E8B\u52A1\uFF0C\u5C31\u65E0\u6CD5\u548C\u6570\u636E\u5E93\u4EA4\u4E92\uFF08\u8FD9\u5BF9\u4F7F\u7528\u81EA\u52A8\u63D0\u4EA4\u7684\u7528\u6237\u53EF\u80FD\u4F1A\u4EA7\u751F\u56F0\u6270\uFF09\u3002\u6C38\u8FDC\u4F7F\u7528\u6E05\u6670\u7684\u4E8B\u52A1\u58F0\u660E\uFF0C\u751A\u81F3\u5BF9\u53EA\u8BFB\u7684\u64CD\u4F5C\u4E5F\u662F\u4E00\u6837\u3002\u8FDB\u884C\u663E\u793A\u7684\u4E8B\u52A1\u58F0\u660E\u4E0D\u662F\u5FC5\u8981\u7684\uFF0C\u8FD9\u53D6\u51B3\u4E8E\u4F60\u5BF9\u4E8B\u52A1\u9694\u79BB\u7684\u7B49\u7EA7\u4EE5\u53CA\u6570\u636E\u5E93\u7684\u80FD\u529B\uFF0C\u4F46\u662F\u58F0\u660E\u4E8B\u52A1\u603B\u4E0D\u662F\u4EC0\u4E48\u574F\u4E8B\u3002\u5F53\u7136\uFF0C\u4E00\u4E2A\u5355\u72EC\u7684\u6570\u636E\u5E93\u4E8B\u52A1\u8981\u6BD4\u8BB8\u591A\u5C0F\u7684\u4E8B\u52A1\u8868\u73B0\u8981\u597D\uFF0C\u5373\u4F7F\u662F\u8BFB\u6570\u636E\u4E5F\u662F\u4E00\u6837\u3002
p13-2-2 = \u4E00\u4E2AHibernate\u5E94\u7528\u7A0B\u5E8F\u53EF\u4EE5\u5728\u975E\u6258\u7BA1\u73AF\u5883\u4E2D\u8FD0\u884C\uFF08\u6BD4\u5982\uFF0C\u72EC\u7ACB\u7684\uFF0C\u7B80\u5355\u7684web\u7A0B\u5E8F\u6216\u684C\u9762\u5E94\u7528\u7A0B\u5E8F\uFF09\uFF0C\u4E5F\u53EF\u4EE5\u8FD0\u884C\u5728\u6258\u7BA1\u7684J2EE\u73AF\u5883\u4E2D\u3002\u5728\u975E\u6258\u7BA1\u7684\u73AF\u5883\u4E2D\uFF0CHibernate\u901A\u5E38\u81EA\u5DF1\u8D1F\u8D23\u6570\u636E\u5E93\u8FDE\u63A5\u6C60\u3002\u5E94\u7528\u5F00\u53D1\u8005\u5FC5\u987B\u81EA\u5DF1\u58F0\u660E\u4E8B\u52A1\u58F0\u660E\uFF08\u5F00\u59CB\uFF0C\u63D0\u4EA4\u6216\u8005\u56DE\u6EDA\u6570\u636E\u5E93\u4E8B\u52A1\uFF09\u3002\u5728\u6258\u7BA1\u73AF\u5883\u4E2D\u901A\u5E38\u63D0\u4F9B\u4E86\u5BB9\u5668\u7BA1\u7406\u4E8B\u52A1\uFF08CMT\uFF09\uFF0C\u4F8B\u5982\u4E8B\u52A1\u88C5\u914D\u901A\u8FC7\u53EF\u58F0 \u660E\u7684\u65B9\u5F0F\u5B9A\u4E49\u5728EJB session beans\u7684\u90E8\u7F72\u63CF\u8FF0\u7B26\u4E2D\u3002\u53EF\u7F16\u7A0B\u5F0F\u4E8B\u52A1\u58F0\u660E\u4E0D\u518D\u9700\u8981\uFF0C\u5373\u4F7F\u662F Session \u7684\u540C\u6B65\u4E5F\u53EF\u4EE5\u81EA\u52A8\u5B8C\u6210\u3002
p13-2-3 = \u8BA9\u6301\u4E45\u5C42\u5177\u5907\u53EF\u79FB\u690D\u6027\u662F\u4EBA\u4EEC\u7684\u7406\u60F3,\u8FD9\u79CD\u79FB\u690D\u53D1\u751F\u5728\u975E\u6258\u7BA1\u7684\u672C\u5730\u8D44\u6E90\u73AF\u5883\uFF0C\u4E0E\u4F9D\u8D56JTA\u4F46\u662F\u4F7F\u7528BMT\u800C\u975ECMT\u7684\u7CFB\u7EDF\u4E4B\u95F4\u3002\u5728\u8FD9\u4E24\u79CD\u60C5\u51B5\u4E0B\u4F60\u90FD\u53EF\u4EE5\u4F7F\u7528\u7F16\u7A0B\u5F0F\u7684\u4E8B\u52A1\u7BA1\u7406\u3002Hibernate\u63D0\u4F9B\u4E86\u4E00\u5957\u79F0\u4E3A<code>Transaction</code>\u7684\u5C01\u88C5API\uFF0C\u7528\u6765\u628A\u4F60\u7684\u90E8\u7F72\u73AF\u5883\u4E2D\u7684\u672C\u5730\u4E8B\u52A1\u7BA1\u7406\u7CFB\u7EDF\u8F6C\u6362\u5230Hibernate\u4E8B\u52A1\u4E0A\u3002\u8FD9\u4E2AAPI\u662F\u53EF\u9009\u7684\uFF0C\u4F46\u662F\u6211\u4EEC\u5F3A\u70C8\u63A8\u8350\u4F7F\u7528\u9664\u975E\u4F60\u4F7F\u7528CMT session\u5BF9\u8C61\u3002
p13-2-4 = \u901A\u5E38\u60C5\u51B5\u4E0B\uFF0C\u7ED3\u675F Session \u5305\u542B\u4E86\u56DB\u4E2A\u4E0D\u540C\u7684\u9636\u6BB5:
li13-2-1-1 = \u66F4\u65B0session
li13-2-1-2 = \u63D0\u4EA4\u4E8B\u52A1
li13-2-1-3 = \u5173\u95EDsession
li13-2-1-4 = \u5904\u7406\u5F02\u5E38
p13-2-5 = \u6211\u4EEC\u4E4B\u524D\u5DF2\u7ECF\u8BA8\u8BBA\u8FC7\u4E86\u5237\u65B0session\uFF0C\u6240\u4EE5\u6211\u4EEC\u73B0\u5728\u5C06\u8BE6\u7EC6\u8BA8\u8BBA\u5728\u6258\u7BA1\u548C\u975E\u6258\u7BA1\u73AF\u5883\u4E0B\u7684\u4E8B\u52A1\u58F0\u660E\u548C\u5F02\u5E38\u5904\u7406\u3002

#		**********************************************************************************************************
#		13.2.1. Non-managed environment
#		**********************************************************************************************************

title13-2-1 = 13.2.1. \u975E\u7BA1\u7406\u73AF\u5883
p13-2-1-1 = \u5982\u679CHibernate\u6301\u4E45\u5C42\u8FD0\u884C\u5728\u975E\u6258\u7BA1\u73AF\u5883\u4E0B\uFF0C\u6570\u636E\u5E93\u8FDE\u63A5\u901A\u5E38\u7531\u7B80\u5355\u7684\u8FDE\u63A5\u6C60\uFF08\u6BD4\u5982\u54E6\u975EDataSource\uFF09\u7BA1\u7406\uFF0Csession/transaction\u5904\u7406\u65B9\u5F0F\u5982\u4E0B\u6240\u793A\uFF1A
p13-2-1-2 = \u4F60\u4E0D\u9700\u8981\u663E\u5F0F\u7684\u8C03\u7528<code>flush()</code>\u6765\u66F4\u65B0session\uFF1A\u6839\u636E<a href="#c11-10">Section 11.10, \u201CFlushing the Session\u201D</a>\u6240\u8BF4\uFF0C\u5728\u8C03\u7528<code>commit()</code>\u65B9\u6CD5\u7684\u540C\u65F6\u4F1A\u81EA\u52A8\u89E6\u53D1session\u7684\u540C\u6B65\u4E8B\u4EF6\u3002\u8C03\u7528<code>close()</code>\u65B9\u6CD5\u6807\u8BB0\u8FD9\u4E00\u4E2Asession\u7684\u7ED3\u675F\u3002<code>close()</code>\u65B9\u6CD5\u7684\u4E3B\u8981\u4F5C\u7528\u662F\u91CA\u653E\u4E86JDBC\u7684\u8FDE\u63A5\u3002\u8FD9\u6BB5Java\u4EE3\u7801\u662F\u53EF\u79FB\u690D\u7684\uFF0C\u5E76\u4E14\u53EF\u4EE5\u5728\u975E\u6258\u7BA1\u73AF\u5883\u548CJTA\u73AF\u5883\u4E0B\u8FD0\u884C\u3002
p13-2-1-3 = \u5982\u540C\u4E4B\u524D\u5217\u51FA\u6765\u7684\uFF0C\u66F4\u52A0\u7075\u6D3B\u7684\u65B9\u6848\u662FHibernate\u5185\u7F6E\u7684"current session"\u4E0A\u4E0B\u6587\u7BA1\u7406\uFF1A
p13-2-1-4 = \u4F60\u53EF\u80FD\u5728\u5E94\u7528\u7684\u5E38\u89C4\u4EE3\u7801\u4E2D\u627E\u4E0D\u5230\u8FD9\u6837\u7684\u4EE3\u7801\u7247\u6BB5\uFF1B\u81F4\u547D\u7684\uFF08\u7CFB\u7EDF\uFF09\u5F02\u5E38\u603B\u662F\u5E94\u8BE5\u5728\u6700\u9876\u7EA7\u88AB\u6355\u6349\u3002\u6362\u53E5\u8BDD\u8BF4\uFF0C\u6267\u884CHibernate\u8C03\u7528\u7684\u4EE3\u7801\u5E94\u8BE5\u5728\u6301\u4E45\u5C42\uFF0C\u800C\u5904\u7406\u8FD0\u884C\u65F6\u5F02\u5E38\uFF08\u901A\u5E38\u53EA\u80FD\u6E05\u7406\u6216\u8005\u9000\u51FA\u5E94\u7528\u7A0B\u5E8F\uFF09\u5E94\u8BE5\u5728\u4E0D\u540C\u7684\u5C42\u3002Hibernate\u63D0\u4F9B\u7684\u5F53\u524D\u4E0A\u4E0B\u6587\u7BA1\u7406\uFF0C\u5373<code>SessionFactory</code>\uFF0C\u53EF\u4EE5\u6781\u5927\u7684\u7B80\u5316\u8FD9\u4E00\u8BBE\u8BA1\u3002\u5F02\u5E38\u5904\u7406\u4F1A\u5728\u8FD9\u4E00\u7AE0\u540E\u9762\u8BA8\u8BBA\u5230\u3002
p13-2-1-5 = \u4F60\u5E94\u8BE5\u9009\u62E9<code>org.hibernate.transaction.JDBCTransactionFactory</code>\uFF0C\u8FD9\u662F\u9ED8\u8BA4\u9009\u9879\uFF0C\u5BF9\u7B2C\u4E8C\u4E2A\u4F8B\u5B50\u6765\u8BF4<code>hibernate.current_session_context_class</code>\u5E94\u8BE5\u8BBE\u7F6E\u6210thread\u3002

#		**********************************************************************************************************
#		13.2.2. Using JTA
#		**********************************************************************************************************

title13-2-2 = 13.2.2. \u4F7F\u7528JTA
p13-2-2-1 = \u5982\u679C\u4F60\u7684\u6301\u4E45\u5C42\u8FD0\u884C\u5728\u5E94\u7528\u670D\u52A1\u5668\u4E0A\uFF08\u6BD4\u5982\uFF0C\u5728EJB beans\u540E\u9762\uFF09\uFF0CHibernate\u83B7\u53D6\u7684\u6BCF\u4E2A\u6570\u636E\u6E90\u8FDE\u63A5\u5C06\u81EA\u52A8\u6210\u4E3A\u5168\u5C40JTA\u4E8B\u52A1\u7684\u4E00\u90E8\u5206\u3002\u4F60\u4E5F\u53EF\u4EE5\u5B89\u88C5\u4E00\u4E2A\u72EC\u7ACB\u7684JTA\u5B9E\u73B0\uFF0C\u4F7F\u7528\u5B83\u800C\u4E0D\u4F7F\u7528EJB\u3002Hibernate\u63D0\u4F9B\u4E86\u4E24\u79CD\u7528\u6765JTA\u6574\u5408\u7684\u7B56\u7565\u3002
p13-2-2-2 = \u5982\u679C\u4F60\u4F7F\u7528bean\u4E8B\u52A1\u7BA1\u7406(BTM)\uFF0C\u90A3\u4E48\u5F53\u4F60\u4F7F\u7528<code>Transaction</code> API\u65F6\uFF0CHibernate\u5C06\u4F1A\u544A\u77E5\u5E94\u7528\u670D\u52A1\u5668\u542F\u52A8\u6216\u5173\u95ED\u4E00\u4E2ABMT\u4E8B\u52A1\u3002\u5728\u975E\u6258\u7BA1\u73AF\u5883\u4E0B\u4E8B\u52A1\u7BA1\u7406\u7684\u4EE3\u7801\u4E5F\u662F\u4E00\u6837\u7684\u3002
p13-2-2-3 = \u5982\u679C\u4F60\u60F3\u4F7F\u7528\u4E0E\u4E8B\u52A1\u7ED1\u5B9A\u7684Session\uFF0C\u4E5F\u5C31\u662F\u4F7F\u7528<code>getCurrentSession()</code>\u65B9\u6CD5\u6765\u7B80\u5316\u4E0A\u4E0B\u6587\u7BA1\u7406\uFF0C\u90A3\u4E48\u5C31\u8981\u76F4\u63A5\u4F7F\u7528<code>JTA UserTransaction</code> API\uFF1A
p13-2-2-4 = \u5728CMT\u65B9\u5F0F\u4E0B\uFF0C\u4E8B\u52A1\u58F0\u660E\u662F\u5728session bean\u7684\u90E8\u7F72\u63CF\u8FF0\u7B26\u4E2D\uFF0C\u800C\u4E0D\u9700\u8981\u7F16\u7A0B\u3002 \u56E0\u6B64\uFF0C\u4EE3\u7801\u88AB\u7B80\u5316\u4E3A:
p13-2-2-5 = \u5728CMT/EJB\u4E2D\u751A\u81F3\u4F1A\u81EA\u52A8rollback\uFF0C\u56E0\u4E3A\u5047\u82E5\u6709\u672A\u6355\u83B7\u7684<code>RuntimeException</code>\u4ECEsession bean\u65B9\u6CD5\u4E2D\u629B\u51FA\uFF0C\u8FD9\u5C31\u4F1A\u901A\u77E5\u5BB9\u5668\u628A\u5168\u5C40\u4E8B\u52A1\u56DE\u6EDA\u3002\u8FD9\u5C31\u610F\u5473\u7740\uFF0C\u5728BMT\u6216\u8005CMT\u4E2D\uFF0C\u4F60\u6839\u672C\u5C31\u4E0D\u9700\u8981\u4F7F\u7528Hibernate Transaction API \uFF0C\u4F60\u81EA\u52A8\u5F97\u5230\u4E86\u7ED1\u5B9A\u5230\u4E8B\u52A1\u7684\u201C\u5F53\u524D\u201DSession\u3002
p13-2-2-6 = \u5728\u914D\u7F6EHibernate\u7684\u4E8B\u52A1\u5DE5\u5382\u7684\u65F6\u5019\uFF0C\u5982\u679C\u76F4\u63A5\u4F7F\u7528JTA\uFF0C\u8BF7\u9009\u62E9<code>org.hibernate.transaction.JTATransactionFactory</code>\uFF0C\u5982\u679C\u5728CMT session bean\u4E2D\uFF0C\u4F7F\u7528<code>org.hibernate.transaction.CMTTransactionFactory</code>\u3002\u4E0D\u8981\u5FD8\u8BB0\u8BBE\u7F6E<code>hibernate.transaction.manager_lookup_class</code>\u3002\u786E\u8BA4\u4F60\u6CA1\u6709\u8BBE\u7F6E<code>hibernate.current_session_context_class</code>\uFF08\u4E3A\u4E86\u5411\u4E0B\u517C\u5BB9\uFF09\uFF0C\u6216\u8005\u8BBE\u7F6E\u6210"jta"\u3002
p13-2-2-7 = \u5728JTA\u73AF\u5883\u4E0B<code>getCurrentSession()</code>\u6709\u4E00\u4E2A\u7F3A\u70B9\u3002\u5BF9after_statement\u8FDE\u63A5\u91CA\u653E\u65B9\u5F0F\u6709\u4E00\u4E2A\u8B66\u544A\uFF0C\u8FD9\u662F\u88AB\u9ED8\u8BA4\u4F7F\u7528\u7684\u3002\u7531\u4E8EJTA\u89C4\u8303\u7684\u4E00\u4E2A\u9650\u5236\uFF0CHibernate\u4E0D\u53EF\u80FD\u81EA\u52A8\u6E05\u7406\u4EFB\u4F55\u672A\u5173\u95ED\u7684ScrollableResults \u6216\u8005Iterator\uFF0C\u5B83\u4EEC\u662F\u7531<code>scroll()</code> or <code>iterate()</code> Due to a limitation of the JTA spec, it is not possible for Hibernate to automatically clean up any unclosed ScrollableResults or Iterator instances returned by <code>scroll()</code> \u6216\u8005 <code>iterate()</code>\u4EA7\u751F\u7684\u3002\u4F60\u5FC5\u987B\u901A\u8FC7\u5728finally\u5757\u4E2D\uFF0C\u663E\u5F0F\u8C03\u7528ScrollableResults.close()\u6216\u8005Hibernate.close(Iterator)\u65B9\u6CD5\u6765\u91CA\u653E\u5E95\u5C42\u6570\u636E\u5E93\u6E38\u6807\u3002\u5927\u591A\u6570\u5E94\u7528\u7A0B\u5E8F\u53EF\u4EE5\u8F7B\u6613\u7684\u5728JTA\u6216\u8005CMT\u4EE3\u7801\u4E2D\u907F\u514D\u4F7F\u7528<code>scroll()</code> \u6216\u8005 <code>iterate()</code>\u3002

#		**********************************************************************************************************
#		13.2.3. Exception handling
#		**********************************************************************************************************

title13-2-3 = 13.2.3. \u5F02\u5E38\u5904\u7406
p13-2-3-1 = \u5982\u679CSession\u629B\u51FA\u5F02\u5E38\uFF0C\u5305\u62EC\u4EFB\u4F55SQL\u5F02\u5E38\uFF0C\u4F1A\u7ACB\u5373\u56DE\u6EDA\u6570\u636E\u5E93\u4E8B\u52A1\uFF0C\u8C03\u7528<code>Session.close()</code>\u5E76\u4E22\u5F03\u8FD9\u4E2ASession\u5B9E\u4F8B\u3002Session\u7684\u4E00\u4E9B\u65B9\u6CD5\u53EF\u80FD\u4F1A\u4F7F\u5F97session\u5904\u4E8E\u4E0D\u4E00\u81F4\u7684\u72B6\u6001\u3002\u6240\u6709Hibernate\u629B\u51FA\u7684\u5F02\u5E38\u90FD\u88AB\u8BA4\u4E3A\u662F\u4E0D\u53EF\u6062\u590D\u7684\u3002\u786E\u4FDD\u5728finally\u5757\u4E2D\u8C03\u7528session\u7684<code>close()</code>\u65B9\u6CD5\u3002
p13-2-3-2 = \u53EF\u4EE5\u51FA\u73B0\u5728Hibernate\u6301\u4E45\u5C42\u7684\u5305\u542B\u4E86\u5927\u591A\u6570\u9519\u8BEF\u7684<code>HibernateException</code>\u53EF\u4EE5\u51FA\u73B0\u5728Hibernate\u6301\u4E45\u5C42\uFF0C\u662F\u4E00\u4E2A\u975E\u68C0\u67E5\u671F\u5F02\u5E38\u3002\u8FD9\u548C\u8001\u7248\u672C\u7684Hibernate\u4E0D\u540C\u3002\u5728\u6211\u4EEC\u770B\u6765\uFF0C\u6211\u4EEC\u4E0D\u5E94\u8BE5\u5F3A\u5236\u5E94\u7528\u5F00\u53D1\u8005\u5728\u5E95\u5C42\u6355\u6349\u4E00\u4E2A\u65E0\u6CD5\u6062\u590D\u7684\u5F02\u5E38\u3002\u5728\u5927\u591A\u6570\u7684\u7CFB\u7EDF\u4E2D\uFF0C\u975E\u68C0\u67E5\u671F\u5F02\u5E38\u548C\u6307\u660E\u5F02\u5E38\u90FD\u662F\u5728\u76F8\u5E94\u65B9\u6CD5\u8C03\u7528\u7684\u5806\u6808\u7684\u9876\u5C42\u88AB\u5904\u7406\u7684\uFF08\u4E5F\u5C31\u662F\u5728\u66F4\u9AD8\u7684\u5C42\uFF09\uFF0C\u5E76\u4E14\u63D0\u4F9B\u4E00\u4E2A\u9519\u8BEF\u4FE1\u606F\u7ED9\u5E94\u7528\u7A0B\u5E8F\u7528\u6237\u6216\u8005\u91C7\u53D6\u5176\u4ED6\u7684\u67D0\u4E9B\u63AA\u65BD\u3002\u6CE8\u610FHibernate\u4E5F\u53EF\u80FD\u629B\u51FA\u5176\u4ED6\u4E0D\u662F<code>HibernateException</code>\u7684\u975E\u68C0\u67E5\u671F\u5F02\u5E38\u3002\u8FD9\u4E9B\u5F02\u5E38\u540C\u6837\u662F\u4E0D\u53EF\u6062\u590D\u7684\uFF0C\u5E94\u8BE5\u91C7\u53D6\u67D0\u4E9B\u63AA\u65BD\u53BB\u5904\u7406\u4ED6\u4EEC\u3002
p13-2-3-3 = \u5728\u548C\u6570\u636E\u5E93\u8FDB\u884C\u4EA4\u4E92\u65F6\uFF0CHibernate\u628A\u6355\u83B7\u7684SQLException\u5C01\u88C5\u4E3AHibernate\u7684 JDBCException\u3002\u4E8B\u5B9E\u4E0A\uFF0CHibernate\u4F1A\u8BC6\u56FE\u5C06\u5F02\u5E38\u8F6C\u6362\u4E3A\u66F4\u52A0\u5177\u6709\u610F\u4E49\u7684JDBC\u5F02\u5E38\u7684\u5B50\u7C7B\u3002\u5E95\u5C42\u7684SQL\u5F02\u5E38\u53EF\u4EE5\u901A\u8FC7\u8C03\u7528<code>JDBCException.getCause()</code>\u6765\u83B7\u53D6\u3002Hibernate\u901A\u8FC7\u4F7F\u7528\u5173\u8054\u5230 SessionFactory\u4E0A\u7684SQLExceptionConverter\u6765 \u628ASQLException\u8F6C\u6362\u4E3A\u4E00\u4E2A\u5BF9\u5E94\u7684JDBCException \u5F02\u5E38\u7684\u5B50\u7C7B\u3002\u9ED8\u8BA4\u60C5\u51B5\u4E0B\uFF0CSQLExceptionConverter\u53EF\u4EE5\u901A\u8FC7\u914D\u7F6Edialect \u9009\u9879\u6307\u5B9A\uFF1B\u6B64\u5916\uFF0C\u4E5F\u53EF\u4EE5\u4F7F\u7528\u7528\u6237\u81EA\u5B9A\u4E49\u7684\u5B9E\u73B0\u7C7B\uFF08\u53C2\u8003javadocs SQLExceptionConverterFactory\u7C7B\u6765\u4E86\u89E3\u8BE6\u60C5\uFF09\u3002\u6807\u51C6\u7684 JDBCException\u5B50\u7C7B\u578B\u662F\uFF1A
li13-2-3-1-1 = <code>JDBCConnectionException</code>: \u6307\u660E\u5E95\u5C42\u7684JDBC\u901A\u8BAF\u51FA\u73B0\u9519\u8BEF
li13-2-3-1-2 = <code>SQLGrammarException</code>:\u6307\u660E\u53D1\u9001\u7684SQL\u8BED\u53E5\u7684\u8BED\u6CD5\u6216\u8005\u683C\u5F0F\u9519\u8BEF
li13-2-3-1-3 = <code>ConstraintViolationException</code>: \u6307\u660E\u67D0\u79CD\u7C7B\u578B\u7684\u7EA6\u675F\u8FDD\u4F8B\u9519\u8BEF
li13-2-3-1-4 = <code>LockAcquisitionException</code>: \u6307\u660E\u4E86\u5728\u6267\u884C\u8BF7\u6C42\u64CD\u4F5C\u65F6\uFF0C\u83B7\u53D6\u6240\u9700\u7684\u9501\u7EA7\u522B\u65F6\u51FA\u73B0\u7684\u9519\u8BEF\u3002
li13-2-3-1-5 = <code>GenericJDBCException</code>: \u4E0D\u5C5E\u4E8E\u4EFB\u4F55\u5176\u4ED6\u79CD\u7C7B\u7684\u539F\u751F\u5F02\u5E38

#		**********************************************************************************************************
#		13.2.4. Transaction timeout
#		**********************************************************************************************************

title13-2-4 = 13.2.4. \u4E8B\u52A1\u8D85\u65F6
p13-2-4-1 = EJB\u8FD9\u6837\u7684\u6258\u7BA1\u73AF\u5883\u6709\u4E00\u9879\u6781\u4E3A\u91CD\u8981\u7684\u7279\u6027\uFF0C\u800C\u5B83\u4ECE\u672A\u5728\u975E\u6258\u7BA1\u73AF\u5883\u4E2D\u63D0\u4F9B\u8FC7\uFF0C\u90A3\u5C31\u662F\u4E8B\u52A1\u8D85\u65F6\u3002\u5728\u51FA\u73B0\u9519\u8BEF\u7684\u4E8B\u52A1\u884C\u4E3A\u7684\u65F6\u5019\uFF0C\u8D85\u65F6\u53EF\u4EE5\u786E\u4FDD\u4E0D\u4F1A\u65E0\u9650\u6302\u8D77\u8D44\u6E90\u3001\u5BF9\u7528\u6237\u6CA1\u6709\u4EA4\u4EE3\u3002\u5728\u6258\u7BA1(JTA)\u73AF\u5883\u4E4B\u5916\uFF0CHibernate\u65E0\u6CD5\u5B8C\u5168\u63D0\u4F9B\u8FD9\u4E00\u529F\u80FD\u3002\u4F46\u662F\uFF0CHiberante\u81F3\u5C11\u53EF\u4EE5\u63A7\u5236\u6570\u636E\u8BBF\u95EE\uFF0C\u786E\u4FDD\u6570\u636E\u5E93\u7EA7\u522B\u7684\u6B7B\u9501\uFF0C\u548C\u8FD4\u56DE\u5DE8\u5927\u7ED3\u679C\u96C6\u7684\u67E5\u8BE2\u88AB\u9650\u5B9A\u5728\u4E00\u4E2A\u89C4\u5B9A\u7684\u65F6\u95F4\u5185\u3002\u5728\u6258\u7BA1\u73AF\u5883\u4E2D\uFF0CHibernate\u4F1A\u628A\u4E8B\u52A1\u8D85\u65F6\u8F6C\u4EA4\u7ED9JTA\u3002\u8FD9\u4E00\u529F\u80FD\u901A\u8FC7Hibernate <code>Transaction</code>\u5BF9\u8C61\u8FDB\u884C\u62BD\u8C61\u3002
p13-2-4-2 = <code>setTimeout()</code>\u4E0D\u5E94\u8BE5\u5728CMT bean\u4E2D\u8C03\u7528\uFF0C\u6B64\u65F6\u4E8B\u52A1\u8D85\u65F6\u503C\u5E94\u8BE5\u662F\u88AB\u58F0\u660E\u5F0F\u5B9A\u4E49\u7684\u3002

#		**********************************************************************************************************
#		13.3. Optimistic concurrency control
#		**********************************************************************************************************

title13-3 = 13.3. \u4E50\u89C2\u5E76\u53D1\u63A7\u5236
p13-3-1 = \u552F\u4E00\u80FD\u591F\u540C\u65F6\u4FDD\u6301\u9AD8\u5E76\u53D1\u548C\u9AD8\u53EF\u4F38\u7F29\u6027\u7684\u65B9\u6CD5\u5C31\u662F\u4F7F\u7528\u5E26\u7248\u672C\u5316\u7684\u4E50\u89C2\u5E76\u53D1\u63A7\u5236\u3002\u7248\u672C\u68C0\u67E5\u4F7F\u7528\u7248\u672C\u53F7\u3001 \u6216\u8005\u65F6\u95F4\u6233\u6765\u68C0\u6D4B\u66F4\u65B0\u51B2\u7A81\uFF08\u5E76\u4E14\u9632\u6B62\u66F4\u65B0\u4E22\u5931\uFF09\u3002Hibernate\u4E3A\u4F7F\u7528\u4E50\u89C2\u5E76\u53D1\u63A7\u5236\u7684\u4EE3\u7801\u63D0\u4F9B\u4E86\u4E09\u79CD\u53EF \u80FD\u7684\u65B9\u6CD5\uFF0C\u5E94\u7528\u7A0B\u5E8F\u5728\u7F16\u5199\u8FD9\u4E9B\u4EE3\u7801\u65F6\uFF0C\u53EF\u4EE5\u91C7\u7528\u5B83\u4EEC\u3002\u6211\u4EEC\u5DF2\u7ECF\u5728\u524D\u9762\u5E94\u7528\u7A0B\u5E8F\u5BF9\u8BDD\u90A3\u90E8\u5206\u5C55\u793A\u4E86 \u4E50\u89C2\u5E76\u53D1\u63A7\u5236\u7684\u5E94\u7528\u573A\u666F\uFF0C\u6B64\u5916\uFF0C\u5728\u5355\u4E2A\u6570\u636E\u5E93\u4E8B\u52A1\u8303\u56F4\u5185\uFF0C\u7248\u672C\u68C0\u67E5\u4E5F\u63D0\u4F9B\u4E86\u9632\u6B62\u66F4\u65B0\u4E22\u5931\u7684\u597D\u5904\u3002

#		**********************************************************************************************************
#		13.3.1. Application version checking
#		**********************************************************************************************************

title13-3-1 = 13.3.1. \u5E94\u7528\u7248\u672C\u68C0\u67E5
p13-3-1-1 = \u5728\u672A\u80FD\u5145\u5206\u5229\u7528Hibernate\u8F85\u52A9\u529F\u80FD\u7684\u7A0B\u5E8F\u4E2D\uFF0C\u6BCF\u4E00\u6B21\u548C\u6570\u636E\u5E93\u7684\u4EA4\u4E92\u90FD\u9700\u8981\u4E00\u4E2A\u65B0\u7684session\uFF0C\u800C\u4E14\u5F00\u53D1\u8005\u5FC5\u987B\u5728\u64CD\u4F5C\u5B9E\u4F8B\u4E4B\u524D\u5728\u6570\u636E\u5E93\u4E2D\u91CD\u65B0\u8F7D\u5165\u4ED6\u4EEC\u3002\u8FD9\u79CD\u65B9\u5F0F\u8FEB\u4F7F\u5E94\u7528\u7A0B\u5E8F\u5B9E\u73B0\u81EA\u5DF1\u7684\u7248\u672C\u63A7\u5236\u6765\u4FDD\u8BC1\u4E8B\u52A1\u4E4B\u95F4\u7684\u9694\u79BB\u3002\u8FD9\u79CD\u65B9\u5F0F\u5728\u6570\u636E\u8BBF\u95EE\u65B9\u9762\u662F\u6700\u4F4E\u6548\u7684\u3002\u8FD9\u79CD\u4F7F\u7528\u65B9\u5F0F\u548C entity EJB\u6700\u76F8\u4F3C\u3002
p13-3-1-2 = \u4F7F\u7528<code>&lt;version&gt;</code>\u6765\u6620\u5C04version\u5C5E\u6027\uFF0C\u5F53\u6570\u636E\u53D8\u66F4\u540E\u66F4\u65B0\u65F6Hibernate\u4F1A\u81EA\u52A8\u589E\u957F\u5176\u7248\u672C\u53F7\u3002
p13-3-1-3 = \u5982\u679C\u4F60\u5728\u4F4E\u6570\u636E\u5E76\u53D1\u7684\u73AF\u5883\u4E0B\u64CD\u4F5C\u6570\u636E\u5E93\uFF0C\u5E76\u4E14\u4E0D\u9700\u8981\u7248\u672C\u68C0\u67E5\uFF0C\u90A3\u4E48\u4F60\u53EF\u4EE5\u8DF3\u8FC7\u7248\u672C\u68C0\u67E5\u4F7F\u7528\u8FD9\u4E2A\u65B9\u6CD5\u3002\u5728\u8FD9\u79CD\u60C5\u51B5\u4E0B\uFF0C\u6700\u665A\u63D0\u4EA4\u751F\u6548\u5C31\u662F\u4F60\u5BF9\u957F\u4F1A\u8BDD\u7684\u9ED8\u8BA4\u5904\u7406\u7B56\u7565\u3002\u9700\u8981\u6CE8\u610F\u7684\u662F\u8FD9\u79CD\u7B56\u7565\u53EF\u80FD\u4F1A\u4F7F\u5F97\u4F7F\u7528\u5E94\u7528\u7A0B\u5E8F\u7684\u7528\u6237\u4EA7\u751F\u7591\u60D1\uFF0C\u56E0\u4E3A\u4ED6\u4EEC\u53EF\u80FD\u4F1A\u9047\u5230\u6CA1\u6709\u4EFB\u4F55\u51FA\u9519\u4FE1\u606F\u6216\u8005\u5408\u5E76\u51B2\u7A81\u7684\u4FE1\u606F\uFF0C\u81EA\u5DF1\u7684\u66F4\u65B0\u5374\u4E22\u5931\u4E86\u7684\u60C5\u51B5\u3002
p13-3-1-4 = \u624B\u52A8\u7684\u7248\u672C\u63A7\u5236\u652F\u961F\u5C0F\u89C4\u6A21\u7684\u573A\u666F\u9002\u7528\uFF0C\u5E76\u4E0D\u9002\u5408\u7EDD\u5927\u591A\u662F\u5E94\u7528\u7A0B\u5E8F\u3002\u901A\u5E38\u60C5\u51B5\u4E0B\u4E0D\u4EC5\u5355\u4E2A\u5B9E\u4F8B\u9700\u8981\u68C0\u67E5\uFF0C\u6574\u4E2A\u4FEE\u6539\u8FC7\u7684\u5173\u8054\u5173\u7CFB\u56FE\u90FD\u9700\u8981\u68C0\u67E5\u3002\u4F5C\u4E3A\u8BBE\u8BA1\u6807\u51C6\u8303\u4F8B\uFF0CHibernate\u4E3A\u6269\u5C55\u5468\u671F\u7684session\u6216\u8005\u8131\u7BA1\u5BF9\u8C61\u63D0\u4F9B\u81EA\u52A8\u7684\u7248\u672C\u68C0\u67E5\u3002

#		**********************************************************************************************************
#		13.3.2. Extended session and automatic versioning
#		**********************************************************************************************************

title13-3-2 = 13.3.2. \u5EF6\u957F\u4F1A\u8BDD\u548C\u81EA\u52A8\u7248\u672C\u63A7\u5236
p13-3-2-1 = \u5355\u4E2A\u7684<code>Session</code>\u5B9E\u4F8B\u548C\u5B83\u7684\u6301\u4E45\u5316\u5B9E\u4F53\u5728\u6574\u4E2A\u5BF9\u8BDD\u4E2D\u4F7F\u7528\uFF0C\u8FD9\u88AB\u79F0\u4E3A<code>session-per-conversation</code>\u3002Hibernate\u5728\u66F4\u65B0\u7684\u65F6\u5019\u68C0\u67E5\u5B9E\u4F8B\u7684\u7248\u672C\uFF0C\u5982\u679C\u68C0\u6D4B\u5230\u5E76\u53D1\u4FEE\u6539\u5219\u629B\u51FA\u4E00\u4E2A\u5F02\u5E38\u3002\u7531\u7528\u6237\u51B3\u5B9A\u662F\u5426\u6355\u6349\u5E76\u5904\u7406\u8FD9\u4E2A\u5F02\u5E38\u3002\u901A\u5E38\u7684\u505A\u6CD5\u662F\u4E3A\u7528\u6237\u63D0\u4F9B\u4E00\u4E2A\u9002\u5F53\u7684\u5408\u5E76\u66F4\u6539\uFF0C\u6216\u8005\u5728\u6570\u636E\u65E0\u810F\u7684\u60C5\u51B5\u4E0B\u91CD\u65B0\u5F00\u542F\u4E00\u4E2A\u4E1A\u52A1\u5BF9\u8BDD\u3002
p13-3-2-2 = \u5728\u7B49\u5F85\u7528\u6237\u4EA4\u4E92\u7684\u65F6\u5019\uFF0C<code>Session</code>\u4E0E\u4EFB\u4F55\u5E95\u5C42\u7684JDBC\u8FDE\u63A5\u662F\u65AD\u5F00\u7684\u3002\u8FD9\u4E2A\u65B9\u6CD5\u8BBF\u95EE\u6570\u636E\u5E93\u662F\u6700\u9AD8\u6548\u7684\u3002\u5E94\u7528\u7A0B\u5E8F\u4E0D\u9700\u8981\u68C0\u67E5\u7248\u672C\u6216\u8005\u91CD\u65B0\u7BA1\u7406\u8131\u79BB\u7684\u5B9E\u4F8B\uFF0C\u4E5F\u4E0D\u9700\u8981\u5728\u6BCF\u4E2A\u6570\u636E\u5E93\u4E8B\u52A1\u4E2D\u91CD\u65B0\u52A0\u8F7D\u5B9E\u4F8B\u3002
p13-3-2-3 = <code>foo</code>\u5BF9\u8C61\u77E5\u9053\u5B83\u8F7D\u5165\u7684\u662F\u54EA\u4E00\u4E2Asession\u3002\u5728\u4E00\u4E2A\u65E7\u7684session\u4E2D\u5F00\u542F\u4E00\u4E2A\u65B0\u7684\u6570\u636E\u5E93\u4E8B\u52A1\u6216\u83B7\u53D6\u4E00\u4E2A\u65B0\u8FDE\u63A5\u5E76\u4E14\u56DE\u590D\u8FD9\u4E2Asession\u7684\u529F\u80FD\u3002\u5728\u63D0\u4EA4\u4E86\u6570\u636E\u5E93\u4E8B\u52A1\u4E4B\u540E\uFF0Csession\u5C06\u548CJDBC\u8FDE\u63A5\u65AD\u5F00\uFF0C\u5E76\u5C06\u8FDE\u63A5\u5F52\u8FD8\u8FDE\u63A5\u6C60\u3002\u5728\u91CD\u65B0\u8FDE\u63A5\u4E4B\u540E\uFF0C\u8981\u5F3A\u5236\u5BF9\u4F60\u6CA1\u6709\u66F4\u65B0\u7684\u6570\u636E\u8FDB\u884C\u4E00\u6B21\u7248\u672C\u68C0\u67E5\uFF0C\u4F60\u53EF\u4EE5\u5BF9\u6240\u6709\u53EF\u80FD\u88AB\u5176\u4ED6\u4E8B\u52A1\u4FEE\u6539\u8FC7\u7684\u5BF9\u8C61\uFF0C\u4F7F\u7528\u53C2\u6570<code>LockMode.READ</code>\u6765\u8C03\u7528<code>Session.lock()</code>\u3002\u4F60\u4E0D\u9700\u8981\u9501\u5B9A\u4EFB\u4F55\u4F60\u6B63\u5728\u66F4\u65B0\u7684\u6570\u636E\u3002\u901A\u5E38\u60C5\u51B5\u4E0B\u4F60\u5E94\u8BE5\u5728\u6269\u5C55\u7684session\u4E0A\u8BBE\u7F6E<code>FlushMode.MANUAL</code>\uFF0C\u90A3\u6837\u53EA\u6709\u6700\u540E\u4E00\u4E2A\u6570\u636E\u5E93\u4E8B\u52A1\u5FAA\u73AF\u624D\u4F1A\u771F\u6B63\u7684\u5427\u6574\u4E2A\u5BF9\u8BDD\u4E2D\u53D1\u751F\u7684\u4FEE\u6539\u53D1\u9001\u5230\u6570\u636E\u5E93\u3002 \u53EA\u6709\u6700\u540E\u4E00\u6B21\u6570\u636E\u5E93\u4E8B\u52A1\u624D\u6709<code>flush()</code>\u64CD\u4F5C\uFF0C\u5E76\u4E14\u5728\u4F1A\u8BDD\u7ED3\u675F\u4E4B\u524D\u8C03\u7528<code>close()</code>\u65B9\u6CD5\u5173\u95EDsession\u3002
p13-3-2-4 = \u4F60\u5728\u601D\u8003\u7684\u65F6\u5019\uFF0C\u5982\u679C\u53D1\u73B0Session\u592A\u5927\u4E86\u65E0\u6CD5\u4FDD\u5B58\uFF0C\u90A3\u4E48\u8FD9\u4E2A\u6A21\u5F0F\u5C31\u662F\u6709\u95EE\u9898\u7684\u3002\uFF08\u4F8B\u5982\uFF0C<code>HttpSession</code>\u5E94\u8BE5\u5C3D\u53EF\u80FD\u7684\u5C0F\uFF09\u3002\u56E0\u4E3ASession\u662F\u4E00\u7EA7\u7F13\u5B58\uFF0C\u5E76\u4E14\u5305\u542B\u6240\u6709\u52A0\u8F7D\u8FDB\u6765\u7684\u5BF9\u8C61\uFF0C\u56E0\u6B64\u6211\u4EEC\u53EA\u5E94\u8BE5\u5728\u90A3\u4E9B\u5C11\u91CF\u7684request/response\u60C5\u51B5\u4E0B\u4F7F\u7528\u8FD9\u79CD\u7B56\u7565\u3002 \u4F60\u5E94\u8BE5\u53EA\u628A\u4E00\u4E2ASession\u7528\u4E8E\u5355\u4E2A\u5BF9\u8BDD\uFF0C\u56E0\u4E3A\u5B83\u5F88\u5FEB\u5C31\u4F1A\u51FA\u73B0\u810F\u6570\u636E\u3002
nc13-3-2-1 = \u65E9\u671F\u7248\u672C\u7684Hibernate\u9700\u8981\u660E\u786E\u7684\u5BF9Session\u4F7F\u7528disconnection\u548Creconnection\u3002\u8FD9\u4E9B\u65B9\u6CD5\u5DF2\u7ECF\u5F03\u7528\u4E86\uFF0C\u56E0\u4E3A\u6253\u5F00\u548C\u7ED3\u675F\u4E8B\u52A1\u6709\u540C\u6837\u7684\u6548\u679C\u3002
p13-3-2-5 = \u5728\u6301\u4E45\u5C42\u4FDD\u6301\u65AD\u5F00\u8FDE\u63A5\u7684Session\u5173\u95ED\u3002\u5728\u4E09\u5C42\u73AF\u5883\u4E2D\u4F7F\u7528EJB\u6765\u6301\u6709Session\u3002\u4E0D\u8981\u5C06\u5B83\u4F20\u9012\u7ED9web\u5C42\uFF0C\u751A\u81F3\u628A\u5B83\u5E8F\u5217\u5316\u5230\u5355\u72EC\u4E00\u5C42\uFF0C\u4FDD\u5B58\u5728<code>HttpSession</code>\u4E2D\u3002
p13-3-2-6 = \u6269\u5C55Session\u6A21\u5F0F\uFF0C\u6216\u8005\u53EB\u505A<code>session-per-conversation</code>\uFF0C\u5728\u4E0E\u81EA\u52A8\u7BA1\u7406\u5F53\u524Dsession\u4E0A\u4E0B\u6587\u8054\u7528\u7684\u65F6\u5019\u4F1A\u66F4\u56F0\u96BE\u3002\u4F60\u9700\u8981\u63D0\u4F9B\u4F60\u81EA\u5DF1\u7684CurrentSessionContext\u5B9E\u73B0\u3002\u8BF7\u53C2\u9605Hibernate Wiki\u4EE5\u83B7\u5F97\u793A\u4F8B

#		**********************************************************************************************************
#		13.3.3. Detached objects and automatic versioning
#		**********************************************************************************************************

title13-3-3 = 13.3.3. \u6E38\u79BB\u7684\u5BF9\u8C61\u548C\u81EA\u52A8\u7248\u672C\u63A7\u5236
p13-3-3-1 = \u6BCF\u4E00\u6B21\u4E0E\u6301\u4E45\u5C42\u7684\u4EA4\u4E92\u90FD\u53D1\u751F\u5728\u4E00\u4E2A\u65B0Session\u4E2D\u3002\u7136\u800C\uFF0C\u540C\u4E00\u6301\u4E45\u5316\u5B9E\u4F8B\u5728\u4E0E\u6570\u636E\u5E93\u7684\u6BCF\u6B21\u4EA4\u4E92\u4E2D\u90FD\u53EF\u4EE5\u91CD\u7528\u3002\u5E94\u7528\u7A0B\u5E8F\u64CD\u7EB5\u8131\u7BA1\u5B9E\u4F8B\u7684\u72B6\u6001\uFF0C\u8FD9\u4E2A\u5B9E\u4F8B\u6700\u521D\u662F\u5728\u53E6\u4E00\u4E2ASession\u4E2D\u8F7D\u5165\u7684\uFF0C\u7136\u540E\u8C03\u7528<code>Session.update()</code>, <code>Session.saveOrUpdate()</code>, \u6216\u8005 <code>Session.merge()</code>\u6765\u91CD\u65B0\u5173\u8054\u5BF9\u8C61\u5B9E\u4F8B\u3002
p13-3-3-2 = Hibernate\u5728\u5237\u65B0\u65F6\u4F1A\u518D\u4E00\u6B21\u68C0\u67E5\u5B9E\u4F8B\u7248\u672C\uFF0C\u5982\u679C\u66F4\u65B0\u8FC7\u7A0B\u4E2D\u6709\u51B2\u7A81\u4F1A\u629B\u51FA\u4E00\u4E2A\u5F02\u5E38\u3002
p13-3-3-3 = \u5982\u679C\u4F60\u786E\u4FE1\u5BF9\u8C61\u6CA1\u6709\u4FEE\u6539\u8FC7\uFF0C\u4F60\u53EF\u4EE5\u4F7F\u7528<code>lock()</code>\u6765\u66FF\u4EE3<code>update()</code>\u65B9\u6CD5\u6765\u8BBE\u7F6E<code>LockMode.READ</code>\uFF08\u7ED5\u8FC7\u6240\u6709\u7F13\u5B58\uFF0C\u6267\u884C\u7248\u672C\u68C0\u67E5\uFF09\u3002
#		**********************************************************************************************************
#		13.3.4. Customizing automatic versioning
#		**********************************************************************************************************

title13-3-4 = 13.3.4. \u81EA\u5B9A\u4E49\u81EA\u52A8\u7248\u672C\u63A7\u5236
p13-3-4-1 = \u4F60\u53EF\u4EE5\u901A\u8FC7\u5C06 <code>optimistic-lock</code>\u6620\u5C04\u5C5E\u6027\u8BBE\u7F6E\u4E3Afalse\uFF0C\u6765\u7981\u6B62Hibernate\u5BF9\u67D0\u4E9B\u5C5E\u6027\u548C\u96C6\u5408\u7684\u7248\u672C\u81EA\u52A8\u589E\u957F\u3002\u8FD9\u6837\uFF0C\u5F53\u5C5E\u6027\u7684\u6570\u636E\u53D8\u810F\u65F6Hibernate\u4E0D\u4F1A\u589E\u957F\u5B83\u7684\u7248\u672C\u53F7\u3002
p13-3-4-2 = \u9057\u7559\u6570\u636E\u5E93\u8868\u901A\u5E38\u662F\u9759\u6001\u7684\u4E0D\u53EF\u4FEE\u6539\u7684\u3002\u6216\u8005\uFF0C\u5176\u4ED6\u5E94\u7528\u7A0B\u5E8F\u4E5F\u53EF\u80FD\u8BBF\u95EE\u540C\u4E00\u6570\u636E\u5E93\uFF0C\u6839\u672C\u65E0\u6CD5\u5F97\u77E5\u5982\u4F55\u5904\u7406\u7248\u672C\u53F7\uFF0C\u751A\u81F3\u65F6\u95F4\u6233\u3002\u65E0\u8BBA\u54EA\u79CD\u60C5\u51B5\uFF0C\u7248\u672C\u4FE1\u606F\u4E0D\u80FD\u4F9D\u8D56\u4E0E\u8868\u4E2D\u7684\u7279\u5B9A\u5217\u3002\u5728<code>&lt;class&gt;</code>\u7684\u6620\u5C04\u4E2D\u8BBE\u7F6E <code>optimistic-lock="all"</code>\u53EF\u4EE5\u5728\u6CA1\u6709\u7248\u672C\u6216\u8005\u65F6\u95F4\u6233\u5C5E\u6027\u6620\u5C04\u7684\u60C5\u51B5\u4E0B\u5B9E\u73B0\u7248\u672C\u68C0\u67E5\uFF0C\u6B64\u65F6Hibernate\u5C06\u6BD4\u8F83\u4E00\u884C\u8BB0\u5F55\u7684\u6BCF\u4E2A\u5B57\u6BB5\u7684\u72B6\u6001\u3002\u53EA\u6709\u5728Hibernate\u80FD\u591F\u6BD4\u8F83\u65B0\u8001\u72B6\u6001\u7684\u60C5\u51B5\u4E0B\uFF0C\u8FD9\u79CD\u65B9\u5F0F\u624D\u80FD\u751F\u6548\u3002\uFF08\u6BD4\u5982\uFF0C\u4F7F\u7528\u5355\u4E2A\u957F\u751F\u547D\u5468\u671FSession\u6A21\u5F0F\uFF0C\u800C\u4E0D\u4F7F\u7528 session-per-request-with-detached-objects\u6A21\u5F0F\u3002\uFF09
p13-3-4-3 = \u5F53\u66F4\u6539\u4E0D\u53D1\u751F\u4EA4\u9519\uFF0C\u90A3\u4E48\u5E76\u884C\u4FEE\u6539\u4E5F\u662F\u5141\u8BB8\u7684\u3002\u5F53\u4F60\u5728<code>&lt;class&gt;</code>\u7684\u6620\u5C04\u4E2D\u8BBE\u7F6E<code>optimistic-lock="dirty"</code>\u4E4B\u540E\uFF0CHibernate\u5728\u66F4\u65B0\u65F6\u53EA\u4F1A\u6BD4\u8F83\u810F\u6570\u636E\u3002
p13-3-4-4 = \u65E0\u8BBA\u4EC0\u4E48\u60C5\u51B5\u4E0B\uFF0C\u4E0D\u7BA1\u662F\u7EC4\u4FFA\u4EEC\u8BBE\u7F6E\u4E00\u4E2Aversion/timestamp\u5217\uFF0C\u8FD8\u662F\u8FDB\u884C\u5168\u90E8\u5B57\u6BB5/\u810F\u5B57\u6BB5\u7684\u6BD4\u8F83\uFF0CHibernate\u90FD\u662F\u4F7F\u7528\u5E26\u6709<code>WHERE</code>\u67E5\u8BE2\u7684<code>UPDATE</code>\u72B6\u6001\u6765\u68C0\u67E5\u548C\u66F4\u65B0\u4FE1\u606F\u3002\u5982\u679C\u4F60\u4F7F\u7528\u4F20\u9012\u6301\u4E45\u5316\u6765\u7EA7\u8054\u5B9E\u4F53\u5173\u7CFB\uFF0CHibernate\u53EF\u80FD\u4F1A\u505A\u4E00\u4E9B\u4E0D\u5FC5\u8981\u7684\u66F4\u65B0\u3002\u8FD9\u901A\u5E38\u4E0D\u662F\u4EC0\u4E48\u95EE\u9898\uFF0C\u4F46\u662F\u6570\u636E\u5E93\u4E2D\u66F4\u65B0\u7684\u89E6\u53D1\u5668\u53EF\u80FD\u5728\u6CA1\u6709\u66F4\u65B0\u65F6\u4E5F\u4F1A\u88AB\u6267\u884C\u3002\u4F60\u53EF\u4EE5\u901A\u8FC7\u5728<code>&lt;class&gt;</code>\u6620\u5C04\u4E2D\u8BBE\u7F6E<code>select-before-update="true"</code>\u6765\u81EA\u5B9A\u4E49\u8FD9\u4E00\u884C\u4E3A\uFF0C\u5F3A\u5236Hibernate <code>SELECT</code>\u8FD9\u4E2A\u5BF9\u8C61\u6765\u4FDD\u8BC1\u66F4\u65B0\u8BB0\u5F55\u4E4B\u524D\uFF0C\u5BF9\u8C61\u662F\u66F4\u6539\u8FC7\u7684\u3002

#		**********************************************************************************************************
#		13.4. Pessimistic locking
#		**********************************************************************************************************

title13-4 = 13.4. \u60B2\u89C2\u9501
p13-4-1 = \u7528\u6237\u4E0D\u9700\u8981\u82B1\u592A\u591A\u65F6\u95F4\u62C5\u5FC3\u9501\u5B9A\u7B56\u7565\u95EE\u9898\u3002\u4E00\u822C\u60C5\u51B5\u4E0B\uFF0C\u4E3AJDBC\u8FDE\u63A5\u6307\u5B9A\u4E00\u4E2A\u9694\u79BB\u7B49\u7EA7\u7136\u540E\u53EA\u8981\u8BA9\u6570\u636E\u5E93\u53BB\u505A\u5269\u4E0B\u7684\u4E8B\u60C5\u5C31\u8DB3\u591F\u4E86\u3002\u7136\u800C\uFF0C\u9AD8\u7EA7\u7528\u6237\u53EF\u80FD\u6709\u65F6\u5019\u5E0C\u671B\u83B7\u5F97\u4E00\u4E2A\u6392\u5B83\u9501\uFF0C\u6216\u8005\u5728\u65B0\u4E8B\u52A1\u542F\u52A8\u65F6\u91CD\u65B0\u8FDB\u884C\u9501\u5B9A\u3002
p13-4-2 = Hibernate\u603B\u662F\u4F7F\u7528\u6570\u636E\u5E93\u7684\u9501\u5B9A\u673A\u5236\uFF0C\u4ECE\u4E0D\u5728\u5185\u5B58\u4E2D\u9501\u5B9A\u5BF9\u8C61\u3002
p13-4-3 = \u5728<code>LockMode</code>\u7C7B\u4E2D\u5B9A\u4E49\u4E86Hibernate\u9700\u8981\u7684\u9501\u5B9A\u4E0D\u540C\u7B49\u7EA7\u3002\u4E00\u4E2A\u9501\u5B9A\u53EF\u4EE5\u901A\u8FC7\u4E00\u4E0B\u673A\u5236\u6765\u8BBE\u5B9A\uFF1A
li13-4-1-1 =  \u5F53Hibernate\u66F4\u65B0\u6216\u8005\u63D2\u5165\u4E00\u884C\u65F6\u81EA\u52A8\u8BBE\u7F6E\u4E3A<code>LockMode.WRITE</code>
li13-4-1-2 = \u5F53\u7528\u6237\u5728\u6570\u636E\u5E93\u4E2D\u663E\u793A\u7684\u4F7F\u7528<code>SELECT ...FOR UPDATE</code>\u65F6\uFF0C\u9501\u5B9A\u7B49\u7EA7\u81EA\u52A8\u8BBE\u4E3A<code>LockMode.UPGRADE</code>\u3002
li13-4-1-3 = \u5F53\u7528\u6237\u663E\u5F0F\u7684\u4F7F\u7528Oracle\u6570\u636E\u5E93\u7684SQL\u8BED\u53E5<code>SELECT ... FOR UPDATE NOWAIT</code> \u7684\u65F6\u5019\uFF0C\u9501\u5B9A\u7EA7\u522B\u8BBE\u7F6E<code>LockMode.UPGRADE_NOWAIT</code>
li13-4-1-4 = \u5F53Hibernate\u5728\u201C\u53EF\u91CD\u590D\u8BFB\u201D\u6216\u8005\u662F\u201C\u5E8F\u5217\u5316\u201D\u6570\u636E\u5E93\u9694\u79BB\u7EA7\u522B\u4E0B\u8BFB\u53D6\u6570\u636E\u7684\u65F6\u5019\uFF0C\u9501\u5B9A\u6A21\u5F0F\u81EA\u52A8\u8BBE\u7F6E\u4E3A<code>LockMode.READ</code>\u3002\u8FD9\u79CD\u6A21\u5F0F\u4E5F\u53EF\u4EE5\u901A\u8FC7\u7528\u6237\u663E\u5F0F\u6307\u5B9A\u8FDB\u884C\u8BBE\u7F6E\u3002
li13-4-1-5 = <code>LockMode.NONE</code> \u4EE3\u8868\u65E0\u9700\u9501\u5B9A\u3002\u5728Transaction\u7ED3\u675F\u65F6\uFF0C \u6240\u6709\u7684\u5BF9\u8C61\u90FD\u5207\u6362\u5230\u8BE5\u6A21\u5F0F\u4E0A\u6765\u3002\u4E0Esession\u76F8\u5173\u8054\u7684\u5BF9\u8C61\u901A\u8FC7\u8C03\u7528update() \u6216\u8005saveOrUpdate()\u8131\u79BB\u8BE5\u6A21\u5F0F\u3002
p13-4-4 = "\u663E\u5F0F\u7684\u7528\u6237\u6307\u5B9A"\u53EF\u4EE5\u901A\u8FC7\u4EE5\u4E0B\u51E0\u79CD\u65B9\u5F0F\u4E4B\u4E00\u6765\u8868\u793A:
li13-4-2-1 = \u8C03\u7528<code>Session.load()</code>\u7684\u65F6\u5019\u6307\u5B9A\u9501\u5B9A\u6A21\u5F0F\uFF08<code>LockMode</code>\uFF09\u3002
li13-4-2-2 = \u8C03\u7528<code>Session.lock()</code>\u3002
li13-4-2-3 = \u8C03\u7528<code>Query.setLockMode()</code>\u3002
p13-4-5 = \u5982\u679C\u5728<code>UPGRADE</code> or <code>UPGRADE_NOWAIT</code>\u7684\u65F6\u5019\u8C03\u7528<code>Session.load()</code>\uFF0C\u5E76\u4E14\u88AB\u8BF7\u6C42\u7684\u72EC\u4EAB\u8FD8\u6CA1\u6709\u88AB\u8F7D\u5165session\uFF0C\u90A3\u4E48\u8FD9\u4E2A\u5BF9\u8C61\u4F1A\u901A\u8FC7<code>SELECT --- FOR UPDATE</code>\u7684\u65B9\u5F0F\u518D\u4ED8\u3002\u5982\u679C\u4E00\u4E2A\u5BF9\u8C61\u5728\u8C03\u7528<code>load()</code>\u65B9\u6CD5\u65F6\uFF0C\u5DF2\u7ECF\u5728\u4E00\u4E2A\u8F83\u5C11\u9650\u5236\u7684\u9501\u5B9A\u6A21\u5F0F\u4E0B\u88AB\u8F7D\u5165\u4E86\uFF0CHibernate\u4F1A\u4E3A\u90A3\u4E2A\u5BF9\u8C61\u8C03\u7528<code>lock()</code>\u65B9\u6CD5\u3002
p13-4-6 = \u5982\u679C\u6307\u5B9A\u9501\u7684\u6A21\u5F0F\u662F<code>READ</code>, <code>UPGRADE</code> \u6216\u8005 <code>UPGRADE_NOWAIT</code>\uFF0C\u90A3\u4E48<code>Session.lock()</code>\u5C31\u4F1A\u6267\u884C\u7248\u672C\u53F7\u68C0\u67E5\u3002\u5728<code>UPGRADE</code>\u6216\u8005<code>UPGRADE_NOWAIT</code>\u6A21\u5F0F\u4E0B\uFF0C\u4F1A\u4F7F\u7528<code>SELECT ... FOR UPDATE</code>\u3002
p13-4-7 = \u5982\u679C\u6570\u636E\u5E93\u4E0D\u652F\u6301\u7528\u6237\u6240\u8BF7\u6C42\u7684\u9501\u5B9A\u6A21\u5F0F\uFF0CHibernate\u4F1A\u4F7F\u7528\u9002\u5F53\u7684\u65B9\u6848\u53BB\u66FF\u4EE3\u800C\u4E0D\u662F\u629B\u51FA\u5F02\u5E38\uFF0C\u8FD9\u6837\u53EF\u4EE5\u4FDD\u8BC1\u5E94\u7528\u7A0B\u5E8F\u7684\u53EF\u79FB\u690D\u6027\u3002

#		**********************************************************************************************************
#		13.5. Connection release modes
#		**********************************************************************************************************

title13-5 = 13.5. \u94FE\u63A5\u91CA\u653E\u6A21\u5F0F
p13-5-1 = Hibernate\u7684\u5176\u4E2D\u4E00\u4E2A\u65E7\u884C\u4E3A\uFF0C\u53732.x\u7248\u672C\u7684\u65F6\u5019\uFF0C\u4E00\u4E2Asession\u5728\u7B2C\u4E00\u6B21\u9700\u8981\u7684\u65F6\u5019\u83B7\u53D6\u4E00\u4E2A\u8FDE\u63A5\uFF0C\u7136\u540E\u4E00\u76F4\u6301\u6709\u8FD9\u4E2A\u8FDE\u63A5\u77E5\u9053\u5176\u5173\u95ED\u3002\u5230\u4E86Hibernate 3.x\u7248\u672C\uFF0C\u5F15\u5165\u4E86\u8FDE\u63A5\u91CA\u653E\u6A21\u5F0F\uFF0C\u8FD9\u4E2A\u6A21\u5F0F\u5C06\u4F1A\u544A\u77E5session\u5982\u4F55\u5904\u7406\u4E00\u4E2AJDBC\u8FDE\u63A5\u3002\u63A5\u4E0B\u6765\u7684\u8BA8\u8BBA\u53EA\u9488\u5BF9\u7531<code>ConnectionProvider</code>\u63D0\u4F9B\u8FDE\u63A5\u7684\u60C5\u51B5\u3002\u7528\u6237\u81EA\u5B9A\u4E49\u7684\u8FDE\u63A5\u6211\u4EEC\u4E0D\u4F1A\u5728\u8FD9\u91CC\u8BA8\u8BBA\u5230\u3002\u901A\u8FC7<code>org.hibernate.ConnectionReleaseMode</code>\u7684\u4E0D\u540C\u679A\u4E3E\u503C\u6765\u51B3\u5B9A\u4F7F\u7528\u4E0D\u540C\u7684\u91CA\u653E\u6A21\u5F0F\uFF1A
li13-5-1-1 = <code>ON_CLOSE</code>: \u8FD9\u5C31\u662F\u4E0A\u9762\u63D0\u5230\u7684\u65E7\u884C\u4E3A\u3002Hibernate session\u5F53\u5B83\u7B2C\u4E00\u6B21\u9700\u8981\u7684\u65F6\u5019\u83B7\u5F97\u4E00\u4E2A\u8FDE\u63A5\uFF0C\u7136\u540E\u6301\u4E45\u8FD9\u4E2A\u8FDE\u63A5\u77E5\u9053session\u5173\u95ED\u3002
li13-5-1-2 = <code>AFTER_TRANSACTION</code>: \u5728<code>org.hibernate.Transaction</code>\u5B8C\u6210\u4E4B\u540E\u91CA\u653E\u8FDE\u63A5\u3002
li13-5-1-3 = <code>AFTER_STATEMENT</code> (\u4E5F\u88AB\u79F0\u4E3A\u79EF\u6781\u91CA\u653E): \u5728\u6BCF\u4E00\u6761\u8BED\u53E5\u6267\u884C\u8FC7\u540E\u91CA\u653E\u8FDE\u63A5\u3002\u4F46\u662F\u5982\u679C\u8FD9\u6761\u8BED\u53E5\u7559\u4E0B\u4E86\u4E0Esession\u76F8\u5173\u7684\u8D44\u6E90\uFF0C\u5219\u8FD9\u4E2A\u8FDE\u63A5\u4E0D\u4F1A\u88AB\u91CA\u653E\u3002\u5F53\u524D\u6765\u8BB2\u552F\u4E00\u51FA\u73B0\u8FD9\u79CD\u60C5\u51B5\u7684\u662F\u5728\u4F7F\u7528<code>org.hibernate.ScrollableResults</code>\u7684\u65F6\u5019\u3002
p13-5-2 = <code>hibernate.connection.release_mode</code>\u7684\u53C2\u6570\u662F\u7528\u6765\u6307\u5B9A\u4F7F\u7528\u54EA\u79CD\u91CA\u653E\u65B9\u5F0F\uFF0C\u53EF\u7528\u7684\u503C\u6709\uFF1A
li3-5-2-1 = <code>auto</code> (\u9ED8\u8BA4): \u8FD9\u4E00\u9009\u62E9\u4F1A\u628A\u91CA\u653E\u6A21\u5F0F\u59D4\u6D3E\u7ED9<code>org.hibernate.transaction.TransactionFactory.getDefaultReleaseMode()</code>\u65B9\u6CD5\u5904\u7406\u3002\u5BF9\u4E8E<code>JTATransactionFactory</code>\u6765\u8BF4\uFF0C\u8FD9\u4F1A\u8FD4\u56DE<code>ConnectionReleaseMode.AFTER_STATEMENT</code>\uFF1B\u5BF9\u4E8E<code>JDBCTransactionFactory</code>\u6765\u8BB2\uFF0C\u4F1A\u8FD4\u56DE<code>ConnectionReleaseMode.AFTER_TRANSACTION</code>\u3002\u5C3D\u91CF\u4E0D\u8981\u4FEE\u6539\u8FD9\u4E00\u5757\u7684\u4EE3\u7801\u56E0\u4E3A\u5982\u679C\u5904\u7F6E\u4E0D\u5F53\uFF0C\u5C31\u4F1A\u7ED9\u7528\u6237\u5E26\u6765bug\u6216\u8005\u5F02\u5E38\u884C\u4E3A\u3002
li3-5-2-2 = <code>on_close</code>: \u4F7F\u7528<code>ConnectionReleaseMode.ON_CLOSE</code>\u3002\u8FD9\u4E2A\u8BBE\u5B9A\u662F\u4E3A\u4E86\u5411\u4E0B\u517C\u5BB9\u7684\uFF0C\u4F46\u662F\u5B83\u5DF2\u7ECF\u8FC7\u65F6\u4E0D\u63A8\u8350\u4F7F\u7528\u3002
li3-5-2-3 = <code>after_transaction</code>: \u4F7F\u7528<code>ConnectionReleaseMode.AFTER_TRANSACTION</code>\u3002\u8FD9\u4E2A\u8BBE\u5B9A\u4E0D\u5E94\u8BE5\u5728JTA\u73AF\u5883\u4E0B\u4F7F\u7528\u3002\u540C\u6837\u9700\u8981\u6CE8\u610F\u7684\u662F\uFF0C\u4F7F\u7528<code>ConnectionReleaseMode.AFTER_TRANSACTION</code>\u7684\u65F6\u5019\uFF0C\u5982\u679Csession\u5904\u4E8E\u81EA\u52A8\u63D0\u4EA4\u6A21\u5F0F\uFF0C\u8FDE\u63A5\u4F1A\u50CF<code>AFTER_STATEMENT</code>\u90A3\u6837\u88AB\u91CA\u653E\u3002
li3-5-2-4 = <code>after_statement</code>: \u4F7F\u7528<code>ConnectionReleaseMode.AFTER_STATEMENT</code>\u3002\u53E6\u5916\uFF0C<code>ConnectionProvicer</code>\u4F1A\u67E5\u8BE2\u662F\u5426\u5B83\u652F\u6301\u8FD9\u4E00\u8BBE\u7F6E\uFF08<code>supportsAggressiveRelease()</code>\uFF09\u3002\u5982\u679C\u4E0D\u652F\u6301\uFF0C\u91CA\u653E\u6A21\u5F0F\u88AB\u91CD\u65B0\u8BBE\u5B9A\u4E3A<code>ConnectionReleaseMode.AFTER_TRANSACTION</code>\u3002\u53EA\u6709\u5728\u4F60\u6BCF\u6B21\u8C03\u7528<code>ConnectionProvider.getConnection()</code>\u83B7\u53D6\u5E95\u5C42JDBC\u8FDE\u63A5\u7684\u65F6\u5019\uFF0C\u90FD\u53EF\u4EE5\u786E\u4FE1\u83B7\u5F97\u540C\u4E00\u4E2A\u8FDE\u63A5\u7684\u65F6\u5019\uFF0C\u8FD9\u4E00\u8BBE\u7F6E\u624D\u662F\u5B89\u5168\u7684\uFF1B\u6216\u8005\u5728auto-commit\u73AF\u5883\u4E2D\uFF0C\u4F60\u53EF\u4EE5\u4E0D\u7BA1\u662F\u5426\u6BCF\u6B21\u90FD\u83B7\u5F97\u540C\u4E00\u4E2A\u8FDE\u63A5\u7684\u65F6\u5019\uFF0C\u8FD9\u624D\u662F\u5B89\u5168\u7684\u3002
