
#		**********************************************************************************************************
#		Chapter 20. Improving performance
#		**********************************************************************************************************

title20 = \u7B2C\u4E8C\u5341\u7AE0. \u63D0\u5347\u6027\u80FD

#		**********************************************************************************************************
#		20.1. Fetching strategies
#		**********************************************************************************************************

title20-1 = 20.1. \u6293\u53D6\u7B56\u7565
p20-1-1 = \u5F53\u5E94\u7528\u7A0B\u5E8F\u9700\u8981\u64CD\u7EB5\u5173\u8054\u7684\u65F6\u5019\uFF0CHibernate\u6240\u4F7F\u7528\u7684\u83B7\u53D6\u5173\u8054\u5BF9\u8C61\u7684\u7B56\u7565\u3002\u6293\u53D6\u7B56\u7565\u53EF\u4EE5\u5728 O/R \u6620\u5C04\u5143\u6570\u636E\u4E2D\u58F0\u660E\uFF0C\u4E5F\u53EF\u4EE5\u5728\u7279\u5B9A\u7684HQL\u6216\u8005\u6761\u4EF6\u67E5\u8BE2\u4E2D\u88AB\u91CD\u8F7D\u3002
p20-1-2 = Hibernate \u5B9A\u4E49\u4E86\u4E00\u4E0B\u7684\u6293\u53D6\u7B56\u7565:
li20-1-1-1 = <code>\u94FE\u63A5\u6293\u53D6</code>: Hibernate\u901A\u8FC7\u5728<code>SELECT</code>\u8BED\u53E5\u4E2D\u4F7F\u7528<code>OUTER JOIN</code>\u6765\u83B7\u53D6\u5BF9\u8C61\u7684\u5173\u8054\u5B9E\u4F8B\u6216\u8005\u5173\u8054\u96C6\u5408\u3002
li20-1-1-2 = <code>\u67E5\u8BE2\u6293\u53D6</code>: \u53E6\u5916\u4E00\u6761<code>SELECT</code>\u8BED\u53E5\u6293\u53D6\u5F53\u524D\u5BF9\u8C61\u7684\u5173\u8054\u5B9E\u4F53\u6216\u8005\u96C6\u5408\u3002\u9664\u975E\u4F60\u663E\u793A\u7684\u6307\u5B9A<code>lazy="false"</code>\u6765\u7981\u6B62\u5EF6\u8FDF\u6293\u53D6\uFF0C\u5426\u5219\uFF0C\u53EA\u6709\u5F53\u4F60\u771F\u6B63\u8BBF\u95EE\u5173\u8054\u5173\u7CFB\u7684\u65F6\u5019\uFF0C\u624D\u4F1A\u6267\u884C\u7B2C\u4E8C\u6761select\u8BED\u53E5\u3002
li20-1-1-3 = <code>\u5B50\u67E5\u8BE2\u6293\u53D6</code>: \u53E6\u5916\u53D1\u9001\u4E00\u6761<code>SELECT</code>\u8BED\u53E5\u6293\u53D6\u5728\u524D\u9762\u67E5\u8BE2\u6216\u8005\u6293\u53D6\u5230\u7684\u6240\u6709\u5B9E\u4F53\u5BF9\u8C61\u7684\u5173\u8054\u96C6\u5408\u3002\u9664\u975E\u4F60\u663E\u793A\u7684\u6307\u5B9A<code>lazy="false"</code>\u6765\u7981\u6B62\u5EF6\u8FDF\u6293\u53D6\uFF0C\u53EA\u6709\u5728\u4F60\u771F\u6B63\u8BBF\u95EE\u5173\u8054\u7684\u65F6\u5019\u624D\u4F1A\u6267\u884C\u7B2C\u4E8C\u6761select\u8BED\u53E5\u3002
li20-1-1-4 = <code>\u6279\u91CF\u6293\u53D6</code>: \u5BF9\u67E5\u8BE2\u6293\u53D6\u7684\u4F18\u5316\u65B9\u6848\u3002\u901A\u8FC7\u6307\u5B9A\u4E00\u4E2A\u9010\u6E10\u6216\u8005\u5916\u952E\u5217\u8868\uFF0CHibernate\u4F7F\u7528\u5355\u6761select\u8BED\u53E5\u83B7\u53D6\u4E00\u6279\u5BF9\u8C61\u6216\u8005\u5B9E\u4F8B\u3002
p20-1-3 = Hibernate \u4F1A\u533A\u5206\u4EE5\u4E0B\u5404\u79CD\u60C5\u51B5:
li20-1-2-1 = <code>\u7ACB\u5373\u6293\u53D6</code>: \u5F53\u5BBF\u4E3B\u88AB\u52A0\u8F7D\u65F6\uFF0C\u5173\u8054\u3001\u96C6\u5408\u6216\u8005\u5C5E\u6027\u88AB\u7ACB\u5373\u6293\u53D6\u3002
li20-1-2-2 = <code>\u5EF6\u8FDF\u96C6\u5408\u6293\u53D6</code>: \u5F53\u5E94\u7528\u5BF9\u96C6\u5408\u6267\u884C\u4E86\u4E00\u6B21\u64CD\u4F5C\u65F6\uFF0C\u96C6\u5408\u624D\u88AB\u6293\u53D6\u3002\u5BF9\u96C6\u5408\u800C\u8A00\u8FD9\u662F\u9ED8\u8BA4\u884C\u4E3A\u3002
li20-1-2-3 = <code>"Extra-lazy"\u96C6\u5408\u6293\u53D6</code>: \u5BF9\u96C6\u5408\u7684\u6BCF\u4E2A\u5143\u7D20\u800C\u8A00\uFF0C\u90FD\u662F\u77E5\u9053\u9700\u8981\u65F6\u91C7\u53D6\u8BBF\u95EE\u6570\u636E\u5E93\u3002\u9664\u975E\u7EDD\u5BF9\u5FC5\u8981\uFF0CHibernate \u4E0D\u4F1A\u8BD5\u56FE\u53BB\u628A\u6574\u4E2A\u5E94\u7528\u52A0\u8F7D\u5230\u5185\u5B58\u4E2D\uFF0C\u9002\u7528\u4E8E\u975E\u5E38\u5927\u7684\u96C6\u5408\u3002
li20-1-2-4 = <code>\u4EE3\u7406\u6293\u53D6</code>: \u5BF9\u8FD4\u56DE\u5355\u503C\u7684\u5173\u8054\u800C\u8A00\uFF0C\u5F53\u5176\u67D0\u4E2A\u65B9\u6CD5\u88AB\u8C03\u7528\uFF0C\u800C\u975E\u5BF9\u5176\u5173\u952E\u5B57\u8FDB\u884Cget\u64CD\u4F5C\u65F6\u624D\u6293\u53D6\u3002
li20-1-2-5 = <code>\u975E\u4EE3\u7406\u6293\u53D6</code>: \u5BF9\u4E8E\u8FD4\u56DE\u5355\u503C\u7684\u5173\u8054\u800C\u8A00\uFF0C \u5F53\u5B9E\u4F8B\u53D8\u91CF\u88AB\u8BBF\u95EE\u7684\u65F6\u5019\u8FDB\u884C\u6293\u53D6\u3002\u4E0E\u4E0A\u9762\u7684\u4EE3\u7406\u6293\u53D6\u76F8\u6BD4\uFF0C\u8FD9\u79CD\u65B9\u6CD5\u6CA1\u6709\u90A3\u4E48\u5EF6\u8FDF\u7684\u5389\u5BB3\u3002\u5C31\u7B97\u81F3\u8BBF\u95EE\u6807\u793A\u7B26\uFF0C\u4E5F\u4F1A\u5BFC\u81F4\u5173\u8054\u6293\u53D6\u3002\u4F46\u662F\u8FD9\u79CD\u65B9\u5F0F\u66F4\u52A0\u7684\u900F\u660E\uFF0C\u56E0\u4E3A\u5BF9\u4E8E\u5E94\u7528\u7A0B\u5E8F\u6765\u8BF4\uFF0C\u4E0D\u5728\u770B\u5230proxy\u3002\u8FD9\u79CD\u65B9\u6CD5\u5F90\u7488\u5728\u4FBF\u4E00\u8D77\u51CF\u8FDB\u884C\u5B57\u8282\u7801\u589E\u5F3A\u64CD\u4F5C\uFF0C\u56E0\u6B64\u5F88\u5C11\u4F7F\u7528\u3002
li20-1-2-6 = <code>\u5C5E\u6027\u5EF6\u8FDF\u52A0\u8F7D</code>: \u5BF9\u5C5E\u6027\u6216\u8005\u8FD4\u56DE\u5355\u503C\u7684\u5173\u8054\u800C\u8A00\uFF0C\u5F53\u5176\u5B9E\u4F8B\u53D8\u91CF\u88AB\u8BBF\u95EE\u7684\u65F6\u5019\u8FDB\u884C\u6293\u53D6\u3002\u8FD9\u79CD\u65B9\u6CD5\u9700\u8981\u5B57\u8282\u7801\u5F3A\u5316\uFF0C\u56E0\u6B64\u8FD9\u4E00\u65B9\u6CD5\u5F88\u5C11\u9700\u8981\u3002
p20-1-4 = \u8FD9\u91CC\u6211\u4EEC\u6709\u4E24\u4E2A\u6B63\u4EA4\u7684\u6982\u5FF5\uFF1A\u5173\u8054\u5408\u9002\u88AB\u6293\u53D6\uFF0C\u4EE5\u53CA\u5982\u4F55\u88AB\u6293\u53D6\u3002\u4E0D\u8981\u6DF7\u6DC6\u4ED6\u4EEC\u3002\u6211\u4EEC\u4F7F\u7528\u6293\u53D6\u6765\u6539\u5584\u6027\u80FD\u3002\u6211\u4EEC\u53EF\u4EE5\u4F7F\u7528\u5EF6\u8FDF\u6765\u5B9A\u4E49\u4E00\u4E9B\u7EA6\u5B9A\uFF0C\u5BF9\u67D0\u4E2A\u7279\u5B9A\u7C7B\u7684\u67D0\u4E2A\u6258\u7BA1\u7684\u5B9E\u4F8B\uFF0C\u77E5\u9053\u6709\u54EA\u4E9B\u6570\u636E\u662F\u53EF\u4EE5\u4F7F\u7528\u7684\u3002

#		**********************************************************************************************************
#		20.1.1. Working with lazy associations
#		**********************************************************************************************************

title20-1-1 = 20.1.1. \u4F7F\u7528\u5EF6\u8FDF\u52A0\u8F7D\u7684\u5173\u8054
p20-1-1-1 = \u9ED8\u8BA4\u60C5\u51B5\u4E0B, Hibernate \u5BF9\u96C6\u5408\u4F7F\u7528\u5EF6\u8FDFselect\u6293\u53D6\uFF0C \u5BF9\u8FD4\u56DE\u5355\u503C\u7684\u5173\u8054\u4F7F\u7528\u5EF6\u8FDF\u4EE3\u7406\u6293\u53D6\u3002\u5BF9\u51E0\u4E4E\u662F\u6240\u6709\u7684\u5E94\u7528\u800C\u8A00\uFF0C\u5176\u7EDD\u5927\u591A\u6570\u7684\u5173\u8054\uFF0C\u8FD9\u79CD\u7B56\u7565\u662F\u6709\u6548\u7684\u3002
p20-1-1-2 = \u5982\u679C\u4F60\u8BBE\u7F6E\u4E86 <code>hibernate.default_batch_fetch_size</code>, Hibernate\u4F1A\u5BF9\u5EF6\u8FDF\u52A0\u8F7D\u91C7\u53D6\u6279\u91CF\u6293\u53D6\u4F18\u5316\u63AA\u65BD\u3002\u8FD9\u79CD\u4F18\u5316\u4E5F\u53EF\u80FD\u4F1A\u5728\u66F4\u7EC6\u5316\u7684\u7EA7\u522B\u6253\u5F00\u3002
p20-1-1-3 = \u7136\u800C\uFF0C\u4F60\u5FC5\u987B\u4E86\u89E3\u5EF6\u8FDF\u6293\u53D6\u5E26\u6765\u7684\u4E00\u4E2A\u95EE\u9898\u3002\u5728\u4E00\u4E2A\u6253\u5F00\u7684Hibernate session\u4E0A\u4E0B\u6587\u4E4B\u5916\u8C03\u7528\u5EF6\u8FDF\u96C6\u5408\u4F1A\u5BFC\u81F4\u4E00\u6B21\u610F\u5916\u3002\u6BD4\u5982\uFF1A
p20-1-1-4 = \u56E0\u4E3A\u5728session\u5173\u95ED\u4E4B\u540E\uFF0Cpermissions\u96C6\u5408\u8FD8\u6CA1\u5B9E\u4F8B\u5316\u5B8C\u6210\uFF0C\u56E0\u6B64\u96C6\u5408\u65E0\u6CD5\u6B63\u5E38\u8F7D\u5165\u5176\u72B6\u6001\u3002\u5BF9\u4E8E\u6258\u7BA1\u5BF9\u8C61\uFF0CHibernate\u4E0D\u652F\u6301\u5EF6\u8FDF\u5B9E\u4F8B\u5316\uFF0C\u4FEE\u6539\u65B9\u6CD5\u662F\uFF0C\u5C06permissions\u8BFB\u53D6\u6570\u636E\u7684\u4EE3\u7801\u79FB\u5230\u4E8B\u52A1\u63D0\u4EA4\u4E4B\u524D\u3002
p20-1-1-5 = \u9664\u6B64\u4E4B\u5916, \u901A\u8FC7\u5173\u8054\u6620\u5C04\u6307\u5B9A <code>lazy="false"</code> \uFF0C\u6211\u4EEC\u4E5F\u53EF\u4EE5\u4F7F\u7528\u975E\u5EF6\u8FDF\u7684\u96C6\u5408\u6216\u5173\u8054\u3002\u4F46\u662F\uFF0C\u5BF9\u7EDD\u5927\u90E8\u5206\u96C6\u5408\u6765\u8BF4\u3002\u66F4\u63A8\u8350\u4F7F\u7528\u5EF6\u8FDF\u65B9\u5F0F\u6293\u53D6\u6570\u636E\u3002\u5982\u679C\u5728\u4F60\u7684\u5BF9\u8C61\u6A21\u578B\u4E2D\u5B9A\u4E49\u4E86\u592A\u591A\u7684\u975E\u5EF6\u8FDF\u5173\u8054\uFF0CHibernate\u6700\u7EC8\u51E0\u4E4E\u9700\u8981\u5728\u6BCF\u4E2A\u4E8B\u52A1\u4E2D\u8F7D\u5165\u6574\u4E2A\u6570\u636E\u5E93\u5230\u5185\u5B58\u4E2D\u3002
p20-1-1-6 = \u53E6\u4E00\u65B9\u9762\uFF0C\u5728\u4E00\u4E9B\u7279\u6B8A\u7684\u4E8B\u52A1\u4E2D\uFF0C\u6211\u4EEC\u4E5F\u7ECF\u5E38\u9700\u8981\u4F7F\u7528\u5230\u8FDE\u63A5\u6293\u53D6\uFF0C\u4EE5\u66FF\u4EE3\u67E5\u8BE2\u6293\u53D6\u3002\u4E0B\u9762\u6211\u4EEC\u5C06\u4F1A\u5F88\u5FEB\u660E\u767D\u5982\u4F55\u5177\u4F53\u7684\u6307\u5B9AHibernate\u4E2D\u7684\u6293\u53D6\u7B56\u7565\u3002\u5B50Hibernate\u4E2D\uFF0C\u5177\u4F53\u9009\u62E9\u54EA\u79CD\u6293\u53D6\u7B56\u7565\u7684\u673A\u5236\u662F\u548C\u9009\u62E9\u5355\u53EA\u5173\u8054\u6216\u8005\u96C6\u5408\u5173\u8054\u4E00\u81F4\u7684\u3002

#		**********************************************************************************************************
#		20.1.2. Tuning fetch strategies
#		**********************************************************************************************************

title20-1-2 = 20.1.2. \u8C03\u6574\u6293\u53D6\u7B56\u7565
p20-1-2-1 = \u67E5\u8BE2\u6293\u53D6 (\u9ED8\u8BA4\u7684) \u5728N+1\u67E5\u8BE2\u7684\u60C5\u51B5\u4E0B\u662F\u53CA\u5176\u8106\u5F31\u7684\uFF0C\u56E0\u6B64\u6211\u4EEC\u53EF\u80FD\u4F1A\u8981\u6C42\u5728\u6620\u5C04\u6587\u6863\u4E2D\u5B9A\u4E49\u4F7F\u7528\u8FDE\u63A5\u6293\u53D6\uFF1A
p20-1-2-2 = \u5728\u6620\u5C04\u6587\u6863\u4E2D\u5B9A\u4E49\u7684 <code>fetch</code> \u7B56\u7565\u5C06\u4F1A\u5BF9\u4EE5\u4E0B\u5217\u8868\u6761\u76EE\u4EA7\u751F\u5F71\u54CD\uFF1A
li20-1-2-1-1 = \u901A\u8FC7<code>get()</code> \u6216\u8005 <code>load()</code>\u65B9\u6CD5\u53D6\u5F97\u6570\u636E
li20-1-2-1-2 = \u53EA\u6709\u5728\u5173\u8054\u4E4B\u95F4\u8FDB\u884C\u5BFC\u822A\u65F6\uFF0C\u624D\u4F1A\u9690\u5F0F\u7684\u53D6\u5F97\u6570\u636E
li20-1-2-1-3 = \u6761\u4EF6\u67E5\u8BE2
li20-1-2-1-4 = \u4F7F\u7528\u4E86<code>subselect</code>\u6293\u53D6\u7B56\u7565\u7684HQL \u67E5\u8BE2 
p20-1-2-3 = \u4E0D\u7BA1\u4F60\u4F7F\u7528\u54EA\u79CD\u6293\u53D6\u7B56\u7565\uFF0C\u5B9A\u4E49\u4E3A\u975E\u5EF6\u8FDF\u7684\u7C7B\u56FE\u4F1A\u88AB\u4FDD\u8BC1\u4E00\u5B9A\u88C5\u8F7D\u5165\u5185\u5B58\u3002\u6CE8\u610F\u8FD9\u53EF\u80FD\u610F\u5473\u7740\u5728\u4E00\u6761HQL\u67E5\u8BE2\u540E\u7D27\u8DDF\u7740\u4E00\u7CFB\u5217\u7684\u67E5\u8BE2\u3002 
p20-1-2-4 = \u901A\u5E38\u60C5\u51B5\u4E0B,\u4E0D\u9002\u7528\u6620\u5C04\u6587\u4EF6\u5B9A\u5236\u6293\u53D6\u7B56\u7565\uFF0C\u66F4\u591A\u7684\u662F\u4FDD\u6301\u5176\u9ED8\u8BA4\u503C\uFF0C\u7136\u540E\u518D\u7279\u5B9A\u7684\u4E8B\u52A1\u4E2D\uFF0C\u4F7F\u7528HQL\u7684\u5DE6\u8FDE\u63A5\u5BF9\u5176\u8FDB\u884C\u91CD\u8F7D\u3002\u8FD9\u5C06\u901A\u77E5Hibernate\u5728\u7B2C\u4E00\u6B21\u67E5\u8BE2\u4E2D\u4F7F\u7528\u5916\u90E8\u5173\u8054\uFF0C\u76F4\u63A5\u5F97\u5230\u5176\u5173\u8054\u6570\u636E\u5E93\u3002\u5728\u6761\u4EF6\u67E5\u8BE2\u4E2D\uFF0C\u5E94\u8BE5\u4F7F\u7528 <code>setFetchMode(FetchMode.JOIN)</code>\u3002
p20-1-2-5 = \u5982\u679C\u4F60\u60F3\u6539\u53D8 <code>get()</code> \u6216\u8005 <code>load()</code>\u7684\u6293\u53D6\u7B56\u7565, \u4F60\u53EF\u4EE5\u4F7F\u7528\u6761\u4EF6\u67E5\u8BE2\u3002\u4F8B\u5982:
p20-1-2-6 = \u8FD9\u5C31\u662F\u5176\u4ED6ORM\u89E3\u51B3\u65B9\u6848\u7684\u201C\u6293\u53D6\u8BA1\u5212\u201D\u5728Hibernate\u4E2D\u7684\u7B49\u4EF7\u7269\u3002
p20-1-2-7 = \u622A\u7136\u4E0D\u540C\u7684\u4E00\u79CD\u907F\u514DN+1\u6B21\u67E5\u8BE2\u7684\u65B9\u6CD5\u662F\u4F7F\u7528\u4E8C\u7EA7\u7F13\u5B58\u3002

#		**********************************************************************************************************
#		20.1.3. Single-ended association proxies
#		**********************************************************************************************************

title20-1-3 = 20.1.3. \u5355\u7AEF\u5173\u8054\u4EE3\u7406
p20-1-3-1 = \u5728Hibernate\u4E2D\uFF0C\u5BF9\u96C6\u5408\u7684\u5EF6\u8FDF\u6293\u53D6\u91C7\u7528\u4E86\u81EA\u5DF1\u7684\u5B9E\u73B0\u65B9\u6CD5\u3002\u4F46\u662F\u5BF9\u4E8E\u5355\u7AEF\u5173\u8054\u7684\u5EF6\u8FDF\u6293\u53D6\uFF0C\u5219\u9700\u8981\u91C7\u7528\u5176\u4ED6\u4E0D\u540C\u7684\u673A\u5236\u3002\u5355\u7AEF\u5173\u8054\u7684\u76EE\u6807\u5B9E\u4F53\u5FC5\u987B\u4F7F\u7528\u4EE3\u7406\uFF0CHibernate\u5728\u8FD0\u884C\u671F\u4E8C\u8FDB\u5236\u7EA7\uFF0C\u4E3A\u6301\u4E45\u5BF9\u8C61\u5B9E\u73B0\u4E86\u5EF6\u8FDF\u8F7D\u5165\u4EE3\u7406\u3002
p20-1-3-2 = \u9ED8\u8BA4\u7684Hibernate\u5C06\u4F1A\u4E3A\u6240\u6709\u7684\u6301\u4E45\u5316\u5BF9\u8C61\u5728\u542F\u52A8\u9636\u6BB5\u4EA7\u751F\u4EE3\u7406, \u7136\u540E\u4F7F\u4ED6\u4EEC\u5B9E\u73B0 <code>many-to-one</code> \u548C <code>one-to-one</code> \u5173\u8054\u7684\u5EF6\u8FDF\u6293\u53D6\u3002
p20-1-3-3 = \u5728\u6620\u5C04\u6587\u4EF6\u4E2D\uFF0C\u53EF\u4EE5\u901A\u8FC7\u8BBE\u7F6Eproxy\u5C5E\u6027\u4E3A\u76EE\u6807class\u58F0\u660E\u4E00\u4E2A\u63A5\u53E3\u5171\u4EE3\u7406\u63A5\u53E3\u4F7F\u7528\u3002\u9ED8\u8BA4\u7684\uFF0CHibernate\u5C06\u4F1A\u4F7F\u7528\u8BE5\u7C7B\u7684\u4E00\u4E2A\u5B50\u7C7B\u3002 \u88AB\u4EE3\u7406\u7684\u7C7B\u5FC5\u987B\u5B9E\u73B0\u4E00\u4E2A\u81F3\u5C11\u5305\u53EF\u89C1\u7684\u9ED8\u8BA4\u6784\u9020\u53C2\u6570\uFF0C\u5EFA\u8BAE\u6240\u6709\u7684\u6301\u4E45\u5316\u7C7B\u90FD\u5E94\u8BE5\u62E5\u6709\u8FD9\u6837\u7684\u6784\u9020\u51FD\u6570\u3002
p20-1-3-4 = \u5F53\u65F6\u4F7F\u7528\u8FD9\u79CD\u65B9\u5F0F\u5B9A\u4E49\u4E00\u4E2A\u591A\u6001\u7C7B\u7684\u65F6\u5019\uFF0C\u6709\u8BB8\u591A\u503C\u5F97\u6CE8\u610F\u7684\u5E38\u89C1\u6027\u95EE\u9898\uFF0C\u4F8B\u5982\uFF1A
p20-1-3-5 = \u9996\u5148, Cat \u5B9E\u4F8B\u6C38\u8FDC\u4E0D\u53EF\u4EE5\u88AB\u5F3A\u5236\u8F6C\u6362\u4E3ADomesticCat, \u5373\u4F7F\u5B83\u672C\u8EAB\u5C31\u662F<code>DomesticCat</code>\u5B9E\u4F8B:
p20-1-3-6 = \u5176\u6B21, \u4EE3\u7406" =="\u53EF\u80FD\u4E0D\u5728\u6210\u7ACB:
p20-1-3-7 = \u7136\u800C, \u5B9E\u9645\u60C5\u51B5\u5E76\u6CA1\u6709\u770B\u4E0A\u53BB\u90A3\u4E48\u7CDF\u7CD5\u3002\u867D\u7136\u6211\u4EEC\u73B0\u5728\u6709\u4E24\u4E2A\u4E0D\u540C\u7684\u5F15\u7528\u5206\u522B\u6307\u5411\u8FD9\u4E24\u4E2A\u4E0D\u540C\u7684\u4EE3\u7406\u5BF9\u8C61\uFF0C\u4F46\u5B9E\u9645\u4E0A\uFF0C\u5176\u5E95\u5C42\u5E94\u8BE5\u662F\u4E00\u4E2A\u5B9E\u4F8B\u5BF9\u8C61\uFF1A
p20-1-3-8 = \u7B2C\u4E09, \u4F60\u4E0D\u80FD\u5BF9<code>final</code>\u7C7B\u6216\u8005\u5177\u6709 <code>final</code>\u65B9\u6CD5\u7684\u7C7B\u4F7F\u7528cglib\u4EE3\u7406\u3002
p20-1-3-9 = \u6700\u540E, \u5982\u679C\u4F60\u7684\u6301\u4E45\u5316\u5BF9\u8C61\u5728\u5B9E\u4F8B\u5316\u65F6\u9700\u8981\u67D0\u4E9B\u8D44\u6E90(\u4F8B\u5982\u5728\u5B9E\u4F8B\u5316\u65B9\u6CD5\u6216\u8005\u9ED8\u8BA4\u7684\u6784\u9020\u65B9\u6CD5\u4E2D)\uFF0C\u90A3\u4E48\u4EE3\u7406\u5BF9\u8C61\u4E5F\u540C\u6837\u9700\u8981\u4F7F\u7528\u8FD9\u4E9B\u8D44\u6E90\u3002\u5B9E\u9645\u4E0A\u4EE3\u7406\u7C7B\u662F\u6301\u4E45\u5316\u7C7B\u7684\u5B50\u7C7B\u3002
p20-1-3-10 = \u8FD9\u4E9B\u95EE\u9898\u53C8\u6E90\u4E8EJava\u7684\u5355\u6839\u7EE7\u627F\u6A21\u578B\u7684\u5929\u751F\u7684\u9650\u5236\u3002\u5982\u679C\u4F60\u5E0C\u671B\u907F\u514D\u8FD9\u79CD\u95EE\u9898\u3002\u90A3\u4E48\u4F60\u7684\u6BCF\u4E00\u4E2A\u6301\u4E45\u5316\u7C7B\u5FC5\u987B\u5B9E\u73B0\u4E00\u4E2A\u501F\u53E3\uFF0C\u5728\u6B64\u63A5\u53E3\u4E2D\u5DF2\u7ECF\u58F0\u660E\u4E86\u5176\u4E1A\u52A1\u65B9\u6CD5\u3002\u7136\u540E\uFF0C\u4F60\u9700\u8981\u5728\u6620\u5C04\u6587\u6863\u4E2D\u5728\u6307\u5B9A\u8FD9\u4E9B\u501F\u53E3\uFF0C\u8FD9\u91CC<code>CatImpl</code> \u5B9E\u73B0\u4E86<code>Cat</code>\u63A5\u53E3\u5E76\u4E14 <code>DomesticCatImpl</code> \u5B9E\u73B0\u4E86<code>DomesticCat</code>\u63A5\u53E3\u3002\u4F8B\u5982:
p20-1-3-11 = \u5728<code>load()</code> \u6216\u8005 <code>iterate()</code>\u65B9\u6CD5\u4E2D\u5C31\u4F1A\u8FD4\u56DE Cat \u548C DomesticCat \u7684\u4EE3\u7406\u5BF9\u8C61\u3002
nc20-1-3-1 = <code>list()</code> \u901A\u5E38\u4E0D\u8FD4\u56DE\u4EE3\u7406\u3002
p20-1-3-12 = \u5BF9\u8C61\u4E4B\u95F4\u7684\u5173\u8054\u4E5F\u662F\u88AB\u5EF6\u8FDF\u8F7D\u5165\u7684\u3002\u8FD9\u610F\u5473\u7740\u4F60\u5E94\u8BE5\u5C06\u5C5E\u6027\u58F0\u660E\u4E3A<code>Cat</code>\u800C\u4E0D\u662F <code>CatImpl</code>\u3002
p20-1-3-13 = \u67D0\u4E9B\u65B9\u6CD5\u4E2D\u662F\u4E0D\u9700\u8981\u4F7F\u7528\u4EE3\u7406\u7684\uFF1A
li20-1-3-1-1 = <code>equals()</code>: \u5982\u679C\u6301\u4E45\u5316\u7C7B\u6CA1\u6709\u91CD\u8F7D<code>equals()</code>\u65B9\u6CD5
li20-1-3-1-2 = <code>hashCode()</code>: \u5982\u679C\u6301\u4E45\u5316\u7C7B\u6CA1\u6709\u91CD\u8F7D<code>hashCode()</code>\u65B9\u6CD5
li20-1-3-1-3 = \u6807\u793A\u7B26\u7684getter\u65B9\u6CD5
p20-1-3-14 = Hibernate \u5C06\u4F1A\u8BC6\u522B\u51FA\u90A3\u4E9B\u91CD\u8F7D\u4E86<code>equals()</code> \u6216\u8005 <code>hashCode()</code>\u65B9\u6CD5\u7684\u6301\u4E45\u5316\u7C7B
p20-1-3-15 = \u5982\u679C\u9009\u62E9 <code>lazy="no-proxy"</code> \u800C\u975E\u9ED8\u8BA4\u7684<code>lazy="proxy"</code>, \u6211\u4EEC\u53EF\u4EE5\u907F\u514D\u7C7B\u578B\u8F6C\u6362\u5E26\u6765\u7684\u95EE\u9898\u3002\u7136\u800C\uFF0C\u8FD9\u6837\u6211\u4EEC\u5C31\u9700\u8981\u7F16\u8BD1\u5668\u5B57\u8282\u7801\u589E\u5F3A\uFF0C\u5E76\u4E14\u6240\u6709\u7684\u64CD\u4F5C\u90FD\u4F1A\u5BFC\u81F4\u7ACB\u523B\u8FDB\u884C\u4EE3\u7406\u521D\u59CB\u5316\u3002
#		**********************************************************************************************************
#		20.1.4. Initializing collections and proxies
#		**********************************************************************************************************

title20-1-4 = 20.1.4. \u5B9E\u4F8B\u5316\u96C6\u5408\u548C\u4EE3\u7406
p20-1-4-1 = \u5728Session\u8303\u56F4\u4E4B\u5916\u8BBF\u95EE\u672A\u521D\u59CB\u5316\u7684\u96C6\u5408\u6216\u4EE3\u7406\uFF0CHibernate\u5C06\u4F1A\u629B\u51FAA <code>LazyInitializationException</code> \u5F02\u5E38, \u4E5F\u5C31\u662F\u8BF4\uFF0C\u5728\u5206\u79BB\u72B6\u6001\u4E0B\uFF0C\u8BBF\u95EE\u4E00\u4E2A\u5B9E\u4F53\u6240\u62E5\u6709\u7684\u96C6\u5408\uFF0C\u6216\u8005\u8BBF\u95EE\u5176\u6307\u5411\u4EE3\u7406\u7684\u5C5E\u6027\u65F6\uFF0C\u90FD\u4F1A\u5F15\u53D1\u6B64\u5F02\u5E38\u3002
p20-1-4-2 = \u6709\u65F6\u5019\u6211\u4EEC\u9700\u8981\u4FDD\u8BC1\u67D0\u4E2A\u4EE3\u7406\u6216\u8005\u96C6\u5408\u5728Session\u5173\u95ED\u4E4Bhttp://dict.cn/\u524D\u5C31\u5DF2\u7ECF\u88AB\u521D\u59CB\u5316\u3002\u5F53\u7136\uFF0C\u4E5F\u53EF\u4EE5\u901A\u8FC7\u5F3A\u884C\u8C03\u7528<code>cat.getSex()</code> \u6216 <code>cat.getKittens().size()</code>\u65B9\u6CD5\u6765\u786E\u4FDD\u8FD9\u4E00\u70B9\u3002\u4F46\u662F\u8FD9\u6837\u7684\u7A0B\u5E8F\u4F1A\u9020\u6210\u8BFB\u8005\u7684\u7591\u60D1\uFF0C\u4E5F\u4E0D\u7B26\u5408\u901A\u5E38\u7684\u4EE3\u7801\u89C4\u8303\u3002
p20-1-4-3 = \u9759\u6001\u65B9\u6CD5<code>Hibernate.initialize()</code> \u548C <code>Hibernate.isInitialized()</code>, \u4E3A\u4F60\u7684\u7A0B\u5E8F\u63D0\u4F9B\u4E86\u4E00\u4E2A\u4FBF\u6377\u7684\u9014\u5F84\u6765\u5EF6\u8FDF\u52A0\u8F7D\u96C6\u5408\u6216\u4EE3\u7406\u3002 \u53EA\u8981\u5B83\u7684Session\u5904\u4E8Eopen\u72B6\u6001\uFF0C<code>Hibernate.initialize(cat)</code>\u5C06\u4F1A\u4E3Acat\u5F3A\u5236\u5BF9\u4EE3\u7406\u5B9E\u4F8B\u5316\u3002 <code>Hibernate.initialize( cat.getKittens() )</code>\u5BF9kittens\u7684\u96C6\u5408\u5177\u6709\u540C\u6837\u7684\u529F\u80FD\u3002
p20-1-4-4 = \u8FD8\u6709\u53E6\u5916\u4E00\u79CD\u9009\u62E9\uFF0C\u5C31\u662F\u4FDD\u6301Session\u4E00\u76F4\u5904\u4E8Eopen\u72B6\u6001\uFF0C\u76F4\u5230\u6240\u6709\u9700\u8981\u7684\u96C6\u5408\u6216\u4EE3\u7406\u90FD\u88AB\u8F7D\u5165\u3002\u5728\u67D0\u4E9B\u5E94\u7528\u67B6\u6784\u4E2D\uFF0C\u7279\u522B\u662F\u5BF9\u4E8E\u90A3\u4E9B\u4F7F\u7528Hibernate\u8FDB\u884C\u6570\u636E\u8BBF\u95EE\u7684\u4EE3\u7801\uFF0C\u4EE5\u53CA\u90A3\u4E9B\u5728\u4E0D\u540C\u5E94\u7528\u5C42\u548C\u4E0D\u540C\u7269\u7406\u8FDB\u7A0B\u4E2D\u4F7F\u7528Hibernate\u7684\u4EE3\u7801\u5728\u96C6\u5408\u5B9E\u4F8B\u5316\u65F6\uFF0C\u5982\u4F55\u4FDD\u8BC1Session\u5904\u4E8Eopen\u72B6\u6001\u7ECF\u5E38\u4F1A\u662F\u4E00\u4E2A\u95EE\u9898\u3002\u6709\u4E24\u79CD\u65B9\u6CD5\u53EF\u4EE5\u89E3\u51B3\u6B64\u95EE\u9898\uFF1A
li20-1-4-1-1 = \u5728\u4E00\u4E2A\u57FA\u4E8EWeb\u7684\u5E94\u7528\u4E2D\uFF0C\u53EF\u4EE5\u5229\u7528servlet\u8FC7\u6EE4\u5668\uFF08filter\uFF09\uFF0C\u5728\u7528\u6237\u8BF7\u6C42\uFF08request\uFF09\u7ED3\u675F\u3001\u9875\u9762\u751F\u6210 \u7ED3\u675F\u65F6\u5173\u95EDSession\u3002 (\u5728\u663E\u793A\u5C42\u6253\u5F00Session\u6A21\u5F0F). \u5F53\u7136\uFF0C\u8FD9\u5C06\u4F9D\u8D56\u4E8E\u5E94\u7528\u6846\u67B6\u4E2D\u5F02\u5E38\u9700\u8981\u88AB\u6B63\u786E\u7684\u5904\u7406\u3002\u5728\u8FD4\u56DE\u754C\u9762\u7ED9\u7528\u6237\u4E4B\u524D\uFF0C\u4E43\u81F3\u5728\u751F\u6210\u754C\u9762\u8FC7\u7A0B\u4E2D\u53D1\u751F\u5F02\u5E38\u7684\u60C5\u51B5\u4E0B\uFF0C\u6B63\u786E\u5173\u95EDSession\u548C\u7ED3\u675F\u4E8B\u52A1\u5C06\u662F\u975E\u5E38\u91CD\u8981\u7684\uFF0C\u8BF7\u53C2\u89C1Hibernate wiki\u4E0A\u7684"Open Session in View"\u6A21\u5F0F\uFF0C\u4F60\u53EF\u4EE5\u627E\u5230\u793A\u4F8B\u3002
li20-1-4-1-2 = \u5728\u4E00\u4E2A\u62E5\u6709\u5355\u72EC\u4E1A\u52A1\u5C42\u7684\u5E94\u7528\u4E2D\uFF0C\u4E1A\u52A1\u5C42\u5FC5\u987B\u5728\u8FD4\u56DE\u4E4B\u524D\uFF0C\u4E3Aweb\u5C42\u201C\u51C6\u5907\u201D\u597D\u5176\u6240\u9700\u7684\u6570\u636E\u96C6\u5408\u3002 \u8FD9\u5C31\u610F\u5473\u7740 \u4E1A\u52A1\u5C42\u5E94\u8BE5\u8F7D\u5165\u6240\u6709\u8868\u73B0\u5C42/web\u5C42\u6240\u9700\u7684\u6570\u636E\uFF0C\u5E76\u5C06\u8FD9\u4E9B\u5DF2\u5B9E\u4F8B\u5316\u5B8C\u6BD5\u7684\u6570\u636E\u8FD4\u56DE\u3002\u901A\u5E38\uFF0C\u5E94\u7528\u7A0B\u5E8F\u5E94\u8BE5 \u4E3Aweb\u5C42\u6240\u9700\u7684\u6BCF\u4E2A\u96C6\u5408\u8C03\u7528<code>Hibernate.initialize()</code> \u65B9\u6CD5(\u8FD9\u4E2A\u8C03\u7528\u5FC5\u987B\u53D1\u751F\u54B1session\u5173\u95ED\u4E4B\u524D)\u3002\u6216\u8005\u4F7F\u7528\u5E26\u6709<code>FETCH</code>\u4ECE\u53E5\uFF0C\u6216<code>FetchMode.JOIN</code> \u7684Hibernate\u67E5\u8BE2\uFF0C\u4E8B\u5148\u53D6\u5F97\u6240\u6709\u7684\u6570\u636E\u96C6\u5408\u3002\u5982\u679C\u4F60\u5728\u5E94\u7528\u4E2D\u4F7F\u7528\u4E86Command\u6A21\u5F0F\uFF0C\u4EE3\u66FFSession Facade	 \uFF0C\u90A3\u4E48\u8FD9\u9879\u4EFB\u52A1\u5C06\u4F1A\u53D8\u5F97\u7B80\u5355\u7684\u591A\u3002
li20-1-4-1-3 = \u4F60\u4E5F\u53EF\u4EE5\u901A\u8FC7<code>merge()</code> \u6216<code>lock()</code>\u65B9\u6CD5\uFF0C\u5728\u8BBF\u95EE\u672A\u5B9E\u4F8B\u5316\u7684\u96C6\u5408\uFF08\u6216\u4EE3\u7406\uFF09\u4E4B\u524D\uFF0C \u4E3A\u5148\u524D\u8F7D\u5165\u7684\u5BF9\u8C61\u7ED1\u5B9A\u4E00\u4E2A\u65B0\u7684Session\u3002\u663E\u7136\uFF0CHibernate\u5C06\u4E0D\u4F1A\uFF0C\u4E5F\u4E0D\u5E94\u8BE5\u81EA\u52A8\u5B8C\u6210\u8FD9\u4E9B\u4EFB\u52A1\uFF0C\u56E0\u4E3A\u8FD9\u5C06\u5F15\u5165\u4E00\u4E2A\u7279\u6B8A\u7684\u4E8B\u52A1\u8BED\u4E49\u3002
p20-1-4-5 = \u6709\u65F6\u5019\uFF0C\u4F60\u5E76\u4E0D\u9700\u8981\u5B8C\u5168\u5B9E\u4F8B\u5316\u6574\u4E2A\u5927\u7684\u96C6\u5408\uFF0C\u4EC5\u9700\u8981\u4E86\u89E3\u5B83\u7684\u90E8\u5206\u4FE1\u606F\uFF08\u4F8B\u5982\u5176\u5927\u5C0F\uFF09\u3001\u6216\u8005\u96C6\u5408\u7684\u90E8\u5206\u5185\u5BB9\u3002
p20-1-4-6 = \u4F60\u53EF\u4EE5\u4F7F\u7528\u96C6\u5408\u8FC7\u6EE4\u5668\u5F97\u5230\u5176\u96C6\u5408\u7684\u5927\u5C0F\uFF0C\u800C\u4E0D\u5FC5\u5B9E\u4F8B\u5316\u6574\u4E2A\u96C6\u5408\uFF1A
p20-1-4-7 = \u8FD9\u91CC\u7684 <code>createFilter()</code> \u65B9\u6CD5\u4E5F\u53EF\u4EE5\u88AB\u7528\u6765\u6709\u6548\u7684\u6293\u53D6\u96C6\u5408\u7684\u90E8\u5206\u5185\u5BB9\uFF0C\u800C\u65E0\u9700\u5B9E\u4F8B\u5316\u6574\u4E2A\u96C6\u5408\uFF1A

#		**********************************************************************************************************
#		20.1.5. Using batch fetching
#		**********************************************************************************************************

title20-1-5 = 20.1.5. \u4F7F\u7528\u6279\u91CF\u6293\u53D6
p20-1-5-1 = Hibernate\u53EF\u4EE5\u5145\u5206\u6709\u6548\u7684\u4F7F\u7528\u6279\u91CF\u6293\u53D6\uFF0C\u4E5F\u5C31\u662F\u8BF4\uFF0C\u5982\u679C\u4EC5\u4E00\u4E2A\u8BBF\u95EE\u4EE3\u7406\uFF08\u6216\u96C6\u5408\uFF09\uFF0C\u90A3\u4E48Hibernate\u5C06\u4E0D\u8F7D\u5165\u5176\u4ED6\u672A\u5B9E\u4F8B\u5316\u7684\u4EE3\u7406\u3002 \u6279\u91CF\u6293\u53D6\u662F\u5EF6\u8FDF\u67E5\u8BE2\u6293\u53D6\u7684\u4F18\u5316\u65B9\u6848\uFF0C\u4F60\u53EF\u4EE5\u5728\u4E24\u79CD\u6279\u91CF\u6293\u53D6\u65B9\u6848\u4E4B\u95F4\u8FDB\u884C\u9009\u62E9\uFF1A\u5728\u7C7B\u7EA7\u522B\u548C\u96C6\u5408\u7EA7\u522B\u3002
p20-1-5-2 = \u7C7B/\u5B9E\u4F53\u7EA7\u522B\u7684\u6279\u91CF\u6293\u53D6\u5F88\u5BB9\u6613\u7406\u89E3\u3002\u5047\u8BBE\u4F60\u5728\u8FD0\u884C\u65F6\u5C06\u9700\u8981\u9762\u5BF9\u4E0B\u9762\u7684\u95EE\u9898\uFF1A\u5728\u8FD0\u884C\u65F6\u4F60\u5728\u4E00\u4E2ASession\u4E2D\u8F7D\u5165\u4E8625\u4E2A <code>Cat</code>\u5B9E\u4F8B\uFF0C\u6BCF\u4E2ACat\u5B9E\u4F8B\u90FD\u62E5\u6709\u4E00\u4E2A\u5F15\u7528\u6210\u5458owner\uFF0C\u5176\u6307\u5411<code>Person</code>\uFF0C\u800CPerson\u7C7B\u662F\u4EE3\u7406\uFF0C\u540C\u65F6lazy="true"\u3002\u5982\u679C\u4F60\u5FC5\u987B\u904D\u5386\u6574\u4E2Acats\u96C6\u5408\uFF0C\u5BF9\u6BCF\u4E2A\u5143\u7D20\u8C03\u7528<code>getOwner()</code>\u65B9\u6CD5\uFF0CHibernate\u5C06\u4F1A\u9ED8\u8BA4\u7684\u6267\u884C25\u6B21SELECT\u67E5\u8BE2\uFF0C\u5F97\u5230\u5176owner\u7684\u4EE3\u7406\u5BF9\u8C61\uFF0C\u8FD9\u65F6\uFF0C\u4F60\u53EF\u4EE5\u901A\u8FC7\u5728\u6620\u5C04\u6587\u4EF6\u7684 <code>Person</code>\u5C5E\u6027\uFF0C\u663E\u5F0F\u58F0\u660E<code>batch-size</code> \uFF0C\u6539\u53D8\u5176\u884C\u4E3A\uFF1A
p20-1-5-3 = \u901A\u8FC7\u6307\u5B9A <code>batch-size</code>,\u5F53\u9700\u8981\u8BBF\u95EE\u672A\u7ECF\u521D\u59CB\u5316\u7684\u4EE3\u7406\u65F6\uFF0CHibernate\u5C06\u4F1A\u7ACB\u5373\u6267\u884C\u67E5\u8BE2\uFF0C\u5982\u4E0A\uFF0C\u4F46\u662F\u533A\u522B\u5728\u4E8E\u4ED6\u5C06\u4F1A\u7ACB\u523B\u67E5\u8BE2\u66F4\u591A\u7684person's owner \u800C\u4E0D\u662F\u76F4\u63A5\u67E5\u8BE2\u4EE3\u7406\u5B9E\u4F53\u3002\u56E0\u6B64\uFF0C \u5F53\u8BBF\u95EE\u5176\u4ED6person\u7684 owner\u65F6\uFF0C\u4ED6\u53EF\u80FD\u5DF2\u7ECF\u4F7F\u7528\u6279\u91CF\u67E5\u8BE2\u901A\u8FC7\u5F88\u5C11\u7684\uFF08\u5C11\u4E8E25\uFF09\u67E5\u8BE2\u8BED\u53E5\u88AB\u521D\u59CB\u5316\u3002
p20-1-5-4 = \u8FD9\u79CD\u884C\u4E3A\u901A\u8FC7\u914D\u7F6Ebatch-size\u548C\u6279\u91CF\u6293\u53D6\u98CE\u683C\u6765\u63A7\u5236\u3002\u6279\u5904\u7406\u6293\u53D6\u98CE\u683C\u914D\u7F6E( <code>hibernate.batch_fetch_style</code> )\u4ECE4.2.0\u5F00\u59CB\u6709\u6027\u80FD\u4E0A\u7684\u63D0\u5347\uFF0C\u8FD9\u91CC\u63D0\u4F9B\u4E86\u4E09\u79CD\u4E0D\u540C\u7684\u7B56\u7565\uFF0C\u5305\u62EClegacy, padded \u548C dynamic\u3002
lip20-1-5-1-1-1 = <code>LEGACY</code>
lip20-1-5-1-1-2 = \u5728\u4F20\u7EDF\u7684\u7B97\u6CD5\u4E2D\uFF0C\u6211\u4EEC\u4FDD\u7559\u4E86\u4E00\u7EC4\u57FA\u4E8E<code>org.hibernate.internal.util.collections.ArrayHelper#getBatchSizes</code>\u7684\u9884\u5148\u5EFA\u7ACB\u7684\u4E00\u4E2A\u6279\u91CF\u5927\u5C0F\u3002\u6279\u6B21\u4F1A\u4F7F\u7528\u5DF2\u5B58\u5728\u7684\u548C\u9884\u6784\u5EFA\u7684\u6279\u91CF\u5927\u5C0F\u4E2D\u6BD4\u8F83\u5C0F\u7684\u90A3\u4E2A\u7684\u6279\u91CF\u503C\u3002
lip20-1-5-1-1-3 = \u5728\u4E0A\u9762\u7684\u4F8B\u5B50\u4E2D\uFF0C\u5B9A\u4E49\u4E86 batch-size\u4E3A 25 \uFF0C\u9884\u8BBE\u503C\u7684batch \u5927\u5C0F\u53EF\u4EE5\u662F [25, 12, 10, 9, 8, 7, .., 1]\u3002
lip20-1-5-1-1-4 = \u56E0\u4E3A\u8FD9\u91CC\u670925\u4E2A persons' owner \u9700\u8981\u88AB\u521D\u59CB\u5316\u3002\u90A3\u4E48\u5C06\u4F1A\u4F7F\u7528\u8FD925\u4E2Aowner\u7684\u6807\u793A\u7B26\uFF0C\u53EA\u6267\u884C\u4E00\u6761\u67E5\u8BE2\u8BED\u53E5\u5373\u53EF\u3002
lip20-1-5-1-1-5 = \u4F46\u662F\u53E6\u4E00\u4E2A\u4F8B\u5B50\u4E2D, \u5047\u8BBE\u53EA\u670924\u4EBA\uFF0CHibernate\u5C06\u53EA\u9700\u8981\u6267\u884C\u4E09\u6B21\u67E5\u8BE2\uFF0C\u5206\u522B\u4E3A12, 10, 2\u3002\u67E5\u8BE2\u5982\u4E0B\uFF1A
lip20-1-5-1-2-1 = <code>PADDED</code>
lip20-1-5-1-2-2 = \u8FD9\u79CD\u65B9\u5F0F\u7C7B\u4F3C\u4E8Elegacy \u7B97\u6CD5, \u4ED6\u4E5F\u662F\u7528\u57FA\u4E8E\u7684 <code>org.hibernate.internal.util.collections.ArrayHelper#getBatchSizes</code>\u9884\u5EFA\u7ACB\u7684batch\u5927\u5C0F\u3002\u533A\u522B\u662F\uFF0CHibernate\u5C06\u4F1A\u4F7F\u7528\u4E0B\u4E00\u4E2A\u6BD4\u8F83\u5927\u7684batch\u5927\u5C0F\uFF0C\u5E76\u4E14\u586B\u5145\u989D\u5916\u7684\u6807\u793A\u7B26\u5360\u4F4D\u7B26\u3002
lip20-1-5-1-2-3 = \u56E0\u6B64, \u540C\u6837\u4F7F\u7528\u4E0A\u9762\u7684\u4F8B\u5B50,\u521D\u59CB\u5316 25 \u4E2Aperson,\u67E5\u8BE2\u5C06\u4F1A\u548C\u4E0A\u9762\u4E00\u6837\uFF0C\u67E5\u8BE2\u6240\u6709\u7684owner\u5C06\u4F1A\u53EA\u6267\u884C\u4E00\u6761\u67E5\u8BE2\u8BED\u53E5\u3002
lip20-1-5-1-2-4 = \u7136\u800C, \u5C1D\u8BD5\u52A0\u8F7D24\u4E2Aowner\u53EA\u9700\u8981\u4E00\u4E2A \u6279\u91CF\u4E3A25\u7684\u67E5\u8BE2\uFF0C\u52A0\u8F7D\u7684\u6807\u793A\u7B26\u5C06\u4F1A\u88AB\u201C\u586B\u5145\u201D\uFF08\u53C8\u540D\uFF0C\u91CD\u590D\uFF09\u6765\u5F25\u8865\u5DEE\u8DDD\u3002
lip20-1-5-1-3-1 = <code>DYNAMIC</code>
lip20-1-5-1-3-2 = \u6839\u636E\u73B0\u6709Id\u7684\u5B9E\u9645\u6570\u91CF\u52A8\u6001\u7684\u751F\u6210SQL\uFF0C\u662F\u5426\u4ECD\u7136\u4F1A\u9650\u5236\u5B9E\u4F53\u4E0A\u51B3\u5B9A\u7684\u6279\u91CF\u5927\u5C0F\u3002
p20-1-5-5 = \u4F60\u4E5F\u53EF\u4EE5\u5728\u96C6\u5408\u7EA7\u522B\u5B9A\u4E49\u6279\u91CF\u6293\u53D6\u3002\u4F8B\u5982\uFF0C\u5982\u679C\u6BCF\u4E2A<code>Person</code>\u90FD\u6709\u4E00\u4E2A\u61D2\u52A0\u8F7D\u7684 <code>Cats</code>\u96C6\u5408, \u5E76\u4E14\u5DF2\u7ECF\u670910\u4E2APersion\u52A0\u8F7D\u5165Session\uFF0C\u904D\u5386\u6240\u6709\u7684Persion\u5C06\u4F1A\u6267\u884C10\u6B21Select\u8BED\u53E5\uFF0C\u5BF9\u4E8E\u6BCF\u4E00\u6B21\u8C03\u7528 <code>getCats()</code>getCats\u65B9\u6CD5\u3002\u5982\u679C\u4F60\u5728 <code>Person</code>\u7684\u6620\u5C04\u4E2D\u542F\u7528<code>cats</code>\u96C6\u5408\u7684\u6279\u91CF\u6293\u53D6\uFF0CHibernate\u53EF\u4EE5\u9884\u5148\u6293\u53D6\u6574\u4E2A\u96C6\u5408:
p20-1-5-6 = \u4F8B\u5982, \u5982\u679C\u628A <code>batch-size</code> \u8BBE\u7F6E\u4E3A3\u5E76\u4E14 \u4F7F\u7528\u4F20\u7EDF\u7684\u6279\u91CF\u98CE\u683C, Hibernate\u5C06\u4F1A\u4F7F\u7528\u56DB\u6761select\u8BED\u53E5\uFF0C\u5206\u522B\u52A0\u8F7D3, 3, 3, 1 \u6761\u96C6\u5408\u3002\u518D\u6B21\uFF0C\u5C5E\u6027\u7684\u503C\u53D6\u51B3\u4E8E\u9884\u671F\u7684\u672A\u521D\u59CB\u5316\u7684<code>Session</code>\u7684\u6570\u91CF\u3002
p20-1-5-7 = \u5982\u679C\u4F60\u7684\u6A21\u578B\u4E2D\u542B\u6709\u6811\u72B6\u7ED3\u6784\uFF0C\u96C6\u5408\u7684\u6279\u91CF\u6293\u53D6\u662F\u975E\u5E38\u6709\u7528\u7684\uFF0C\u5373\uFF0C\u5178\u578B\u7684bill-of-materials \u6A21\u5F0F\u3002\u7136\u800C\uFF0C\u5BF9\u4E8E\u4E00\u4E2A\u9700\u8981\u7ECF\u5E38\u8BFB\u53D6\u7684\u6811\u72B6\u7ED3\u6784\uFF0C\u4F7F\u7528\u5D4C\u5957\u7684set\u6216\u8005\u7269\u7406\u8DEF\u5F84\u4E5F\u8BB8\u662F\u66F4\u597D\u7684\u9009\u62E9\u3002

#		**********************************************************************************************************
#		20.1.6. Using subselect fetching
#		**********************************************************************************************************

title20-1-6 = 20.1.6. \u4F7F\u7528\u5B50\u67E5\u8BE2\u6293\u53D6
p20-1-6-1 = \u5982\u679C\u4E00\u4E2A\u5EF6\u8FDF\u96C6\u5408\u6216\u5355\u503C\u4EE3\u7406\u9700\u8981\u6293\u53D6\uFF0CHibernate\u4F1A\u4F7F\u7528\u4E00\u4E2A\u5B50\u67E5\u8BE2\u51B2\u8BAF\u8FD0\u884C\u539F\u6765\u7684\u67E5\u8BE2\uFF0C\u4E00\u6B21\u6027\u7684\u8BFB\u5165\u6240\u6709\u7684\u5B9E\u4F8B\uFF0C\u8FD9\u548C\u6279\u91CF\u6293\u53D6\u7684\u5B9E\u73B0\u65B9\u6CD5\u4E00\u6837\uFF0C\u4E0D\u4F1A\u6709\u7834\u788E\u7684\u52A0\u8F7D\u3002

#		**********************************************************************************************************
#		20.1.7. Fetch profiles
#		**********************************************************************************************************

title20-1-7 = 20.1.7. \u8BFB\u53D6\u914D\u7F6E\u6587\u4EF6
p20-1-7-1 = \u53E6\u4E00\u79CD\u5F71\u54CD\u6293\u53D6\u7B56\u7565\u52A0\u8F7D\u76F8\u5173\u8054\u7684\u5BF9\u8C61\u7684\u65B9\u5F0F\u662F\u901A\u8FC7\u8BFB\u53D6\u914D\u7F6E\u6587\u4EF6, \u4ED6\u662F\u548C<code>org.hibernate.SessionFactory</code>\u5173\u8054\u7684\u547D\u540D\u914D\u7F6E\uFF0C\u5E76\u4E14\u901A\u8FC7\u540D\u79F0\u5728<code>org.hibernate.Session</code>\u4E2D\u542F\u7528, \u9664\u975E\u660E\u786E\u7684\u7981\u6B62\uFF0C\u90A3\u4E48\u8BFB\u53D6\u914D\u7F6E\u6587\u4EF6\u5C06\u4F1A\u5F71\u54CD <code>org.hibernate.Session</code>\u3002
p20-1-7-2 = \u8FD9\u662F\u4EC0\u4E48\u610F\u601D\u5462\uFF1F\u4E0B\u9762\u6211\u4EEC\u6765\u901A\u8FC7\u5B9E\u4F8B\u6765\u89E3\u91CA\uFF0C\u5728\u8FD9\u4E2A\u793A\u4F8B\u4E2D\u5C55\u793A\u4E86\u4E0D\u540C\u7684\u6293\u53D6\u914D\u7F6E\u6587\u4EF6\u7684\u65B9\u5F0F\uFF1A
p20-1-7-3 = \u73B0\u5728\uFF0C\u901A\u5E38\u5F53\u4F60\u5F15\u7528\u4E00\u4E2A\u7279\u5B9A\u7684customer,customer\u7684\u8BA2\u5355\u5C06\u4F1A\u88AB\u61D2\u52A0\u8F7D\uFF0C\u8FD9\u610F\u5473\u7740\u6211\u4EEC\u73B0\u5728\u8FD8\u6CA1\u6709\u4ECE\u6570\u636E\u5E93\u4E2D\u52A0\u8F7D\u8BA2\u5355\u3002\u4E00\u822C\u60C5\u51B5\u4E0B\u8FD9\u662F\u597D\u4E8B\uFF0C\u73B0\u5728\u6211\u4EEC\u53EF\u4EE5\u8BF4\u5728\u67D0\u4E9B\u60C5\u51B5\u4E0B\u5728\u52A0\u8F7Dcustomer\u7684\u540C\u65F6\u52A0\u8F7D\u8BA2\u5355\u66F4\u6709\u6548\u3002\u5176\u4E2D\u4E00\u79CD\u65B9\u5F0F\u662F\u901A\u8FC7HQL\u6216\u8005\u6761\u4EF6\u67E5\u8BE2\u4F7F\u7528\u201C\u52A8\u6001\u6293\u53D6\u201D\u7B56\u7565\uFF0C\u4F46\u662F\u53E6\u4E00\u79CD\u9009\u62E9\u662F\u4F7F\u7528\u4E00\u4E2A\u6293\u53D6\u914D\u7F6E\u6587\u4EF6\u6765\u5B9E\u73B0\u3002\u4E0B\u9762\u7684\u4EE3\u7801\u5C06\u4F1A\u540C\u65F6\u52A0\u8F7Dcustomer\u548C\u4ED6\u4EEC\u7684\u8BA2\u5355\uFF1A
nc20-1-7-1 = <code>@FetchProfile</code> \u7684\u5B9A\u4E49\u662F\u5168\u5C40\u7684\uFF0C\u5E76\u4E14\u548C\u653E\u7F6E\u5728\u90A3\u4E2A\u7C7B\u6CA1\u6709\u5173\u7CFB\u3002\u4F60\u53EF\u4EE5\u628A<code>@FetchProfile</code> \u6CE8\u89E3\u653E\u5728\u4E00\u4E2A\u7C7B\u4E0A\u6216\u8005\u5305\u4E0A(package-info.java)\u3002\u53EF\u4EE5\u4F7F\u7528<code>@FetchProfiles</code>\u6765\u4E3A\u76F8\u540C\u7684\u7C7B\u6216\u8005\u5305\u5B9A\u4E49\u591A\u4E2A\u6293\u53D6\u914D\u7F6E\u6587\u4EF6\u3002
p20-1-7-4 = \u76EE\u524D\u53EA\u652F\u6301join\u98CE\u683C\u7684\u6293\u53D6\u914D\u7F6E\u6587\u4EF6\uFF0C\u4F46\u662F\u4ED6\u4EEC\u7684\u8BA1\u5212\u662F\u652F\u6301\u66F4\u591A\u7684\u98CE\u683C\u3002\u53C2\u8003  <a href="http://opensource.atlassian.com/projects/hibernate/browse/HHH-3414">HHH-3414</a> \u67E5\u770B\u8BE6\u7EC6\u4FE1\u606F\u3002

#		**********************************************************************************************************
#		20.1.8. Using lazy property fetching
#		**********************************************************************************************************

title20-1-8 = 20.1.8. \u4F7F\u7528\u5EF6\u8FDF\u5C5E\u6027\u6293\u53D6
p20-1-8-1 = Hibernate\u652F\u6301\u5355\u4E2A\u5C5E\u6027\u7684\u5EF6\u8FDF\u6293\u53D6\u3002\u8FD9\u9879\u4F18\u5316\u6280\u672F\u79F0\u4E4B\u4E3A\u7EC4\u6293\u53D6\u3002\u8BF7\u6CE8\u610F\uFF0C\u8BE5\u6280\u672F\u66F4\u591A\u7684\u5C5E\u4E8E\u5E02\u573A\u7279\u6027\uFF1B\u5728\u5B9E\u9645\u5E94\u7528\u4E2D\uFF0C\u4F18\u5316\u884C\u8BFB\u53D6\u6BD4\u4F18\u5316\u5217\u8BFB\u53D6\u66F4\u91CD\u8981\u3002\u7136\u800C\uFF0C\u4EC5\u52A0\u8F7D\u7C7B\u7684\u90E8\u5206\u5C5E\u6027\u5728\u67D0\u4E9B\u7279\u5B9A\u60C5\u51B5\u4E0B\u4F1A\u6709\u7528\uFF0C\u4F8B\u5982\uFF0C\u5728\u539F\u6709\u8868\u4E2D\u6709\u51E0\u767E\u5217\u6570\u636E\u3001\u6570\u636E\u6A21\u578B\u65E0\u6CD5\u6539\u5584\u7684\u60C5\u51B5\u4E0B\u3002
p20-1-8-2 = \u5728\u6620\u5C04\u6587\u4EF6\u4E2D\u5BF9\u7279\u5B9A\u7684\u5C5E\u6027\u8BBE\u7F6Elazy\uFF0C\u5B9A\u4E49\u8BE5\u5C5E\u6027\u4E3A\u5EF6\u8FDF\u8F7D\u5165\uFF1A
p20-1-8-3 = \u5C5E\u6027\u7684\u5EF6\u8FDF\u8F7D\u5165\u8981\u6C42\u5728\u5176\u4EE3\u7801\u6784\u5EFA\u65F6\u52A0\u5165\u4E8C\u8FDB\u5236\u6307\u793A\u6307\u4EE4\uFF0C\u5982\u679C\u4F60\u7684\u6301\u4E45\u7C7B\u4EE3\u7801\u4E2D\u6CA1\u6709\u8FD9\u4E9B\u6307\u4EE4\uFF0CHibernate\u5C06\u4F1A\u5FFD\u7565\u8FD9\u4E9B\u5C5E\u6027\u7684\u5EF6\u8FDF\u8BBE\u7F6E\uFF0C\u4ECD\u7136\u5C06\u5176\u76F4\u63A5\u8F7D\u5165\u3002
p20-1-8-4 = \u4F60\u53EF\u4EE5\u5728Ant\u7684task\u4E2D\uFF0C\u8FDB\u884C\u5982\u4E0B\u5B9A\u4E49\uFF0C\u5BF9\u6301\u4E45\u7C7B\u4EE3\u7801\u52A0\u5165\u4E8C\u8FDB\u5236\u6307\u4EE4\uFF1A
p20-1-8-5 = \u8FD8\u6709\u4E00\u79CD\u53EF\u4EE5\u4F18\u5316\u7684\u65B9\u6CD5\uFF0C\u5B83\u4F7F\u7528HQL\u6216\u6761\u4EF6\u67E5\u8BE2\u7684\u6295\u5F71\u7279\u6027\uFF0C\u53EF\u4EE5\u907F\u514D\u8BFB\u53D6\u975E\u5FC5\u8981\u7684\u5217\uFF0C\u8FD9\u4E00\u70B9\u81F3\u5C11\u5BF9\u53EA\u8BFB\u4E8B\u52A1\u662F\u975E\u5E38\u6709\u7528\u7684\u3002 \u5B83\u65E0\u9700\u5728\u4EE3\u7801\u6784\u5EFA\u65F6\u201C\u4E8C\u8FDB\u5236\u6307\u4EE4\u201D\u5904\u7406\uFF0C\u56E0\u6B64\u662F\u4E00\u4E2A\u66F4\u52A0\u503C\u5F97\u9009\u62E9\u7684\u89E3\u51B3\u65B9\u6CD5\u3002
p20-1-8-6 = \u6709\u65F6\u4F60\u9700\u8981\u5728HQL\u4E2D\u901A\u8FC7\u6293\u53D6\u6240\u6709\u5C5E\u6027\uFF0C\u5F3A\u884C\u6293\u53D6\u6240\u6709\u5185\u5BB9\u3002

#		**********************************************************************************************************
#		20.2. The Second Level Cache
#		**********************************************************************************************************

title20-2 = 20.2. \u4E8C\u7EA7\u7F13\u5B58
p20-2-1 = Hibernate\u7684<code>Session</code>\u5728\u4E8B\u52A1\u7EA7\u522B\u8FDB\u884C\u6301\u4E45\u5316\u6570\u636E\u7684\u7F13\u5B58\u64CD\u4F5C\u3002\u5F53\u7136\u4E5F\u53EF\u4EE5\u4E3A\u6BCF\u4E2A\u7C7B\u914D\u7F6E\u96C6\u7FA4\uFF0C\u6216\u8005JVM\u7EA7\u522B\uFF08SessionFactory\u7EA7\u522B\uFF09\u7684\u7F13\u5B58\u3002 \u4F60\u751A\u81F3\u5C05\u4E3A\u4E4B\u63D2\u5165\u4E00\u4E2A\u96C6\u7FA4\u7684\u7F13\u5B58\u3002\u6CE8\u610F\uFF0C\u7F13\u5B58\u6C38\u8FDC\u4E0D\u77E5\u9053\u5176\u4ED6\u5E94\u7528\u7A0B\u5E8F\u5BF9\u6301\u4E45\u5316\u4ED3\u5E93\u53EF\u8FDB\u884C\u7684\u4FEE\u6539\uFF0C\u53CA\u65F6\u53EF\u4EE5\u5C06\u7F13\u5B58\u6570\u636E\u8BBE\u7F6E\u4E3A\u5B9A\u671F\u5931\u6548\u3002 
p20-2-2 = \u901A\u8FC7\u5728<code>hibernate.cache.provider_class</code>\u4E2D\u6307\u5B9A<code>org.hibernate.cache.spi.CacheProvider</code>\u7684\u67D0\u4E2A\u5B9E\u73B0\u7C7B\u7684\u540D\u5B57\uFF0C\u4F60\u53EF\u4EE5\u9009\u62E9\u8BA9Hibernate\u4F7F\u7528\u54EA\u4E2A\u7F13\u5B58\u5B9E\u73B0\u3002Hibernate\u6253\u5305\u4E00\u4E9B\u5F00\u6E90\u7F13\u5B58\u5B9E\u73B0\uFF0C\u63D0\u4F9B\u5BF9\u4ED6\u4EEC\u7684\u5185\u7F6E\u652F\u6301\u3002\u53C2\u89C1\u8868 <a href="##cacheproviders">Table 20.1, \u201C\u7F13\u5B58\u63D0\u4F9B\u5546\u201D</a>\u3002\u4F60\u4E5F\u53EF\u4EE5\u5B9E\u73B0\u4F60\u81EA\u5DF1\u7684\u5B9E\u73B0\uFF0C\u5C06\u4ED6\u4EEC\u63D2\u5165\u5230\u7CFB\u7EDF\u4E2D\u3002\u6CE8\u610F\u57283.2\u7248\u672C\u4E4B\u524D\uFF0C\u9ED8\u8BA4\u4F7F\u7528EhCache\u4F5C\u4E3A\u7F13\u5B58\u5B9E\u73B0\u3002
p20-2-3 = <strong>Table 20.1. \u7F13\u5B58\u63D0\u4F9B\u5546</strong>
th20-2-1-1 = Cache
th20-2-1-2 = Provider class
th20-2-1-3 = Type
th20-2-1-4 = Cluster Safe
th20-2-1-5 = Query Cache Supported
td20-2-1-1 = ConcurrentHashMap (only for testing purpose, in hibernate-testing module)
td20-2-1-2 = org.hibernate.testing.cache.CachingRegionFactory
td20-2-1-3 = memory
td20-2-1-4 = 
td20-2-1-5 = yes
td20-2-1-6 = EHCache
td20-2-1-7 = org.hibernate.cache.ehcache.EhCacheRegionFactory
td20-2-1-8 = memory, disk, transactional, clustered
td20-2-1-9 = yes
td20-2-1-10 = yes
td20-2-1-11 = Infinispan
td20-2-1-12 = org.hibernate.cache.infinispan.InfinispanRegionFactory
td20-2-1-13 = clustered (ip multicast), transactional
td20-2-1-14 = yes (replication or invalidation)
td20-2-1-15 = yes (clock sync req.)

#		**********************************************************************************************************
#		20.2.1. Cache mappings
#		**********************************************************************************************************

title20-2-1 = 20.2.1. \u7F13\u5B58\u6620\u5C04
p20-2-1-1 = \u6B63\u5982\u6211\u4EEC\u5728\u524D\u9762\u7AE0\u8282\u4E2D\u6240\u505A\u7684\uFF0C\u6211\u4EEC\u5728\u7814\u7A76\u914D\u7F6E\u7F13\u5B58\u7684\u4E24\u79CD\u4E0D\u540C\u7684\u65B9\u5F0F\u3002\u4E00\u79CD\u65B9\u5F0F\u662F\u4F7F\u7528\u6CE8\u89E3\uFF0C\u53E6\u5916\u4E00\u79CD\u65B9\u5F0F\u662F\u4F7F\u7528Hibernate\u6620\u5C04\u6587\u4EF6\u3002
p20-2-1-2 = \u9ED8\u8BA4\u60C5\u51B5\u4E0B,\u5B9E\u4F53\u6728\u4E8B\u4E8C\u7EA7\u7F13\u5B58\u7684\u4E00\u90E8\u5206\uFF0C\u800C\u4E14\u6211\u4EEC\u63A8\u8350\u4F60\u575A\u6301\u8FD9\u79CD\u8BBE\u5B9A\u3002\u7136\u800C\uFF0C\u4F60\u53EF\u4EE5\u901A\u8FC7\u5728<code>persistence.xml</code>\u6587\u4EF6\u4E2D\u8BBE\u7F6E<code>shared-cache-mode</code> \u5143\u7D20\u6216\u8005\u5728 \u4F60\u7684\u914D\u7F6E\u4E2D\u4F7F\u7528<code>javax.persistence.sharedCache.mode</code>\u5C5E\u6027\u6765\u4FEE\u6539\u8FD9\u79CD\u8BBE\u5B9A\u3002\u4E0B\u9762\u7684\u503C\u662F\u53EF\u7528\u7684\uFF1A
li20-2-1-1-1 = <code>ENABLE_SELECTIVE</code> (\u9ED8\u8BA4\u7684\u5E76\u4E14\u662F\u63A8\u8350\u7684\u503C): \u9664\u975E\u660E\u786E\u7684\u6807\u8BB0\u4E3A\u53EF\u7F13\u5B58\uFF0C\u5426\u5219\u4E0D\u8FDB\u884C\u7F13\u5B58\u3002
li20-2-1-1-2 = <code>DISABLE_SELECTIVE</code>: \u9664\u975E\u660E\u786E\u7684\u6807\u8BB0\u4E3A\u4E0D\u7F13\u5B58\uFF0C\u5426\u5219\u5BF9\u5B9E\u4F53\u8FDB\u884C\u7F13\u5B58\u3002
li20-2-1-1-3 = <code>ALL</code>: \u5373\u4F7F\u6807\u6CE8\u4E3A\u4E0D\u7F13\u5B58\uFF0C\u4E5F\u8981\u7F13\u5B58\u6240\u6709\u7684\u5B9E\u4F53\u3002
li20-2-1-1-4 = <code>NONE</code>:\u5373\u4F7F\u6807\u6CE8\u4E3A\u53EF\u7F13\u5B58\uFF0C\u4E5F\u4E0D\u7F13\u5B58\u6240\u6709\u7684\u5B9E\u4F53\u3002\u8FD9\u4E2A\u9009\u9879\u53EF\u4EE5\u5B8C\u5168\u7981\u7528\u4E8C\u7EA7\u7F13\u5B58\u3002
p20-2-1-3 = \u901A\u8FC7\u8BBE\u7F6E<code>hibernate.cache.default_cache_concurrency_strategy</code> \u5C5E\u6027\u53EF\u4EE5\u6307\u5B9A\u9ED8\u8BA4\u7684\u7F13\u5B58\u7B56\u7565\u3002\u8FD9\u4E2A\u5C5E\u6027\u7684\u503C\u53EF\u4EE5\u662F:
li20-2-1-2-1 = <code>read-only</code>
li20-2-1-2-2 = <code>read-write</code>
li20-2-1-2-3 = <code>nonstrict-read-write</code>
li20-2-1-2-4 = <code>transactional</code>
nc20-2-1-1 = \u5EFA\u8BAE\u4E3A\u6BCF\u4E00\u4E2A\u5B9E\u4F53\u5B9A\u4E49\u7F13\u5B58\u5E76\u53D1\u7B56\u7565\uFF0C\u800C\u4E0D\u662F\u4F7F\u7528\u5168\u5C40\u7684\u3002\u53EF\u4EE5\u4F7F\u7528<code>@org.hibernate.annotations.Cache</code>\u6CE8\u89E3\u6765\u5B9E\u73B0\u3002
p20-2-1-4 = \u5982\u679C\u96C6\u5408\u4E2D\u5305\u542B\u5B9E\u4F53\uFF0CHibernate\u4E5F\u5141\u8BB8\u4F60\u7F13\u5B58\u96C6\u5408\u7684\u5185\u5BB9\u6216\u8005\u6807\u793A\u7B26\u3002\u9700\u8981\u5728\u96C6\u5408\u5C5E\u6027\u4E0A\u4F7F\u7528 <code>@Cache</code>\u6CE8\u89E3\uFF1B
p20-2-1-5 = <a href="#example-cache-annotation-with-attributes">Example 20.7, \u201C @Cache \u53CA\u5C5E\u6027\u201D</a>\u5C55\u793A\u4E86 <code>@org.hibernate.annotations.Cache</code> \u6CE8\u89E3\u548C\u5B83\u7684\u5C5E\u6027\u3002
td20-2-1-1-1 = <code>usage</code>: \u7ED9\u5B9A\u7684\u7F13\u5B58\u5E76\u53D1\u7B56\u7565 (NONE, READ_ONLY, NONSTRICT_READ_WRITE, READ_WRITE, TRANSACTIONAL)
td20-2-1-1-2 = <code>region</code> (\u53EF\u9009): \u7F13\u5B58\u7684\u533A\u57DF\u540D (\u9ED8\u8BA4\u662F\u7C7B\u6216\u8005\u96C6\u5408\u7684\u540D\u5B57)
td20-2-1-1-3 = <code>include</code> (\u53EF\u9009): all \u7528\u4E8E\u5305\u542B\u6240\u6709\u7684\u5C5E\u6027\uFF0C non-lazy \u53EA\u5305\u542B\u975E\u5EF6\u8FDF\u5C5E\u6027\uFF0C\u9ED8\u8BA4\u662Fall.
p20-2-1-6 = \u4E0B\u9762\u6211\u4EEC\u6765\u770B\u770BHibernate\u6620\u5C04\u6587\u4EF6\u3002 \u7C7B\u6216\u8005\u96C6\u5408\u6620\u5C04\u4E2D\u7684<code>&lt;cache&gt;</code>\u5143\u7D20\u7528\u4E8E\u914D\u7F6E\u4E8C\u7EA7\u7F13\u5B58\u3002\u67E5\u770B <a href="#example-hibernate-cache-mapping-element">Example 20.8, \u201CHibernate &lt;cache&gt; \u6620\u5C04\u5143\u7D20\u201D</a> \uFF0C\u663E\u7136\u548C\u6CE8\u89E3\u65F6\u76F8\u4F3C\u7684\u3002
td20-2-1-2-1 = <code>usage</code> (\u5FC5\u987B) \u6307\u5B9A\u6293\u53D6\u7B56\u7565: <code>transactional</code>, <code>read-write</code>, <code>nonstrict-read-write</code> \u6216\u8005 <code>read-only</code> 
td20-2-1-2-2 = <code>region</code> (\u53EF\u9009: \u9ED8\u8BA4\u662F\u7C7B\u6216\u8005\u96C6\u5408\u7684\u540D\u5B57):\u6307\u5B9A\u4E8C\u7EA7\u7F13\u5B58\u7684\u533A\u57DF\u540D
td20-2-1-2-3 = <code>include</code> (\u53EF\u9009: \u9ED8\u8BA4\u662F all) <code>non-lazy</code>: \u5F53\u5C5E\u6027\u7EA7\u5EF6\u8FDF\u52A0\u8F7D\u6253\u5F00\u65F6\uFF0C\u6807\u8BB0\u4E3A<code>lazy="true"</code>\u7684\u5B9E\u4F53\u7684\u5C5E\u6027\u53EF\u80FD\u65E0\u6CD5\u88AB\u7F13\u5B58\u3002
p20-2-1-7 = \u6B64\u5916<code>&lt;cache&gt;</code>, \u4F60\u53EF\u4EE5\u5728<code>hibernate.cfg.xml</code>\u4E2D\u6307\u5B9A <code>&lt;class-cache&gt;</code> \u548C <code>&lt;collection-cache&gt;</code> \u5143\u7D20\u3002
p20-2-1-8 = \u4E0B\u9762\u6211\u4EEC\u8BE6\u7EC6\u770B\u4E00\u4E0Busage\u7B56\u7565

#		**********************************************************************************************************
#		20.2.2. Strategy: read only
#		**********************************************************************************************************

title20-2-2 = 20.2.2. \u7B56\u7565: \u53EA\u8BFB
p20-2-2-1 = \u5982\u679C\u4F60\u7684\u5E94\u7528\u7A0B\u5E8F\u9700\u8981\u8BFB\u53D6\u4E00\u4E2A\u6301\u4E45\u5316\u7C7B\u7684\u5B9E\u4F8B\uFF0C\u800C\u65E0\u9700\u5BF9\u5176\u4FEE\u6539\uFF0C\u90A3\u4E48\u53EF\u4EE5\u5BF9\u5176\u8FDB\u884C\u53EA\u8BFB\u7F13\u5B58\u3002\u8FD9\u662F\u6700\u7B80\u5355\u4E5F\u662F\u5B9E\u7528\u6027\u6700\u597D\u7684\u65B9\u6CD5\u3002\u751A\u81F3\u5728\u96C6\u7FA4\u4E2D\uFF0C\u5B83\u4E5F\u80FD\u5B8C\u7F8E\u7684\u8FD0\u4F5C\u3002

#		**********************************************************************************************************
#		20.2.3. Strategy: read/write
#		**********************************************************************************************************

title20-2-3 = 20.2.3. Strategy: \u8BFB/\u5199
p20-2-3-1 = \u5982\u679C\u5E94\u7528\u7A0B\u5E8F\u9700\u8981\u66F4\u65B0\u6570\u636E\uFF0C\u90A3\u4E48\u4F7F\u7528<code>\u8BFB-\u5199</code>\u7F13\u5B58\u6BD4\u8F83\u5408\u9002\u3002\u5982\u679C\u5E94\u7528\u7A0B\u5E8F\u9700\u8981\u201C\u5E8F\u5217\u5316\u4E8B\u52A1\u201D\u9694\u79BB\u7EA7\u522B\uFF0C\u90A3\u4E48\u8DB3\u989D\u4E0D\u80FD\u4F7F\u7528\u8FD9\u79CD\u7F13\u5B58\u7B56\u7565\u3002\u5982\u679C\u5728JTA\u73AF\u5883\u4E2D\u4F7F\u7528\u7F13\u5B58\uFF0C\u4F60\u5FC5\u987B\u6307\u5B9A<code>hibernate.transaction.manager_lookup_class</code> \u5C5E\u6027\u7684\u503C\uFF0C \u901A\u8FC7\u5B83\uFF0CHibernate\u624D\u80FD\u77E5\u9053\u8BE5\u5E94\u7528\u7A0B\u5E8F\u4E2DJTA\u7684TransactionManager\u7684\u5177\u4F53\u7B56\u7565\u3002\u5728\u5176\u4ED6\u73AF\u5883\u4E2D\uFF0C\u4F60\u5FC5\u987B\u4FDD\u8BC1\u5728\u8C03\u7528<code>Session.close()</code> \u6216\u8005 <code>Session.disconnect()</code> \u4E4B\u524D\uFF0C\u4E8B\u52A1\u5DF2\u7ECF\u7ED3\u675F\u3002\u5982\u679C\u4F60\u60F3\u5728\u96C6\u7FA4\u73AF\u5883\u4E2D\u4F7F\u7528\u6B64\u7B56\u7565\uFF0C\u4F60\u5FC5\u987B\u4FDD\u8BC1\u5E95\u5C42\u7684\u7F13\u5B58\u5B9E\u73B0\u652F\u6301\u8BF4\u5B9A\u3002Hibernate\u5185\u7F6E\u7684\u7F13\u5B58\u7B56\u7565\u5E76\u4E0D\u652F\u6301\u9501\u5B9A\u3002

#		**********************************************************************************************************
#		20.2.4. Strategy: nonstrict read/write
#		**********************************************************************************************************

title20-2-4 = 20.2.4. \u7B56\u7565: \u975E\u4E25\u683C \u8BFB/\u5199
p20-2-4-1 = \u5982\u679C\u4F60\u7684\u5E94\u7528\u53EA\u9700\u8981\u5076\u5C14\u66F4\u65B0\u6570\u636E (\u4E5F\u5C31\u662F\u8BF4\uFF0C\u4E24\u4E2A\u4E8B\u52A1\u540C\u65F6\u66F4\u65B0\u540C\u4E00\u4E2A\u8BB0\u5F55\u7684\u60C5\u51B5\u5F88\u4E0D\u5E38\u89C1), \u5E76\u4E14\u4E5F\u4E0D\u9700\u8981\u5341\u5206\u4E25\u683C\u7684\u4E8B\u52A1\u9694\u79BB\uFF0C\u90A3\u4E48\u6BD4\u8F83\u9002\u5408\u4F7F\u7528 <code>nonstrict-read-write</code>\u7B56\u7565\u3002\u5982\u679C\u5728JTA\u4E2D\u4F7F\u7528\u8BE5\u7B56\u7565\uFF0C\u7C73\u4E0D\u8BB8\u6307\u5B9A  <code>hibernate.transaction.manager_lookup_class</code>\u5C5E\u6027\u7684\u503C\u3002\u5728\u5176\u4ED6\u73AF\u5883\u4E2D\uFF0C\u4F60\u9700\u8981\u4FDD\u8BC1\u5728\u8C03\u7528 <code>Session.close()</code>\u6216\u8005<code>Session.disconnect()</code>\u4E4B\u524D\u4E8B\u52A1\u5DF2\u7ECF\u7ED3\u675F\u3002

#		**********************************************************************************************************
#		20.2.5. Strategy: transactional
#		**********************************************************************************************************

title20-2-5 = 20.2.5. \u7B56\u7565: \u4E8B\u52A1
p20-2-5-1 =  <code>transactional</code> \u7F13\u5B58\u7B56\u7565\u652F\u6301\u6240\u6709\u7684\u4E8B\u52A1\u7F13\u5B58\u63D0\u4F9B\u50CF\uFF0C\u4F8B\u5982 JBoss TreeCache\u3002\u8FD9\u79CD\u7F13\u5B58\u53EA\u80FD\u7528\u4E8EJTA\u73AF\u5883\u3002\u5E76\u4E14\u4F60\u5FC5\u987B\u5236\u5B9A<code>hibernate.transaction.manager_lookup_class</code>\u3002

#		**********************************************************************************************************
#		20.2.6. Cache-provider/concurrency-strategy compatibility
#		**********************************************************************************************************

title20-2-6 = 20.2.6. \u5404\u79CD\u7F13\u5B58\u63D0\u4F9B\u5546\u5BF9\u7F13\u5B58\u5E76\u53D1\u7B56\u7565\u7684\u652F\u6301\u60C5\u51B5
ic20-2-6-1 = None of the cache providers support all of the cache concurrency strategies.
p20-2-6-1 = The following table shows which providers are compatible with which concurrency strategies.
p20-2-6-2 = <strong>Table 20.2. Cache Concurrency Strategy Support</strong>
th20-2-6-1-1 = Cache
th20-2-6-1-2 = read-only
th20-2-6-1-3 = nonstrict-read-write
th20-2-6-1-4 = read-write
th20-2-6-1-5 = transactional
td20-2-6-1-1 = ConcurrentHashMap (not intended for production use)
td20-2-6-1-2 = yes
td20-2-6-1-3 = yes
td20-2-6-1-4 = yes
td20-2-6-1-5 = 
td20-2-6-1-6 = EHCache
td20-2-6-1-7 = yes
td20-2-6-1-8 = yes
td20-2-6-1-9 = yes
td20-2-6-1-10 = yes
td20-2-6-1-11 = Infinispan
td20-2-6-1-12 = yes
td20-2-6-1-13 = 
td20-2-6-1-14 = 
td20-2-6-1-15 = yes

#		**********************************************************************************************************
#		20.3. Managing the caches
#		**********************************************************************************************************

title20-3 = 20.3. \u7BA1\u7406\u7F13\u5B58
p20-3-1 = \u65E0\u8BBA\u4F55\u65F6\u5F53\u4F60\u7ED9 <code>save()</code>, <code>update()</code> \u6216\u8005 <code>saveOrUpdate()</code>\u65B9\u6CD5\u4F20\u9012\u4E00\u4E2A\u5BF9\u8C61\u65F6, \u6216\u8005\u5F53\u4F60\u4F7F\u7528<code>load()</code>, <code>get()</code>, <code>list()</code>, <code>iterate()</code> \u6216 <code>scroll()</code>\u65B9\u6CD5\u83B7\u5F97\u4E00\u4E2A\u5BF9\u8C61\u65F6, \u8BE5\u5BF9\u8C61\u5C06\u4F1A\u88AB\u52A0\u5165\u5230Session\u5185\u90E8\u7684\u7F13\u5B58\u4E2D\u3002
p20-3-2 = \u5F53 <code>flush()</code>\u65B9\u6CD5\u88AB\u8C03\u7528\uFF0C\u5BF9\u8C61\u7684\u72B6\u6001\u5C06\u4F1A\u548C\u6570\u636E\u5E93\u540C\u6B65\u3002\u5982\u679C\u4F60\u4E0D\u5E0C\u671B\u6B64\u540C\u6B65\u64CD\u4F5C\u53D1\u751F\uFF0C\u6216\u8005\u4F60\u6B63\u5904\u7406\u5927\u91CF\u5BF9\u8C61\u3001\u9700\u8981\u6709\u6548\u7BA1\u7406\u5185\u5B58\u65F6\uFF0C \u53EF\u4EE5\u4F7F\u7528 <code>evict()</code>\u65B9\u6CD5\uFF0C\u4ECE\u4E00\u7EA7\u7F13\u5B58\u4E2D\u53BB\u6389\u8FD9\u4E9B\u5BF9\u8C61\u53CA\u5176\u96C6\u5408\u3002
p20-3-3 = Session\u4E5F\u63D0\u4F9B\u4E86\u4E00\u4E2A<code>contains()</code>\u65B9\u6CD5\u6765\u5224\u65AD\u67D0\u4E2A\u5B9E\u4F8B\u662F\u5426\u5904\u4E8E\u5F53\u524DSession\u7684\u7F13\u5B58\u4E2D\u3002
p20-3-4 = \u82E5\u679C\u8981\u628A\u6240\u6709\u7684\u5BF9\u8C61\u4ECESession\u7F13\u5B58\u4E2D\u5F7B\u5E95\u6E05\u9664\uFF0C\u5219\u9700\u8981\u4F7F\u7528<code>Session.clear()</code>\u65B9\u6CD5\u3002
p20-3-5 = \u5BF9\u4E8E\u4E8C\u7EA7\u7F13\u5B58\u6765\u8BF4, \u5728 <code>SessionFactory</code>\u4E2D\u5B9A\u4E49\u4E86\u8BB8\u591A\u65B9\u6CD5\uFF0C\u7528\u4E8E\u6E05\u9664\u7F13\u5B58\u4E2D\u7684\u5B9E\u4F8B\u3001\u8FD9\u4E2A\u7C7B\u3001\u96C6\u5408\u5B9E\u4F8B\u6216\u8005\u6574\u4E2A\u96C6\u5408\u3002
p20-3-6 = CacheMode\u53C2\u6570\u7528\u4E8E\u63A7\u5236\u5177\u4F53\u7684Session\u662F\u5982\u4F55\u4E0E\u4E8C\u7EA7\u7F13\u5B58\u8FDB\u884C\u4EA4\u4E92\uFF1A
li20-3-1-1 = <code>CacheMode.NORMAL</code>: \u4ECE\u4E8C\u7EA7\u7F13\u5B58\u4E2D\u8BFB\u5199\u6570\u636E\u3002
li20-3-1-2 = <code>CacheMode.GET</code>: \u4ECE\u4E8C\u7EA7\u7F13\u5B58\u4E2D\u8BFB\u53D6\u6570\u636E\uFF0C\u5C3D\u5728\u6570\u636E\u66F4\u65B0\u65F6\u5BF9\u4E8C\u7EA7\u7F13\u5B58\u5199\u6570\u636E\u3002
li20-3-1-3 = <code>CacheMode.PUT</code>: \u4EC5\u5411\u4E8C\u7EA7\u7F13\u5B58\u5199\u6570\u636E\uFF0C\u4F46\u4E0D\u4ECE\u4E8C\u7EA7\u7F13\u5B58\u4E2D\u8BFB\u6570\u636E\u3002
li20-3-1-4 = <code>CacheMode.REFRESH</code>: \u4EC5\u5411\u4E8C\u7EA7\u7F13\u5B58\u4E2D\u5199\u6570\u636E\uFF0C\u4F46\u4E0D\u4ECE\u4E8C\u7EA7\u7F13\u5B58\u4E2D\u8BFB\u6570\u636E\u3002\u901A\u8FC7<code>hibernate.cache.use_minimal_puts</code>\u7684\u8BBE\u7F6E\uFF0C\u5F3A\u5236\u4E8C\u7EA7\u7F13\u5B58\u4ECE\u6570\u636E\u5E93\u4E2D\u8BFB\u53D6\u719F\u8BFB\uFF0C\u5237\u65B0\u7F13\u5B58\u5185\u5BB9\u3002
p20-3-7 = \u5982\u679C\u4F60\u8981\u67E5\u770B\u4E8C\u7EA7\u7F13\u5B58\u6216\u67E5\u8BE2\u7F13\u5B58\u533A\u57DF\u7684\u5185\u5BB9\uFF0C\u4F60\u53EF\u4EE5\u4F7F\u7528 <code>Statistics</code> API:
p20-3-8 = \u6B64\u65F6\u4F60\u9700\u8981\u624B\u52A8\u6253\u5F00\u7EDF\u8BA1\u9009\u9879\uFF0C\u53EF\u9009\u7684\uFF0C\u4F60\u53EF\u4EE5\u8BA9Hibernate\u66F4\u53EF\u8BFB\u7684\u65B9\u5F0F\u7EF4\u62A4\u7F13\u5B58\u5185\u5BB9\uFF1A

#		**********************************************************************************************************
#		20.4. The Query Cache
#		**********************************************************************************************************

title20-4 = 20.4. \u67E5\u8BE2\u7F13\u5B58
p20-4-1 = \u67E5\u8BE2\u7ED3\u679C\u96C6\u4E5F\u53EF\u4EE5\u88AB\u7F13\u5B58\u3002\u53EA\u6709\u5F53\u7ECF\u5E38\u4F7F\u7528\u540C\u6837\u7684\u53C2\u6570\u8FDB\u884C\u67E5\u8BE2\u65F6\uFF0C\u8FD9\u624D\u4F1A\u6709\u7528\u5904\u3002\u8981\u4F7F\u7528\u67E5\u8BE2\u7F13\u5B58\uFF0C\u9996\u5148\u4F60\u5FC5\u987B\u6253\u5F00\u5B83\uFF1A

#		**********************************************************************************************************
#		20.4.1. Enabling query caching
#		**********************************************************************************************************

title20-4-1 = 20.4.1. \u6253\u5F00\u67E5\u8BE2\u7F13\u5B58
p20-4-1-1 = \u5BF9\u4E8E\u5E94\u7528\u4E2D\u6B63\u5E38\u7684\u4E8B\u52A1\u5904\u7406\uFF0C\u7F13\u5B58\u67E5\u8BE2\u7ED3\u679C\u4F1A\u5BFC\u81F4\u4E00\u4E9B\u989D\u5916\u7684\u5F00\u9500\u3002\u4F8B\u5982\uFF0C\u5982\u679C\u4F60\u5BF9Persion\u7684\u67E5\u8BE2\u7ED3\u679C\u8FDB\u884C\u7F13\u5B58\uFF0CHibernate\u5C31\u9700\u8981\u8DDF\u8E2A\u4EC0\u4E48\u65F6\u5019\u8FD9\u4E9B\u67E5\u8BE2\u7ED3\u679C\u65E0\u6548\u3002\u56E0\u4E3A\u5BF9\u4E8EPersion\u7684\u4FEE\u6539\u5DF2\u7ECF\u63D0\u4EA4\u3002\u4E5F\u5C31\u662F\u8BF4\uFF0C\u518D\u52A0\u4E0A\u5927\u591A\u6570\u5E94\u7528\u7A0B\u5E8F\u4E0D\u80FD\u4ECE\u7F13\u5B58\u67E5\u8BE2\u7ED3\u679C\u4E2D\u83B7\u5F97\u597D\u5904\uFF0C\u56E0\u6B64Hibernate\u9ED8\u8BA4\u60C5\u51B5\u4E0B\u7981\u7528\u67E5\u8BE2\u7ED3\u679C\u7F13\u5B58\u3002\u5982\u679C\u8981\u4F7F\u7528\u67E5\u8BE2\u7F13\u5B58\uFF0C\u9996\u5148\u4F60\u9700\u8981\u4F7F\u67E5\u8BE2\u7F13\u5B58\u53EF\u7528\uFF1A
p20-4-1-2 = \u8BE5\u8BBE\u7F6E\u5C06\u4F1A\u521B\u5EFA\u4E24\u4E2A\u7F13\u5B58\u533A\u57DF\uFF1A
li20-4-1-1-1 = <code>org.hibernate.cache.internal.StandardQueryCache</code>, \u7528\u4E8E\u4FDD\u5B58\u67E5\u8BE2\u7ED3\u679C\u96C6
li20-4-1-1-2 = <code>org.hibernate.cache.spi.UpdateTimestampsCache</code>, \u7528\u4E8E\u4FDD\u5B58\u6700\u8FD1\u67E5\u8BE2\u7684\u4E00\u7CFB\u5217\u8868\u7684\u65F6\u95F4\u6233\u3002\u4ED6\u4EEC\u88AB\u7528\u4E8E\u9A8C\u8BC1\u7ED3\u679C\uFF0C\u56E0\u4E3A\u4ED6\u4EEC\u662F\u7531\u67E5\u8BE2\u7F13\u5B58\u63D0\u4F9B\u670D\u52A1\u3002
ic20-4-1-1 = \u5982\u679C\u4F60\u914D\u7F6E\u5E95\u5C42\u7684\u7F13\u5B58\u5B9E\u73B0\u4F7F\u7528\u8FC7\u671F\u6216\u8005\u8D85\u65F6\uFF0C\u8BBE\u7F6EUpdateTimestampsCache\u7684\u5E95\u5C42\u7684\u7F13\u5B58\u533A\u57DF\u7684\u8D85\u65F6\u65F6\u95F4\u5927\u4E8E\u5176\u4ED6\u4EFB\u4F55\u7684\u67E5\u8BE2\u7F13\u5B58\u7684\u8D85\u65F6\u65F6\u95F4\u662F\u975E\u5E38\u91CD\u8981\u7684\u3002 \u5B9E\u9645\u4E0A\uFF0C\u6211\u4EEC\u5EFA\u8BAE\u4E0D\u8981\u7ED9UpdateTimestampsCache\u533A\u57DF\u8BBE\u7F6E\u7F13\u5B58\u8FC7\u671F\u65F6\u95F4\u3002\u6CE8\u610F\uFF0C\u5BF9\u4E8ELRU\u7F13\u5B58\u5230\u671F\u5C24\u5176\u4E0D\u9002\u5408\u3002
p20-4-1-3 = \u5982\u4E0A\u6240\u8FF0\uFF0C\u7EDD\u5927\u591A\u6570\u7684\u67E5\u8BE2\u5E76\u4E0D\u80FD\u4ECE\u67E5\u8BE2\u7F13\u5B58\u4E2D\u53D7\u76CA\uFF0C\u6240\u4EE5\uFF0C\u9ED8\u8BA4\u60C5\u51B5\u4E0B\uFF0C\u5373\u4F7F\u5728\u6253\u5F00\u67E5\u8BE2\u7F13\u5B58\u65F6\uFF0C\u5355\u72EC\u67E5\u8BE2\u4E5F\u4E0D\u8FDB\u884C\u67E5\u8BE2\u7ED3\u679C\u7F13\u5B58\u3002\u5982\u679C\u8981\u5BF9\u7279\u5B9A\u7684\u67E5\u8BE2\u8FDB\u884C\u7F13\u5B58\uFF0C\u8C03\u7528<code>org.hibernate.Query.setCacheable(true)</code>\u65B9\u6CD5\uFF0C\u8FD9\u4E2A\u8C03\u7528\u4F1A\u8BA9\u67E5\u8BE2\u5728\u6267\u884C\u65F6\u5148\u4ECE\u7F13\u5B58\u4E2D\u67E5\u627E\u7ED3\u679C\uFF0C\u5E76\u5C06\u81EA\u5DF1\u7684\u7ED3\u679C\u96C6\u653E\u5230\u7F13\u5B58\u4E2D\u53BB\u3002
nc20-4-1-1 = \u67E5\u8BE2\u7F13\u5B58\u5E76\u4E0D\u7F13\u5B58\u5B9E\u4F53\u7684\u72B6\u6001\uFF1B \u5B83\u53EA\u7F13\u5B58\u6807\u793A\u7B26\u7684\u503C\u548C\u503C\u7C7B\u578B\u3002\u4E3A\u6B64\uFF0C\u5BF9\u4E8E\u90A3\u4E9B\u5E0C\u671B\u4F5C\u4E3A\u67E5\u8BE2\u7F13\u5B58\u4E00\u90E8\u5206\u7684\u5B9E\u4F53\uFF0C\u67E5\u8BE2\u7F13\u5B58\u901A\u5E38\u548C\u4E8C\u7EA7\u7F13\u5B58\u7ED3\u5408\u4F7F\u7528(\u5C31\u50CF\u96C6\u5408\u7F13\u5B58).

#		**********************************************************************************************************
#		20.4.2. Query cache regions
#		**********************************************************************************************************

title20-4-2 = 20.4.2. \u7F13\u5B58\u533A\u57DF\u67E5\u8BE2
p20-4-2-1 = \u5982\u679C\u4F60\u9700\u8981\u5BF9\u67E5\u8BE2\u7F13\u5B58\u7684\u5931\u6548\u653F\u7B56\u8FDB\u884C\u7CBE\u786E\u7684\u63A7\u5236\uFF0C\u4F60\u5FC5\u987B\u8C03\u7528<code>Query.setCacheRegion()</code>\u65B9\u6CD5\uFF0C\u4E3A\u6BCF\u4E2A\u67E5\u8BE2\u6307\u5B9A\u5176\u547D\u540D\u7684\u7F13\u5B58\u533A\u57DF\u3002
p20-4-2-2 = \u5982\u679C\u4F60\u9700\u8981\u5F3A\u884C\u5237\u65B0\u5176\u67E5\u8BE2\u7F13\u5B58\u533A\u57DF (\u5FFD\u7565\u6240\u6709\u53D1\u73B0\u7684\u7F13\u5B58\u7ED3\u679C)\uFF0C\u53EF\u4EE5\u4F7F\u7528 <code>org.hibernate.Query.setCacheMode(CacheMode.REFRESH)</code>\u3002 \u7ED3\u5408\u4F60\u4E3A\u7ED9\u5B9A\u7684\u67E5\u8BE2\u5B9A\u4E49\u7684\u533A\u57DF\uFF0CHibernate\u5C06\u4F1A\u5728\u5C06\u8981\u5237\u65B0\u7684\u533A\u57DF\u4E2D\u6709\u9009\u62E9\u7684\u5F3A\u5236\u7ED3\u679C\u7F13\u5B58\u3002\u5F53\u5E95\u5C42\u7684\u6570\u636E\u901A\u8FC7\u4E00\u4E2A\u5355\u72EC\u7684\u7EBF\u7A0B\u88AB\u4FEE\u6539\u65F6\uFF0C\u8FD9\u662F\u975E\u5E38\u6709\u7528\u7684\uFF0C\u5E76\u4E14\u4F7F\u7528<code>org.hibernate.SessionFactory.evictQueries()</code>\u6765\u6279\u91CF\u8FC1\u79FB\u7F13\u5B58\u533A\u57DF\u662F\u66F4\u6709\u6548\u7684\u66FF\u4EE3\u65B9\u6848\u3002

#		**********************************************************************************************************
#		20.5. Bytecode Enhancement
#		**********************************************************************************************************

title20-5 = 20.5. \u5B57\u8282\u7801\u589E\u5F3A
p20-5-1 = \u5F53\u8FD9\u4E2A\u5BF9\u8C61\u548C\u4E00\u4E2ASession\u5173\u8054\u65F6\uFF0CHibernate \u5185\u90E8\u9700\u8981\u4E00\u4E2A\u5B9E\u4F53( <code>org.hibernate.engine.spi.EntityEntry</code> ) \u6765\u544A\u8BC9\u5B9E\u4F53\u5B83\u76F8\u5BF9\u4E8E\u6301\u4E45\u5316\u72B6\u6001\u7684\u5F53\u524D\u7684\u72B6\u6001\u3002\u7136\u800C\uFF0C\u4F18\u4E8E\u5F88\u591A\u5176\u4ED6\u7684\u89C4\u5219\u5FC5\u987B\u8981\u9075\u5B88\uFF0C\u7EF4\u6301\u8FD9\u79CD\u5173\u8054\u662F\u4E00\u79CD\u6C89\u91CD\u7684\u64CD\u4F5C\u3002\u4ECE4.2.0\u5F00\u59CB\uFF0C\u51FA\u4E8E\u8FD9\u4E2A\u76EE\u7684\uFF0C\u6709\u4E00\u4E2A\u65B0\u7684\u6539\u8FDB\uFF0C\u5B83\u5C06\u4F1A\u51CF\u8F7B\u4E0E\u4F1A\u8BDD\u76F8\u5173\u7684\u5185\u5B58\u5360\u7528\u548Ccpu\u8FC7\u8F7D\u7684\u95EE\u9898\u3002
p20-5-2 = \u57FA\u672C\u7684\u60F3\u6CD5\u662F, \u4EE3\u66FF\u4F7F\u7528\u81EA\u5B9A\u4E49\u7684\uFF08\u8FD9\u79CD\u65B9\u5F0F\u5F88\u6D88\u8017\u8D44\u6E90\u5E76\u4E14\u901A\u5E38\u88AB\u8BA4\u4E3A\u662F\u8D44\u6E90\u6D88\u8017\u70B9\uFF09\u7684map\u6765\u6267\u884C\u67E5\u627E\uFF0C\u6211\u4EEC\u4FEE\u6539\u5982\u4E0B 
p20-5-3 = \u6709\u4E09\u79CD\u65B9\u5F0F\u6765\u4ECE\u8FD9\u4E2A\u6539\u8FDB\u4E2D\u83B7\u5F97\u597D\u5904\uFF1A

#		**********************************************************************************************************
#		20.5.1. Implementing org.hibernate.engine.spi.ManagedEntity interface
#		**********************************************************************************************************

title20-5-1 = 20.5.1. \u5B9E\u73B0org.hibernate.engine.spi.ManagedEntity \u63A5\u53E3
p20-5-1-1 = \u4E00\u4E2A\u5B9E\u4F53\u53EF\u4EE5\u9009\u62E9\u81EA\u884C\u5B9E\u73B0\u6B64\u63A5\u53E3\uFF0C\u90A3\u4E48\u5C31\u7531\u5B9E\u4F53\u8D1F\u8D23\u6765\u7EF4\u6301\u53CC\u5411\u5173\u8054\uFF0C\u8FD9\u4E2A\u5173\u8054\u4E2D\u63D0\u4F9B\u4E86\u8BBF\u95EE\u548CSession/EntityManager\u5411\u5173\u8054\u7684\u5B9E\u4F53\u4FE1\u606F\u7684\u65B9\u6CD5\u3002\u66F4\u591A\u5173\u4E8E org.hibernate.engine.spi.ManagedEntity \u7684\u4FE1\u606F\u8BF7\u53C2javadoc\u3002

#		**********************************************************************************************************
#		20.5.2. Runtime instrument
#		**********************************************************************************************************

title20-5-2 = 20.5.2. \u8FD0\u884C\u65F6\u5DE5\u5177
p20-5-2-1 = \u6709\u4E9B\u65F6\u5019\uFF0C\u4F60\u53EF\u80FD\u4E0D\u60F3\u5B9E\u73B0\u5165\u4FB5\u6027\u7684\u63A5\u53E3\uFF0C\u53EF\u80FD\u662F\u5904\u4E8E\u53EF\u79FB\u690D\u6027\u8003\u8651\uFF0CHibernate\u7167\u987E\u5230\u4E86\u8FD9\u79CD\u60C5\u51B5\uFF0CHibernate\u4F1A\u7528\u4E00\u4E2A\u5B9E\u73B0\u4E86\u8FD9\u4E2A\u63A5\u53E3\u7684\u7C7B\u5305\u88F9\u4F4F\u5B83\u4EEC\uFF0C which is fine and Hibernate will take care of this internally with a wrapper class which implements that interface, and also an internal cache that maps this entity instance and the wrapper together.
p20-5-2-2 = \u5F88\u663E\u7136\uFF0C\u8FD9\u662F\u53EF\u9009\u62E9\u7684\u6700\u7B80\u5355\u7684\u65B9\u6CD5\uFF0C\u56E0\u4E3A\u8FD9\u4E0D\u9700\u8981\u6539\u53D8\u4EFB\u4F55\u9879\u76EE\u6E90\u4EE3\u7801\uFF0C\u4F46\u662F\u4E0E\u7B2C\u4E00\u4E2A\u76F8\u6BD4\uFF0C\u5B83\u66F4\u52A0\u8017\u5185\u5B58\u548CCPU\u3002

#		**********************************************************************************************************
#		20.5.3. Build-time instrument
#		**********************************************************************************************************

title20-5-3 = 20.5.3. \u6784\u5EFA\u65F6\u5DE5\u5177
p20-5-3-1 = \u9664\u4E86\u4E0A\u8FF0\u7684\u4E24\u79CD\u65B9\u6CD5\uFF0CHibernate\u8FD8\u63D0\u4F9B\u4E86\u7B2C\u4E09\u79CD\u65B9\u5F0F\uFF0C\u5373\u5B57\u8282\u7801\u589E\u5F3A\u3002\u5E94\u7528\u7A0B\u5E8F\u901A\u8FC7\u6CE8\u89E3<code>javax.persistence.Entity</code>\u6216\u8005\u590D\u5408\u4F7F\u7528<code>javax.persistence.Embeddable</code>\u6765\u4F7F\u7528\u589E\u5F3A\u7684\u5B9E\u4F53\u7C7B\u3002
p20-5-3-2 = 1. Ant\u4EFB\u52A1
p20-5-3-3 = \u5982\u4E0B\u6240\u793A\uFF0C\u4F7F\u7528<code>org.hibernate.tool.enhance.EnhancementTask</code>\u5B9A\u4E49\u4E00\u4E2Ataskdef\u5E76\u4E14\u8C03\u7528\u8FD9\u4E2Atask\u3002\u8FD9\u4E2A\u4EE3\u7801\u4F7F\u7528\u4E86\u9884\u5B9A\u4E49\u7684classpathref\u548C\u4E00\u4E2A\u6307\u5411\u7F16\u8BD1\u76EE\u5F55\u7684\u5C5E\u6027\u3002
nc20-5-3-1 = \u51FA\u73B0EnhancementTask\u7684\u76EE\u7684\u662F\u4E3A\u4E86\u5B8C\u5168\u66FF\u4EE3InstrumentTask\u3002\u73B0\u5728InstrumentTask\u8FD8\u662F\u5341\u5206\u7684\u91CD\u8981\uFF0C\u6240\u4EE5\u5C06\u6765\u8FD9\u4E9BInstrumentTask\u5C06\u4F1A\u88AB\u4ECE\u65B0\u7F16\u5199\u3002
p20-5-3-4 = 2. Maven\u63D2\u4EF6
p20-5-3-5 = Maven\u63D2\u4EF6\u4F7F\u7528Mojo\u4FEE\u9970\u7B26\u6765\u5C06Mojo\u9644\u52A0\u5230\u4F60\u9879\u76EE\u7684\u7F16\u8BD1\u9636\u6BB5\u3002
p20-5-3-6 = 3. Gradle\u63D2\u4EF6
p20-5-3-7 = Gradle\u63D2\u4EF6\u5C06\u7F16\u8BD1\u4EFB\u52A1\u7684\u8F93\u51FA\u8DEF\u5F84\u4F5C\u4E3A\u5B9E\u4F53\u7C7B\u6587\u4EF6\u7684\u6E90\u8DEF\u5F84\uFF0C\u901A\u8FC7\u5F3A\u5316\u8FD9\u4E2A\u6587\u4EF6\u6765\u6DFB\u52A0\u5F3A\u5316\u4EFB\u52A1\u3002

#		**********************************************************************************************************
#		20.6. Understanding Collection performance
#		**********************************************************************************************************

title20-6 = 20.6. \u7406\u89E3\u96C6\u5408\u7C7B\u7684\u6027\u80FD
p20-6-1 = \u5728\u524D\u51E0\u8282\u6211\u4EEC\u5DF2\u7ECF\u8BA8\u8BBA\u4E86\u96C6\u5408\u4EE5\u53CA\u5B83\u4EEC\u7684\u5E94\u7528\u3002\u5728\u8FD9\u4E00\u8282\u4EEC\u5C06\u7740\u91CD\u8BB2\u8FF0\u96C6\u5408\u5728\u8FD0\u884C\u65F6\u7684\u4E8B\u5B9C\u3002

#		**********************************************************************************************************
#		20.6.1. Taxonomy
#		**********************************************************************************************************

title20-6-1 = 20.6.1. \u5206\u7C7B\u6CD5
p20-6-1-1 = Hibernate\u4E3A\u96C6\u5408\u5B9A\u4E49\u4E86\u4E09\u79CD\u57FA\u672C\u7C7B\u578B\uFF1A
li20-6-1-1-1 = \u503C\u7C7B\u578B
li20-6-1-1-2 = \u4E00\u5BF9\u591A\u5173\u8054
li20-6-1-1-3 = \u591A\u5BF9\u591A\u5173\u8054
p20-6-1-2 = \u8FD9\u79CD\u5206\u7C7B\u65B9\u5F0F\u533A\u5206\u4E86\u5404\u79CD\u8868\u548C\u5916\u952E\u4E4B\u95F4\u7684\u5173\u7CFB\uFF0C\u4F46\u662F\u6CA1\u6709\u544A\u8BC9\u6211\u4EEC\u6709\u5173\u5173\u7CFB\u6A21\u5F0F\u7684\u6240\u6709\u7EC6\u8282\u3002\u8981\u5B8C\u5168\u7406\u89E3\u4ED6\u4EEC\u7684\u5173\u7CFB\u7ED3\u6784\u548C\u6027\u80FD\u7279\u70B9\uFF0C\u6211\u4EEC\u5FC5\u987B\u540C\u65F6\u8003\u8651\u201C\u7528\u4E8EHibernate\u66F4\u65B0\u6216\u5220\u9664\u96C6\u5408\u884C\u6570\u636E\u7684\u4E3B\u952E\u7684\u7ED3\u6784\u201D\u3002\u56E0\u6B64\u5F97\u5230\u4E86\u5982\u4E0B\u7684\u5206\u7C7B\uFF1A
li20-6-1-2-1 = \u6709\u5E8F\u96C6\u5408
li20-6-1-2-2 = sets
li20-6-1-2-3 = bags
p20-6-1-3 = \u6240\u6709\u7684\u6709\u5E8F\u96C6\u5408\uFF08maps,lists,\u548Carrays\uFF09\u90FD\u6709\u4E00\u4E2A\u7531<code>&lt;key&gt;</code>\u548C<code>&lt;index&gt;</code>\u7EC4\u6210\u7684\u4E3B\u952E\u3002\u5728\u8FD9\u79CD\u60C5\u51B5\u4E0B\uFF0C\u96C6\u5408\u7684\u66F4\u65B0\u662F\u5341\u5206\u9AD8\u6548\u7684\u3002\u5F53Hibernate\u8BC6\u56FE\u66F4\u65B0\u6216\u5220\u9664\u6570\u636E\u65F6\uFF0C\u4E3B\u952E\u53EF\u4EE5\u5FEB\u901F\u9AD8\u6548\u7684\u7D22\u5F15\u5230\u6307\u5B9A\u5217\u3002
p20-6-1-4 = Sets\u7531<code>&lt;key&gt;</code>\u548C\u5176\u5B83\u5143\u7D20\u5B57\u6BB5\u6784\u6210\u3002\u8FD9\u76F8\u5BF9\u4E8E\u4E00\u4E9B\u96C6\u5408\u5143\u7D20\u7684\u7C7B\u578B\u800C\u8A00\u662F\u4F4E\u6548\u7684\uFF0C\u7279\u522B\u662F\u590D\u5408\u5143\u7D20\uFF0C\u5927\u6587\u672C\u548C\u4E8C\u8FDB\u5236\u5B57\u6BB5\uFF0C\u9020\u6210\u4F4E\u6548\u7684\u539F\u56E0\u662F\u6570\u636E\u5E93\u53EF\u80FD\u65E0\u6CD5\u9AD8\u6548\u7684\u7D22\u5F15\u5230\u590D\u6742\u7684\u4E3B\u952E\u3002\u7136\u800C\uFF0C\u5BF9\u4E8E<code>one-to-many</code>\u6216\u8005<code>many-to-many</code>\u5173\u8054\u5173\u7CFB\uFF0C\u7279\u522B\u662F\u5408\u6210\u7684\u6807\u793A\u7B26\uFF0C\u96C6\u5408\u4E5F\u80FD\u8FBE\u5230\u540C\u6837\u7684\u9AD8\u6548\u6027\u80FD\u3002\u5982\u679C\u4F60\u5E0C\u671BSchemaExport\u4E3A\u4F60\u7684<set>\u521B\u5EFA\u4E3B\u952E\uFF0C \u4F60\u5FC5\u987B\u628A\u6240\u6709\u7684\u5B57\u6BB5\u90FD\u58F0\u660E\u4E3A<code>not-null="true"</code>\u3002
p20-6-1-5 = <code>&lt;idbag&gt;</code>\u6620\u5C04\u5B9A\u4E49\u4E86\u4EE3\u7406\u952E\uFF0C\u56E0\u6B64\u5B83\u603B\u662F\u53EF\u4EE5\u5F88\u9AD8\u6548\u7684\u88AB\u66F4\u65B0\u3002\u4E8B\u5B9E\u4E0A\uFF0C<code>&lt;idbag&gt;</code>\u62E5\u6709\u7740\u6700\u597D\u7684\u6027\u80FD\u8868\u73B0\u3002
p20-6-1-6 = Bag\u662F\u6700\u5DEE\u7684\u3002\u56E0\u4E3Abag\u5141\u8BB8\u91CD\u590D\u7684\u5143\u7D20\u503C\uFF0C\u4E5F\u6CA1\u6709\u7D22\u5F15\u5B57\u6BB5\uFF0C\u56E0\u6B64\u4E0D\u53EF\u80FD\u5B9A\u4E49\u4E3B\u952E\u3002 Hibernate\u65E0\u6CD5\u5224\u65AD\u51FA\u91CD\u590D\u7684\u884C\u3002\u5F53\u8FD9\u79CD\u96C6\u5408\u88AB\u66F4\u6539\u65F6\uFF0CHibernate\u5C06\u4F1A\u5148\u5B8C\u6574\u5730\u79FB\u9664 \uFF08\u901A\u8FC7\u4E00\u4E2A\u6574\u4E2A\u96C6\u5408\uFF0C\u7136\u540E\u518D\u91CD\u65B0\u521B\u5EFA\u6574\u4E2A\u96C6\u5408\u3002 \u56E0\u6B64Bag\u662F\u975E\u5E38\u4F4E\u6548\u7684\u3002
p20-6-1-7 = \u5BF9\u4E8E\u4E00\u5BF9\u591A\u5173\u8054\u6765\u8BF4\uFF0C\u201C\u4E3B\u952E\u201D\u5F88\u53EF\u80FD\u5E76\u4E0D\u662F\u6570\u636E\u5E93\u8868\u7684\u7269\u7406\u4E3B\u952E\u3002 \u4F46\u5C31\u7B97\u5728\u6B64\u60C5\u51B5\u4E0B\uFF0C\u4E0A\u9762\u7684\u5206\u7C7B\u4ECD\u7136\u662F\u6709\u7528\u7684\u3002\uFF08\u5B83\u4ECD\u7136\u53CD\u6620\u4E86Hibernate\u5728\u96C6\u5408\u7684\u5404\u6570\u636E\u884C\u4E2D\u662F\u5982\u4F55\u8FDB\u884C\u201C\u5B9A\u4F4D\u201D\u7684\u3002\uFF09

#		**********************************************************************************************************
#		20.6.2. Lists, maps, idbags and sets are the most efficient collections to update
#		**********************************************************************************************************

title20-6-2 = 20.6.2. Lists, maps, idbags \u548Csets \u5BF9\u4E8E\u64CD\u4F5Cupdate\u90FD\u662F\u975E\u5E38\u6709\u6548\u7684\u96C6\u5408
p20-6-2-1 = \u901A\u8FC7\u4E0A\u9762\u7684\u8BA8\u8BBA\uFF0C\u5728\u8FDB\u884C\u6DFB\u52A0\u3001\u5220\u9664\u3001\u66F4\u65B0\u5143\u7D20\u64CD\u4F5C\u65F6\u96C6\u5408\u548Csets\u7684\u6548\u7387\u90FD\u662F\u975E\u5E38\u9AD8\u7684\u3002
p20-6-2-2 = \u53EF\u8BBA\u8BC1\u7684\u662F\u5BF9\u4E8E\u591A\u5BF9\u591A\u5173\u8054\u3001\u503C\u6570\u636E\u96C6\u5408\u800C\u8A00\uFF0C\u6709\u5E8F\u96C6\u5408\u7C7B\u6BD4\u96C6\u5408(set)\u6709\u4E00\u4E2A\u597D\u5904\u3002\u56E0\u4E3ASet\u7684\u5185\u5728\u7ED3\u6784\uFF0C\u5982\u679C\u201C\u6539\u53D8\u201D\u4E86\u4E00\u4E2A\u5143\u7D20\uFF0CHibernate\u5E76\u4E0D\u4F1A\u66F4\u65B0\u8FD9\u4E00\u884C\u3002\u5BF9\u4E8ESet\u6765\u8BF4\uFF0C\u53EA\u6709\u5728\u63D2\u5165\u548C\u5220\u9664\u64CD\u4F5C\u65F6\u201C\u6539\u53D8\u201D\u624D\u6709\u6548\u3002\u518D\u6B21\u5F3A\u8C03\uFF1A\u8FD9\u6BB5\u8BA8\u8BBA\u5BF9\u201C\u4E00\u5BF9\u591A\u5173\u8054\u201D\u5E76\u4E0D\u9002\u7528\u3002
p20-6-2-3 = \u6CE8\u610F\u5230\u6570\u7EC4\u65E0\u6CD5\u5EF6\u8FDF\u8F7D\u5165\uFF0C\u6211\u4EEC\u53EF\u4EE5\u5F97\u51FA\u7ED3\u8BBA\uFF1Alists\uFF0Cmaps\u548Cidbags\u662F\u6700\u9AD8\u6548\u7684\u96C6\u5408\u7C7B\u578B\uFF0Csets\u7D27\u968F\u5176\u540E\u3002sets\u662FHibernate\u6700\u5E38\u7528\u7684\u96C6\u5408\u7C7B\u578B\u3002\u8FD9\u662F\u56E0\u4E3ASets\u5728\u5173\u7CFB\u6A21\u578B\u4E2D\u662F\u8868\u73B0\u6700\u81EA\u7136\u7684\u3002
p20-6-2-4 = \u4F46\u662F\uFF0C\u5728\u8BBE\u8BA1\u826F\u597D\u7684Hibernate\u9886\u57DF\u6A21\u578B\u4E2D\uFF0C\u6211\u4EEC\u901A\u5E38\u53EF\u4EE5\u770B\u5230\u66F4\u591A\u7684\u96C6\u5408\u4E8B\u5B9E\u4E0A\u662F\u5E26\u6709<code>inverse="true"</code>\u7684\u4E00\u5BF9\u591A\u7684\u5173\u8054\u3002\u5BF9\u4E8E\u8FD9\u4E9B\u5173\u8054\uFF0C\u66F4\u65B0\u64CD\u4F5C\u5C06\u4F1A\u5728\u591A\u5BF9\u4E00\u7684\u8FD9\u4E00\u7AEF\u8FDB\u884C\u5904\u7406\u3002\u56E0\u6B64\u5BF9\u4E8E\u6B64\u7C7B\u60C5\u51B5\uFF0C\u65E0\u9700\u8003\u8651\u5176\u96C6\u5408\u7684\u66F4\u65B0\u6027\u80FD\u3002

#		**********************************************************************************************************
#		20.6.3. Bags and lists are the most efficient inverse collections
#		**********************************************************************************************************

title20-6-3 = 20.6.3. Bags \u548Clists\u662F\u6700\u6709\u6548\u7684\u9006\u5411\u96C6\u5408
p20-6-3-1 = \u5B58\u5728\u4E00\u79CD\u60C5\u51B5\uFF0C\u4F7F\u7528bags\u548Clists\u6027\u80FD\u6BD4\u4F7F\u7528sets\u597D\u5F88\u591A\u3002\u5BF9\u4E8E\u6307\u660E\u4E86<code>inverse="true"</code>\u7684\u96C6\u5408\u7C7B\uFF08\u6BD4\u5982\u8BF4\uFF0C\u6807\u51C6\u7684\u53CC\u5411\u7684\u4E00\u5BF9\u591A\u5173\u8054\uFF09\uFF0C\u6211\u4EEC\u53EF\u4EE5\u5728\u672A\u521D\u59CB\u5316(fetch)\u5305\u5143\u7D20\u7684\u60C5\u51B5\u4E0B\u76F4\u63A5\u5411bag\u6216list\u6DFB\u52A0\u65B0\u5143\u7D20\uFF0C\u8FD9\u662F\u56E0\u4E3A<code>Collection.add()</code>\u6216\u8005<code>Collection.addAll()</code>\u65B9\u6CD5 \u5BF9bag\u6216\u8005List\u603B\u662F\u8FD4\u56DEtrue\uFF08\u8FD9\u70B9\u4E0E\u4E0ESet\u4E0D\u540C\uFF09\u3002\u56E0\u6B64\u5BF9\u4E8E\u4E0B\u9762\u7684\u76F8\u540C\u4EE3\u7801\u6765\u8BF4\uFF0C\u901F\u5EA6\u4F1A\u5FEB\u5F97\u591A\u3002

#		**********************************************************************************************************
#		20.6.4. One shot delete
#		**********************************************************************************************************

title20-6-4 = 20.6.4. \u4E00\u6B21\u6027\u5220\u9664
p20-6-4-1 = \u9010\u4E2A\u5220\u9664\u96C6\u5408\u4E2D\u7684\u5143\u7D20\u5728\u4E00\u4E9B\u60C5\u51B5\u4E0B\u662F\u5341\u5206\u4F4E\u6548\u7684\u3002Hibernate\u5F53\u7136\u4E0D\u4F1A\u90A3\u6837\u505A\uFF0C\u5982\u679C\u4F60\u60F3\u6E05\u7A7A\u4E00\u4E2A\u96C6\u5408\uFF08\u6BD4\u5982\u4F60\u8C03\u7528\u4E86<code>list.clear()</code>\uFF09\uFF0CHibernate\u53EA\u9700\u8981\u4E00\u4E2A<code>DELETE</code>\u5C31\u641E\u5B9A\u4E86\u3002
p20-6-4-2 = \u52A0\u5165\u4F60\u5728\u4E00\u4E2A\u670920\u4E2A\u5143\u7D20\u7684\u96C6\u5408\u4E2D\u63D2\u5165\u4E86\u4E00\u4E2A\u5143\u7D20\uFF0C\u7136\u540E\u53C8\u5220\u9664\u4E86\u4E24\u4E2A\u3002Hibernate\u4F1A\u6267\u884C\u4E00\u6B21<code>INSERT</code>\u8BED\u53E5\u548C\u4E24\u6B21<code>DELETE</code>\u8BED\u53E5\uFF0C\u9664\u975E\u96C6\u5408\u662F\u4E00\u4E2Abag\u3002\u8FD9\u662F\u663E\u800C\u6613\u89C1\u7684\u3002
p20-6-4-3 = \u4F46\u662F\uFF0C\u5047\u8BBE\u6211\u4EEC\u79FB\u9664\u4E8618\u4E2A\u5143\u7D20\uFF0C\u503C\u7559\u4E0B2\u4E2A\u5143\u7D20\uFF0C\u7136\u540E\u6DFB\u52A0\u4E863\u4E2A\u65B0\u5143\u7D20\u3002\u90A3\u4E48\u6709\u4E24\u79CD\u65B9\u5F0F\u6765\u5904\u7406\u8FD9\u79CD\u60C5\u51B5
li20-6-4-1-1 = \u9010\u4E2A\u5220\u966418\u4E2A\u5143\u7D20\u7136\u540E\u63D2\u5165\u4E09\u884C
li20-6-4-1-2 = \u4F7F\u7528<code>DELETE</code>\u79FB\u9664\u6574\u4E2A\u96C6\u5408\uFF0C\u7136\u540E\u9010\u4E2A\u63D2\u51655\u4E2A\u5143\u7D20
p20-6-4-4 = Hibernate\u4E0D\u77E5\u9053\u4F7F\u7528\u7B2C\u4E8C\u79CD\u65B9\u5F0F\u662F\u5426\u4F1A\u5FEB\u4E00\u4E9B\u3002\u4E5F\u53EF\u80FD\u5982\u679CHibernate\u8FD9\u4E48\u505A\u4F1A\u5F15\u8D77\u4E0D\u6EE1\uFF0C\u56E0\u4E3A\u8FD9\u6837\u7684\u884C\u4E3A\u4F1A\u610F\u5916\u7684\u89E6\u53D1\u6570\u636E\u5E93\u89E6\u53D1\u5668\u7B49\u7B49\u95EE\u9898\u3002
p20-6-4-5 = \u5E78\u8FD0\u7684\u662F\uFF0C\u4F60\u53EF\u4EE5\u5F3A\u5236\u4F7F\u7528\u7B2C\u4E8C\u79CD\u7B56\u7565\u3002\u4F60\u9700\u8981\u53D6\u6D88\u539F\u6765\u7684\u6574\u4E2A\u96C6\u5408\u7C7B\uFF08\u89E3\u9664\u5176\u5F15\u7528\uFF09\uFF0C\u7136\u540E\u518D\u8FD4\u56DE\u4E00\u4E2A\u65B0\u7684\u5B9E\u4F8B\u5316\u7684\u96C6\u5408\u7C7B\uFF0C\u53EA\u5305\u542B\u9700\u8981\u7684\u5143\u7D20\u3002\u6709\u4E9B\u65F6\u5019\u8FD9\u662F\u975E\u5E38\u6709\u7528\u7684\u3002
p20-6-4-6 = \u663E\u7136\uFF0C\u4E00\u6B21\u6027\u5220\u9664\u5E76\u4E0D\u9002\u7528\u4E8E\u88AB\u6620\u5C04\u4E3A<code>inverse="true"</code>\u7684\u96C6\u5408\u3002

#		**********************************************************************************************************
#		20.7. Monitoring performance
#		**********************************************************************************************************

title20-7 = 20.7. \u6027\u80FD\u68C0\u6D4B
p20-7-1 = \u6CA1\u6709\u76D1\u6D4B\u548C\u6027\u80FD\u53C2\u6570\u800C\u8FDB\u884C\u4F18\u5316\u662F\u6BEB\u65E0\u610F\u4E49\u7684\u3002Hibernate\u4E3A\u5176\u5185\u90E8\u64CD\u4F5C\u63D0\u4F9B\u4E86\u4E00\u7CFB\u5217\u7684\u793A\u610F\u56FE\uFF0C\u56E0\u6B64\u53EF\u4EE5\u4ECE \u6BCF\u4E2A<code>SessionFactory</code>\u6293\u53D6\u5176\u7EDF\u8BA1\u6570\u636E\u3002

#		**********************************************************************************************************
#		20.7.1. Monitoring a SessionFactory
#		**********************************************************************************************************

title20-7-1 = 20.7.1. \u68C0\u6D4B SessionFactory
p20-7-1-1 = \u4F60\u53EF\u4EE5\u6709\u4E24\u79CD\u65B9\u5F0F\u8BBF\u95EE<code>SessionFactory</code>\u7684\u6570\u636E\u8BB0\u5F55\uFF0C\u7B2C\u4E00\u79CD\u5C31\u662F\u81EA\u5DF1\u76F4\u63A5\u8C03\u7528 sessionFactory.getStatistics()\u65B9\u6CD5\u8BFB\u53D6\u3001\u663E\u793A\u7EDF\u8BA1\u6570\u636E\u3002
p20-7-1-2 = \u6B64\u5916\uFF0C\u5982\u679C\u4F60\u6253\u5F00StatisticsService MBean\u9009\u9879\uFF0C\u90A3\u4E48Hibernate\u5219\u53EF\u4EE5\u4F7F\u7528JMX\u6280\u672F\u53D1\u5E03\u5176\u6570\u636E\u8BB0\u5F55\u3002\u4F60\u53EF\u4EE5\u8BA9\u5E94\u7528\u4E2D\u6240\u6709\u7684<code>SessionFactory</code>\u540C\u65F6\u5171\u4EAB\u4E00\u4E2AMBean\uFF0C\u4E5F\u53EF\u4EE5\u6BCF\u4E2A SessionFactory\u5206\u914D\u4E00\u4E2AMBean\u3002\u4E0B\u9762\u7684\u4EE3\u7801\u5373\u662F\u5176\u6F14\u793A\u4EE3\u7801\uFF1A
p20-7-1-3 = \u4F60\u53EF\u4EE5\u6FC0\u6D3B\u548C\u505C\u6B62\u5BF9<code>SessionFactory</code>\u7684\u68C0\u6D4B\uFF1A
li20-7-1-1-1 = \u5728\u914D\u7F6E\u671F\u95F4\uFF0C\u5C06<code>hibernate.generate_statistics</code>\u8BBE\u7F6E\u4E3Afalse
li20-7-1-1-2 = \u5728\u8FD0\u884C\u671F\u95F4\uFF1A<code>sf.getStatistics().setStatisticsEnabled(true)</code>\u6216\u8005<code>hibernateStatsBean.setStatisticsEnabled(true)</code>
p20-7-1-4 = \u4F60\u4E5F\u53EF\u4EE5\u5728\u7A0B\u5E8F\u4E2D\u8C03\u7528<code>clear()</code>\u65B9\u6CD5\u91CD\u7F6E\u7EDF\u8BA1\u6570\u636E\uFF0C\u8C03\u7528<code>logSummary()</code>\u5728\u65E5\u5FD7\u4E2D\u8BB0\u5F55\uFF08info\u7EA7\u522B\uFF09\u5176\u603B\u7ED3\u3002

#		**********************************************************************************************************
#		20.7.2. Metrics
#		**********************************************************************************************************

title20-7-2 = 20.7.2. \u5EA6\u91CF
p20-7-2-1 = Hibernate\u63D0\u4F9B\u4E86\u4E00\u7CFB\u5217\u7684\u6570\u636E\u8BB0\u5F55\uFF0C\u5176\u8BB0\u5F55\u7684\u5185\u5BB9\u5305\u62EC\u4ECE\u6700\u57FA\u672C\u7684\u4FE1\u606F\u5230\u4E0E\u5177\u4F53\u573A\u666F\u7684\u7279\u6B8A\u4FE1\u606F\u3002\u6240\u6709\u7684\u6D4B\u91CF\u503C\u90FD\u53EF\u4EE5\u7531<code>Statistics</code>\u63A5\u53E3\u8FDB\u884C\u8BBF\u95EE\uFF0C\u4E3B\u8981\u5206\u4E3A\u4E09\u7C7B\uFF1A
li20-7-2-1-1 = \u4F7F\u7528Session\u7684\u666E\u901A\u6570\u636E\u8BB0\u5F55\uFF0C\u4F8B\u5982\u6253\u5F00\u7684Session\u7684\u4E2A\u6570\u3001\u53D6\u5F97\u7684JDBC\u7684\u8FDE\u63A5\u6570\u7B49\u3002
li20-7-2-1-2 = \u5B9E\u4F53\u3001\u96C6\u5408\u3001\u67E5\u8BE2\u3001\u7F13\u5B58\u7B49\u5185\u5BB9\u7684\u7EDF\u4E00\u6570\u636E\u8BB0\u5F55
li20-7-2-1-3 = \u548C\u5177\u4F53\u5B9E\u4F53\u3001\u96C6\u5408\u3001\u67E5\u8BE2\u3001\u7F13\u5B58\u76F8\u5173\u7684\u8BE6\u7EC6\u6570\u636E\u8BB0\u5F55
p20-7-2-2 = \u4F8B\u5982\uFF1A\u4F60\u53EF\u4EE5\u68C0\u67E5\u7F13\u5B58\u7684\u547D\u4E2D\u6210\u529F\u6B21\u6570\uFF0C\u7F13\u5B58\u7684\u547D\u4E2D\u5931\u8D25\u6B21\u6570\uFF0C\u5B9E\u4F53\u3001\u96C6\u5408\u548C\u67E5\u8BE2\u7684\u4F7F\u7528\u6982\u7387\uFF0C\u67E5\u8BE2\u7684\u5E73\u5747\u65F6\u95F4\u7B49\u3002\u8BF7\u6CE8\u610F Java\u4E2D\u65F6\u95F4\u7684\u8FD1\u4F3C\u7CBE\u5EA6\u662F\u6BEB\u79D2\u3002Hibernate\u7684\u6570\u636E\u7CBE\u5EA6\u548C\u5177\u4F53\u7684JVM\u6709\u5173\uFF0C\u5728\u6709\u4E9B\u5E73\u53F0\u4E0A\u5176\u7CBE\u5EA6\u751A\u81F3\u53EA\u80FD\u7CBE\u786E\u523010\u79D2\u3002
p20-7-2-3 = \u4F60\u53EF\u4EE5\u76F4\u63A5\u4F7F\u7528getter\u65B9\u6CD5\u5F97\u5230\u5168\u5C40\u6570\u636E\u8BB0\u5F55\uFF08\u4F8B\u5982\uFF0C\u548C\u5177\u4F53\u7684\u5B9E\u4F53\u3001\u96C6\u5408\u3001\u7F13\u5B58\u533A\u65E0\u5173\u7684\u6570\u636E\uFF09\uFF0C\u4F60\u4E5F\u53EF\u4EE5\u5728\u5177\u4F53\u67E5\u8BE2\u4E2D\u901A\u8FC7\u6807\u8BB0\u5B9E\u4F53\u540D\u3001\u6216HQL\u3001SQL\u8BED\u53E5\u5F97\u5230\u67D0\u5B9E\u4F53\u7684\u6570\u636E\u8BB0\u5F55\u3002\u8BF7\u53C2\u8003Statistics\u3001EntityStatistics\u3001CollectionStatistics\u3001SecondLevelCacheStatistics\u3001\u548CQueryStatistics\u7684API\u6587\u6863\u4EE5\u6293\u53D6\u66F4\u591A\u4FE1\u606F\u3002\u4E0B\u9762\u7684\u4EE3\u7801\u5219\u662F\u4E2A\u7B80\u5355\u7684\u4F8B\u5B50
p20-7-2-4 = \u5982\u679C\u4F60\u60F3\u5F97\u5230\u6240\u6709\u5B9E\u4F53\u3001\u96C6\u5408\u3001\u67E5\u8BE2\u548C\u7F13\u5B58\u533A\u7684\u6570\u636E\uFF0C\u4F60\u53EF\u4EE5\u901A\u8FC7\u4EE5\u4E0B\u65B9\u6CD5\u83B7\u5F97\u5B9E\u4F53\u3001\u96C6\u5408\u3001\u67E5\u8BE2\u548C\u7F13\u5B58\u533A\u5217\u8868\uFF1A<code>getQueries()</code>\u3001<code>getEntityNames()</code>\u3001<code>getCollectionRoleNames()</code>\u548C<code>getSecondLevelCacheRegionNames()</code>\u3002